article_id:1073,category_name:Events,title_name:Story Event Revival, Valentine's Confections, Is Now Live!,image_path:https://dragalialost.akamaized.net/attached/information/images/2b36a6006082f0ed9a0a249afdc9760c.png,message:<div>A story event revival, Valentine&#39;s Confections, went live at <span class="local_date" data-local_date="1581660000"></span>. And so we&#39;d like to say...</div><div><br></div><div>Happy Valentine&#39;s! The season for sharing your feelings with someone important to you is finally here.</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/2b36a6006082f0ed9a0a249afdc9760c.png"></div><div>Just what can you do on this lovey-dovey holiday? You can fight an array of fiends to collect items to create special memories with characters from the Halidom! But which will you choose? The especially strict priestess? The man with love to spare? Although, you never know who else may make an appearance!</div><div><br></div><div>Of course, how much story you experience is up to you... But we hope you make the most of this extra-sweet, gushy time of year!</div><div><br></div><div>■Event Overview</div><div>In the Valentine&#39;s Confections story event revival you can use event items acquired by clearing quests from the main campaign and various events to unlock special Valentine&#39;s stories.</div><div><br></div><div>■Acquiring Event Items</div><div>Clear quests from the main campaign and various events during the event to collect the event item, ravishing roses.</div><div><br></div><div>■Event Duration</div><div><span class="local_date" data-local_date="1581660000"></span> to <span class="local_date" data-local_date="1582869599"></span></div><div><br></div><div>■Reward Availability Period</div><div><span class="local_date" data-local_date="1581660000"></span> to <span class="local_date" data-local_date="1583474399"></span></div><div><br></div><div>■Additions</div><div>・Valentine&#39;s messages</div><div>During the event, you can obtain Valentine&#39;s gifts, which allow you to view a special stories that include special voiced lines when given to certain adventurers.</div><div>Note: You can get Valentine&#39;s gifts as rewards for limited-time endeavors, or from the Treasure Trade on the event page.</div><div><br></div><div>・Fleur</div><div>By giving adventurers Valentine&#39;s gifts and viewing their Valentine&#39;s messages, you can unlock a special story for Fleur.</div><div><br></div><div>・Valentine&#39;s cards</div><div>During the event, you will be able to get Valentine&#39;s cards, which are dragon&#39;s gift items you can use in the Dragon&#39;s Roost.</div><div><br></div><div>・Treasure Trade</div><div>The Treasure Trade lineup for the event has been refreshed!</div><div>Special stickers and items useful for unlocking nodes on the mana spiral have been added.</div><div><span style="color: rgb(226, 80, 65);">Note: Valentine&#39;s messages and Fleur&#39;s story are not used as unlock conditions for locked Treasure Trade items.</span></div><div><br></div><div>■How to Play</div><div>1. Collect ravishing roses!</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/4a3ba3ee9601dd5de2285e0249448507.png"></div><div>You can obtain ravishing roses from main campaign quests and various event quests during the event.</div><div>The number of ravishing roses you can obtain differs between quests. The more stamina a quest expends, the more ravishing roses you will get.</div><div>Note: Events that increase drop rewards do not apply to ravishing roses, and you will not receive ravishing roses from clearing The Mercurial Gauntlet quests.</div><div><br></div><div>2. Unlock event stories!</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/306ff044f4564caaf2f1529fe30d3ef6.png"></div><div>Use the ravishing roses you collected to unlock event stories.&nbsp;</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/2060a49424ab4cfc6c6634a55696fd4d.png"></div><div>There are event stories for multiple characters, which will be added over time during the event.</div><div>If you read each story to the end, then you will receive an event-specific wyrmprint.</div><div><br></div><div>3. Get event-specific Treasure Trade items!</div><div>In the Treasure Trade section on the event page, you can trade the ravishing roses event items for various items, such as twinkling sand, champion&#39;s testaments, and the event-specific wyrmprint The Petal Queen.</div><div>Some items in the Treasure Trade are unlocked by clearing event stories.</div><div>Collect lots of ravishing roses during the event!</div><div><br></div><div>4. Clear limited-time endeavors to earn rewards!</div><div>You can earn rewards like wyrmite, eldwater, and epithets by clearing Valentine&#39;s Confections endeavors. To clear endeavors, find and defeat the special rare enemies that appear during the event: Valentine&#39;s Slime and Choco Golem.</div><div>The Valentine&#39;s Slime and Choco Golem enemies can appear randomly in any quest where rare enemies appear.</div><div><br></div><div>Notes:</div><div>1. Details for the Valentine&#39;s Confections event revival are available by tapping Help on the event page.</div><div>2. Players must have completed up to Chapter 2 / 2-1 (Normal) of the main campaign to participate.</div><div>3. Players must have completed up to Chapter 2 / 2-1 (Normal) of the main campaign in order to play co-op.</div><div>4. To check the additional limited-time daily endeavors, tap Endeavors on the home page, then check the Daily tab.</div><div>5. You will not be able to use the ravishing roses event item in future events.</div><div>6. Some Treasure Trade rewards that appeared in the previous Valentine&#39;s Confections revival, such as sword tablets, will not appear in this Valentine&#39;s Confections revival.</div><div><br></div><div>Thank you for playing Dragalia Lost.</div>,start_time:1581660000,update_time1581479952