article_id:1173,category_name:Updates,title_name:Version Update[Update],image_path:,message:<div><span style="color: rgb(41, 105, 176);"><strong>[Addendum <span class="local_date" data-local_date="1585294200"></span>]</strong></span><br>・New maximum level unlocked for an event facility<br>With the addition of the Event Compendium, the Wind Shrine from the A Wish to the Winds facility event can now be leveled up to a maximum of level 35.</div><div><br></div><div><span style="color: rgb(41, 105, 176);"><strong>[Addendum <span class="local_date" data-local_date="1585191600"></span>]</strong></span></div><div>Update 1.18.1, which fixes certain issues, will be available for download around <span class="local_date" data-local_date="1585191600"></span>.</div><div>You may install it when it becomes available; otherwise, an automatic update will occur at approximately <span class="local_date" data-local_date="1585278000"></span>.</div><div><br></div><div>■Notes:<br>It may take time for the store to reflect the updated information. Players may not be able to perform updates due to their device&#39;s data cache being full. If you are unable to perform the update, restart your device, and then try downloading it from the store.</div><hr><div><span style="color: rgb(41, 105, 176);"><strong>[Update <span class="local_date" data-local_date="1585128600"></span>]</strong></span></div><div>・You will be able to check your Summon History</div><div>You will be able to check a record of summons you performed in the past via Help/Support on the Menu. Up to 30 summons from the past two weeks (14 days) will display in summon history. If two weeks (14 days) have passed since you last summoned, or if there are more than 30 summons recorded, older entries will be removed from the history.</div><div><strong>The Prize Tier Obtained section displayed in Summon Details under Summon History will only show results for summon showcases where you can obtain prizes.<br>For summon showcases where you cannot obtain prizes, it will display as N/A.</strong></div><div><br></div><hr><div>Update 1.18.0 will be now available for download at approximately <span class="local_date" data-local_date="1585106400"></span>.</div><div>You may install it right now; otherwise, an automatic update will occur at approximately <span class="local_date" data-local_date="1585278000"></span>.</div><div><br></div><div>When you update to version 1.18.0 and play co-op, you will no longer be matched with players using earlier versions of the game. Rooms created by players playing earlier versions will not display in the Room List, and you will not be able to join them using Find a Room or Join Nearby Players. Additionally, if you input an ID using Enter an ID, the room will display, but you will not be able to enter it. Lastly, rooms created by alliance members playing earlier versions will be visible in the alliance chat, but you will not be able to join the room. The &quot;All set, thanks!&quot; message will display in such cases.</div><div><br></div><div>To celebrate the update, we&#39;ll be sending all players a Tenfold Summon Voucher after the automatic update.</div><div>This notice will be modified after they&#39;ve been distributed.</div><div>Note: The Tenfold Summon Voucher will not be distributed until after the automatic update, even if you complete the update to version 1.18.0 early.</div><div><br></div><div>■Update Details</div><div>・You will be able to play past events any time</div><div>We are adding an Event Compendium feature that will allow you to play certain events held in the past any time you like. This will give players who started the game recently the opportunity to get facilities and other rewards from past events.</div><div>Note: There may be some changes, such as the features or rewards.</div><div>The Event Compendium will unlock at <span class="local_date" data-local_date="1585288800"></span>.</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/510985b98582e043cde781834f9d61eb.png"></div><div><br></div><div>・Chain co-abilities are here</div><div>When you update, all adventurers will gain chain co-abilities. Unlike existing co-abilities, the effects of chain co-abilities will stack when there are multiple abilities with the same effect.</div><div>Example: If an adventurer with the (Flame) Defense +10% chain co-ability and an adventurer with the (Flame) Defense +5% chain co-ability are on the same team, the combined effect will be Defense +15% for all flame-attuned adventurers on the team.</div><div><br></div><div>・Changes to how the effects of co-abilities are applied in co-op</div><div>Up to this point, co-abilities affected all adventurers participating in a quest, regardless of whether they belonged to your team or another player&#39;s team. Going forward, the co-abilities from your team will apply only to the adventurers who belong to you. If only one of the adventurers participating in the quest is from your team, then the effects of co-abilities from other adventurers in your team will apply to that adventurer.</div><div>With this change, you will be able to reliably produce your desired effects.</div><div><br></div><div>▼Tips for Chain Co-abilities</div><div>[Team of four adventurers with chain co-abilities that increase effectiveness when the combo count meets or exceeds a certain value]</div><div>Combos make adventurers stronger!</div><div>[Team of four adventurers with chain co-abilities that increase defense]</div><div>Reduce damage from enemies to give yourself more chances to attack!</div><div><br></div><div>▼Upgrading Chain Co-abilities</div><div>When you unlock mana nodes that upgrade co-abilities, chain co-abilities will also be upgraded.</div><div>Note: If you have already unlocked a mana node that upgrades a co-ability, the adventurer&#39;s chain co-ability will have been upgraded as well.</div><div><br></div><div>・New fafnir medal item</div><div>After <span class="local_date" data-local_date="1585288800"></span>, you will have a random chance of obtaining new items called fafnir medals when you clear a quest. You can trade medals that you&#39;ve collected for various items in the Treasure Trade.</div><div>Note: This does not apply to certain quests, such as The Mercurial Gauntlet and Astral Raids.</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/7efafcff0e17da6978a3df2b0b833491.png"></div><div><br></div><div>・Resetting the social reward for co-op</div><div>We will reset the number of times players can obtain the social reward, which can be obtained by playing co-op with another player for the first time, at <span class="local_date" data-local_date="1585288800"></span>. After clearing a quest, you can get 50 wyrmite per player (up to 50 times).</div><div><br></div><div>・You will be able to check your Summon History</div><div>You will be able to check a record of summons you performed in the past via Help/Support on the Menu. Up to 30 summons from the past two weeks (14 days) will display in summon history. If two weeks (14 days) have passed since you last summoned, or if there are more than 30 summons recorded, older entries will be removed from the history.</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/bd537545fc5f4ba73592c815be46958e.png"></div><div><br></div><div>■Other Changes</div><div>・Normal endeavors where you can get rewards for using skip tickets to clear Avenue to Power, Avenue to Fortune, and Elemental Ruins quests will be added at <span class="local_date" data-local_date="1585288800"></span>.</div><div>・The content of standard daily endeavors will be changed at <span class="local_date" data-local_date="1585288800"></span>.</div><div>・The smithy level requirement for crafting 3★ core weapons will be removed at <span class="local_date" data-local_date="1585279800"></span>. Note: This applies to tier one, tier two, and tier three weapons of all weapon types.</div><div>・An explanation called Skills that Target Multiple Enemies will be added to the Battles section under Help.</div><div>・We will also adjust the UI on some screens.</div><div><br></div><div>■Balance Adjustments</div><div>・When the following items are obtained as drop rewards or weekly bonuses in Advanced Dragon Trials, the amounts will no longer be randomized, and will be a set quantity instead.&nbsp;</div><div>The drop reward balance adjustments were applied in a data update around <span class="local_date" data-local_date="1585105200"></span>.<br>The weekly bonus adjustments will be applied <span class="local_date" data-local_date="1585548000"></span>.</div><div>Windwyrm&#39;s Greatsphere</div><div>Waterwyrm&#39;s Greatsphere</div><div>Flamewyrm&#39;s Greatsphere</div><div>Lightwyrm&#39;s Greatsphere</div><div>Shadowwyrm&#39;s Greatsphere</div><div>High Windwyrm&#39;s Tail</div><div>High Waterwyrm&#39;s Tail</div><div>High Flamewyrm&#39;s Tail</div><div>High Lightwyrm&#39;s Tail</div><div>High Shadowwyrm&#39;s Tail</div><div>High Windwyrm&#39;s Horn</div><div>High Waterwyrm&#39;s Horn</div><div>High Flamewyrm&#39;s Horn</div><div>High Lightwyrm&#39;s Horn</div><div>High Shadowwyrm&#39;s Horn</div><div><br></div><div>・You will be able to obtain the following items as weekly bonuses for each Advanced Dragon Trial on Expert difficulty.</div><div>&nbsp;This balance adjustment will be applied at <span class="local_date" data-local_date="1585548000"></span>.</div><div>High Windwyrm&#39;s Horn</div><div>High Waterwyrm&#39;s Horn</div><div>High Flamewyrm&#39;s Horn</div><div>High Lightwyrm&#39;s Horn</div><div>High Shadowwyrm&#39;s Horn</div><div><br></div><div>The following balance adjustments were applied in a data update applied around <span class="local_date" data-local_date="1585105200"></span>.</div><div>・We will increase adventurer experience and the number of rewards dropped when you clear Avenue to Power.</div><div>・We will make it so that 2★ wyrmprints and 2★ core weapons do not drop when you clear Avenue to Fortune and Elemental Ruins quests.</div><div>・We will make it so that tier one 3★ core weapons drop in Elemental Ruins, Dragon Trials, and The Imperial Onslaught quests on Beginner difficulty.</div><div>・We will make it so that tier two 3★ core weapons drop in Elemental Ruins, Dragon Trials, and The Imperial Onslaught quests on Standard difficulty.</div><div>・We will make it so that tier three 3★ core weapons drop in Elemental Ruins on Expert difficulty, and in Dragon Trials and The Imperial Onslaught on Expert and Master difficulties.</div><div>Note: The attunement of weapons dropped will vary based on the element of the quest.</div><div><br></div><div>The following balance adjustment will be applied at <span class="local_date" data-local_date="1585116000"></span>.</div><div>・We will increase the number of rewards in the daily bonus for clearing Avenue to Power.</div><div><br></div><div>■Issues Fixed</div><div>The following issues have been fixed in this version:</div><div>・When Pipple was included in your team, sometimes the Prince and Gala Prince appeared on the Home page simultaneously.</div><div>・The visual effects for certain adventurers and weapons did not display correctly when using skills or force strikes with Minimal Mode enabled. The applicable adventurers, skills, and force strikes are as follows.</div><div>Hunter Berserker: Force strike, skill 1</div><div>Hunter Vanessa: Force strike, skill 1</div><div>Hunter Sarisse: Force strike, skill 1</div><div>Veronica: Skill 1, skill 2</div><div>The applicable weapons are as follows.</div><div>Mega Sword</div><div>Mega Blade</div><div>Mega Dagger</div><div>Mega Axe</div><div>Mega Lance</div><div>Mega Bow</div><div>Mega Wand</div><div>Mega Staff</div><div>・After using a continue or a revive during a quest, the stance-switching button showed a different stance than the one that was active.<br>・When inflicting Burn, Paralysis, or Poison several times on the same enemy, the damage resulting from these afflictions was different from the expected value.<br>・In co-op, when dispelling the Burning Ambition buff applied by using Nobunaga&#39;s Dream Offensive skill, the resulting damage was different from player to player in certain cases.<br>・When Hunter Sarisse&#39;s force strike hit the Fatalis or Rathalos boss enemies multiple times, its strength was lower than intended.<br>・On the co-op room screen, if another player left the room while you were checking that player&#39;s information, the player&#39;s information displayed as &quot;Dummy.&quot;<br>・Lathna&#39;s Chaos Gift skill did not hit the targeted enemy when Minimal Mode was enabled.</div><div><br></div><div>Notes:</div><div>1. It may take time for the store to reflect the updated information. Players may not be able to perform updates due to their device&#39;s data cache being full. If you are unable to perform the update, restart your device, and then try downloading it from the store.</div><div>2. Any adventurers and game screenshots shown are still in development.</div><div><br></div><div><span style="color: rgb(41, 105, 176);"><strong>[Addendum <span class="local_date" data-local_date="1585278000"></span>]</strong></span></div><div>As a token of our appreciation, the following item has been sent to players who started playing before <span class="local_date" data-local_date="1585278000"></span>.</div><div><br></div><div>・Tenfold Summon Voucher x1</div><div><br></div><div>This gift can be claimed from your goodie box for up to seven days after reception. If the gift isn&#39;t retrieved within seven days, it will be lost.</div><div><br>Thank you for playing Dragalia Lost.</div>,start_time:1585105200,update_time1585294235