article_id:1337,category_name:Events,title_name:Master Difficulty Was Added to Volk's Wrath!,image_path:https://dragalialost.akamaized.net/attached/information/images/ce3b0f2536d0f722373c9e024260473e.png,message:<div>A new Master difficulty was added to Volk&#39;s Wrath in The Agito Uprising (high-difficulty quests where you&#39;ll face powerful foes from a new organization) at <span class="local_date" data-local_date="1590472800"></span>.</div><div>Clear it to earn materials required to craft tier-two 6★ weapons!</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/ce3b0f2536d0f722373c9e024260473e.png"></div><div>The Agito are fangs.</div><div>The Agito are an awakening.</div><div>The Agito are an uprising.</div><div><br></div><div>When a masked being referred to as an Agito appears, violent winds of plague blow across the land, and a hungry wolf bares his fangs. That wolf has a name, and that name is Volk.</div><div><br></div><div>■New Agito Series Weapons</div><div>A second tier was added to the powerful flame-attuned 6★ Agito weapons at <span class="local_date" data-local_date="1590472800"></span>. Enhancing the weapons to tier II adds an ability that has different effects depending on the weapon skill. What&#39;s more, the tier I weapon&#39;s level of unbinding is carried over when enhanced to tier II.</div><div><br></div><div>You must have first obtained specific weapons before you can craft weapons using materials obtained from Volk. The required weapons are the tier II flame-attuned 5★ weapons that can be crafted using materials obtained from the Volcanic Chimera in Void Battles.</div><div><br></div><div>The weapon that is required differs based on the weapon type for the weapon you wish to craft. You can check the requirements by selecting Materials for the Volk weapons on the Craft tab under Crafting.</div><div><br></div><div>・Agito weapons cannot be dismantled.</div><div><br></div><div>■Facility</div><div>The maximum level for the Flame Tree facility will be increased to level 25.</div><div><br></div><div>■Changes to Weekly Bonuses</div><div>Starting <span class="local_date" data-local_date="1590472800"></span>, you can obtain two of the crafting material added in Volk&#39;s Wrath: Master, rebellious one&#39;s insanity, in the weekly bonus for Volk&#39;s Wrath: Expert.</div><div><br></div><div>■Changes to Quest Display Order</div><div>The display order for The Agito Uprising quests was changed as follows at <span class="local_date" data-local_date="1590472800"></span>.</div><div>Volk&#39;s Wrath</div><div>Ciella&#39;s Wrath</div><div>Kai Yan&#39;s Wrath</div><div><br></div><div>Notes:</div><div>1. Players must have completed Chapter 10 / 6-3 (Normal) of the main campaign and any of the Standard difficulty Advanced Dragon Trials to play The Agito Uprising.</div><div>2. Players must have completed Volk&#39;s Wrath: Expert to play Volk&#39;s Wrath: Master.</div><div><br></div><div>Thank you for playing Dragalia Lost.</div><div><br></div>,start_time:1590472800,update_time1589882680