article_id:1666,category_name:Events,title_name:Master Difficulty Is Coming to Ciella's Wrath!,image_path:https://dragalialost.akamaized.net/attached/information/images/7cc40f848002316b91461ff2b602a199.png,message:<div>A new Master difficulty will be added to Ciella&#39;s Wrath in The Agito Uprising (high-difficulty quests where you&#39;ll face powerful foes from a new organization) at <span class="local_date" data-local_date="1602223200"></span>. Clear it to earn materials required to refine wind-attuned 6★ weapons!</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/7cc40f848002316b91461ff2b602a199.png"></div><div>The Agito despair before this cruel reality.</div><div>The Agito despair before putrid deception.</div><div>The Agito despair before false salvation.</div><div><br></div><div>With a malicious sneer, the wings of contempt thrust those who profess false justice into the depths of misery and anguish. These wings that laugh derisively at such despair have a name, and that name is Ciella.</div><div><br></div><div>■Changes to Weekly Bonuses</div><div>Starting at <span class="local_date" data-local_date="1602223200"></span>, you will be able to obtain the material added in Ciella&#39;s Wrath: Master in the weekly bonus for Ciella&#39;s Wrath: Expert.</div><div><br></div><div>■Changes to Survival Bonuses and the Number of Revives</div><div>Survival bonuses and the number of revives will change at <span class="local_date" data-local_date="1602223200"></span>. The number of revives in Ciella&#39;s Wrath: Expert will be changed to one, and survival bonuses will be added. The number of revives in Ciella&#39;s Wrath: Standard will be increased to two, and the survival bonus content will be changed.</div><div><br></div><div>■Adjustments to Drop Rewards</div><div>Starting at <span class="local_date" data-local_date="1602223200"></span>, you will be able to obtain more of the eligible materials that appear as drop rewards for the following quests:</div><div>・Volk&#39;s Wrath: Master (co-op)</div><div>Eligible materials: plagued one&#39;s mask fragment, rebellious one&#39;s insanity</div><div>・Kai Yan&#39;s Wrath: Master (co-op)</div><div>Eligible materials: uprooting one&#39;s mask fragment, rebellious one&#39;s arrogance</div><div><br></div><div>Notes:</div><div>1. Players must have completed Chapter 10 / 6-3 (Normal) of the main campaign and any of the Standard difficulty Advanced Dragon Trials in solo or co-op play to play The Agito Uprising.</div><div>2. Players must have completed Ciella&#39;s Wrath: Expert in solo or co-op play to play Ciella&#39;s Wrath: Master in solo play.</div><div>3. Players must have completed Ciella&#39;s Wrath: Expert in solo or co-op play to play Ciella&#39;s Wrath: Master in co-op play.</div><div><br></div><div>Thank you for playing Dragalia Lost.</div><div><br></div>,start_time:1601877600,update_time1601860119