article_id:1750,category_name:News,title_name:This Month in Dragalia Lost,image_path:,message:<div>Hello! Yuji Okada here, director of Dragalia Lost.</div><div><br></div><div>I want to start by thanking you for playing Dragalia Lost.</div><div><br></div><div>I think most players will agree that one of the most impactful and exciting of all the 2nd anniversary events is the daily free tenfold summon event, which is why we extended its duration as thanks for your passion and support during this monumental update. This extension means that you can perform a tenfold summon for free once per day on the Gala Dragalia summon showcase going on now, so I hope you use this chance to make your roster even stronger!</div><div><br></div><div>Speaking of which, Gala Reborn Poseidon appears in this Gala Dragalia, and he happens to be the first water-attuned gala dragon in the game&#39;s history. To learn more about how this particular dragon came into being, be sure to keep up to date with the latest story developments by playing chapter 16 of the main campaign.</div><div><br></div><div>Not content to let Gala Reborn Poseidon make history all on his own, Lapis is also featured, and she&#39;s our very first water-attuned manacaster adventurer. What&#39;s more, her manacaster is the first to sport the rapid-fire mode, which lets her unleash a barrage of shots with her force strike.</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/3b2c4c15465c3a0ee4a03d51474d088a.png"></div><div><br></div><div>You can get to know Lapis better in The Phantom&#39;s Ransom facility event that&#39;s going on now. Play though this event to earn a facility that boosts the stats of bow- and manacaster-wielding adventurers.</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/f532c932c025c42516ae104bf09f3dc5.png"></div><div><br></div><div>You may notice something special about this event&#39;s theme music. In creating a song fit for an opera-themed event, we thought it only natural that it be sung by the stars of the show themselves, Lapis and Karina, and their Japanese voice actors agreed!</div><div><br></div><div>■Plans for This Month</div><div>・The adventurer Opera Karina and the dragon Giovanni, who appear in The Phantom&#39;s Ransom event, will also appear in a summon showcase starting at <span class="local_date" data-local_date="1604469600"></span>. For further details like their stats and skills, please see the corresponding in-game notification.</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/94f48727c1b748dd31c505a7f130aca7.png"></div><div><br></div><div>・Renee and Laranoa&#39;s mana spirals will be unlocked.</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/a9283ae146ac472ad4a6d731216d8ab4.png"></div><div><br></div><div>・After The Phantom&#39;s Ransom facility event has ended, a defensive event will begin. The stage is set in lands to the north, but you&#39;ll have to wait and see who the actors are!</div><div><br></div><div>・As announced in the most recent Dragalia Digest, Master difficulty for Tartarus&#39;s Wrath will be available starting at <span class="local_date" data-local_date="1605074400"></span>. With this addition, players will be able to challenge Master-difficulty Agito bosses of all five elements.</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/74f8a402f2e82aed52063215e0cef277.png"></div><div><br></div><div>・The New Year&#39;s Tidings: A Clawful Caper raid event will make a return in mid-November. You&#39;ll have a chance to add the event-exclusive adventurer Hanabusa to your team if you haven&#39;t already.</div><div><br></div><div>Fans of this event will be happy to hear that this year&#39;s New Year&#39;s event will involve Hinomoto as well. If you&#39;re not familiar with Hinomotoan customs and culture, I encourage you to play through this event revival to learn more about our friends from the east of Alberia.</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/a614bc85d36138b9f18823541db99a9d.png"></div><div><br></div><div>・Also announced in the most recent episode of Dragalia Digest, the Legend difficulty for Volk&#39;s Wrath will be available in late November. As it is the new highest difficulty, taking on this quest will not be for the unprepared or the faint of heart, but since it is designed to be more of a test of progression rather than a means of progression, I hope that players will be able to really sink their teeth into it.</div><div><br></div><div>Please note that in the interest of maintaining game balance, Legend-difficulty quests may only be undertaken by teams of a certain element. For Volk&#39;s Wrath: Legend, only teams of flame-attuned adventurers may be used.</div><div><br></div><div>■Future Updates<br>・If you watched the latest Dragalia Digest, then you may remember mention of exciting news to be revealed in early November. Well, you won&#39;t have to wait much longer, as we&#39;ll be sharing further details soon. Stay tuned to the in-game notification board and the official Twitter account!<br><br>・The wyrmprint quality-of-life features mentioned in last month&#39;s edition of This Month in Dragalia Lost will be added in an update in late November.<br><br>First, you&#39;ll be able to register a group of wyrmprints as a set so you can easily swap sets between adventurers. The Optimize feature will be tweaked so it does not exceed any ability value limits when choosing the optimal wyrmprint combinations.<br><br>Second, the sort feature will be revised to better match the specific effects that wyrmprints now possess. For example, you will be able to easily identify wyrmprints with abilities that increase skill damage, sort wyrmprints by affinity, and view only wyrmprints of a particular affinity.<br><br>Finally, a text entry field will be added to the Edit Teams and Treasure Trade for wyrmprints screens that allows you to directly input the name of a wyrmprint or an ability to quickly find exactly what you&#39;re looking for.<br><br>・The Fractured Futures and Forgotten Truths raid events are deeply connected to the heart of Dragalia Lost&#39;s lore and play a vital role in explaining the overarching story. Given their importance, we want to be sure that new players are not left out of the loop, so we plan to make solo-play versions of these quests for use in the Event Compendium.<br><br>・A new series of high-difficulty bosses to succeed the Agito is coming next year. Battles in the Agito Uprising incorporated a transformation mechanic in which the bosses began their fights as humans and transformed into even more powerful beasts as the battle raged on, and the next series of bosses will similarly include a never-before-seen mechanic designed to keep players on their toes.<br><br>・Starting at <span class="local_date" data-local_date="1604469600"></span>, the Alberian Battle Royale will be available from <span class="local_weekly_time" data-local_date="1670997600"></span> to <span class="local_weekly_time" data-local_date="1671170340"></span>.<br><br>This time, players will transform into Cupid, a dragon with a healing skill. Midgardsormr&#39;s powerful attacks have helped many a player claw their way to victory, but now that healing is available to all weapon types through this dragon, it&#39;ll be interesting to see how the flow of combat changes.<br><br>We plan to add additional elements to the Alberian Battle Royale and adjust its rewards in updates this month and the next.<br><br>■In Conclusion<br>We&#39;re giving all players the following items this month.<br>・5,000,000 rupies<br>・Exquisite Honey x20</div><div>・Four-Leaf Clover x10<br><br>The next installment of This Month in Dragalia Lost will be posted around <span class="local_date" data-local_date="1606802400"></span>.<br><br>Until then, thanks for reading, and for continuing to play Dragalia Lost!<br><br>Yuji Okada<br>Director, Dragalia Lost<br><br>Notes:<br>・The gift can be claimed from your goodie box for up to seven days after reception. If the gift isn&#39;t retrieved within seven days, it will be lost.<br>・Summon showcase, event, and update content may change without notice.<br>・Any adventurers and game screenshots shown are still in development.</div>,start_time:1604210400,update_time1604041595