article_id:1844,category_name:News,title_name:Regarding Adjustments to the Alberian Battle Royale with Version 2.3.0,image_path:,message:<div>This notification contains information regarding adjustments to the Alberian Battle Royale with the release of Version 2.3.0.</div><div><br></div><div>■Changing Adventurer and Weapon Skins</div><div>From Version 2.3.0 onward, players will be able to change the skins of adventurers and weapons in The Alberian Battle Royale. Players can spend appearance tickets to access different skins of the adventurers in their roster from the Adventurer Settings screen.</div><div><br></div><div>Notes:</div><div>・Appearance tickets will appear as monthly battle point rewards starting in January of 2021.</div><div>・Skins included in the Treasure Trade lineup as of Version 2.2.0 will continue to be available exclusively from the Treasure Trade.</div><div>・Not all adventurers have an unlockable skin.</div><div><br></div><div>Players can choose a weapon skin to use from those that they have unlocked from the Adventurer Settings screen. (Not all weapons have an unlockable skin.)</div><div><br></div><div>■Ability Tokens Added</div><div>Ability tokens can be collected from various locations on the map and used to perform an ability. There is no limit to the number of ability tokens that a player can possess, and multiple ability tokens can be held at once, but the effects of the same ability cannot be stacked. For further information on abilities, please see the &quot;How to Play&quot; section of The Alberian Battle Royale event screen.</div><div><br></div><div>■Volcano Section Added</div><div>From Version 2.3.0 onward, the map will contain a volcano-themed area. As time passes, fireballs will begin to rain down across the entire map. Players can collect new skill tokens and ability tokens from their impact craters. For further information on skills and mechanics, please see the &quot;How to Play&quot; section of The Alberian Battle Royale event screen.</div><div><br></div><div>■Schedule and Availability Update</div><div>The Alberian Battle Royale will be available at all times from <span class="local_date" data-local_date="1608703200"></span> to <span class="local_date" data-local_date="1609912799"></span>.</div><div><br></div><div>The weekly schedule of <span class="local_weekly_time" data-local_date="1670997600"></span> to <span class="local_weekly_time" data-local_date="1671170340"></span> will return at <span class="local_date" data-local_date="1609912800"></span>.</div><div><br></div><div>■Issues Addressed</div><div>The name of the Gala Mym skin in the Treasure Trade will be corrected from &quot;Mym (Skin)&quot; to &quot;Gala Mym (Skin)&quot; in a data update around <span class="local_date" data-local_date="1608530400"></span>.</div><div><br></div><div>Thank you for playing Dragalia Lost.</div>,start_time:1608012000,update_time1607931712