article_id:1912,category_name:Events,title_name:Legend Difficulty Is Coming to Kai Yan's Wrath!,image_path:https://dragalialost.akamaized.net/attached/information/images/35637db8426b2f6e994196f0dd657ab2.png,message:<div>A new Legend difficulty will be added to Kai Yan&#39;s Wrath in The Agito Uprising (high-difficulty quests where you&#39;ll face powerful foes) at <span class="local_date" data-local_date="1611727200"></span>.</div><div><br></div><div>Kai Yan&#39;s Wrath: Legend may only be undertaken by a team of shadow-attuned adventurers. Clear this quest to earn materials required to further refine shadow-attuned 6★ weapons. Once an Agito weapon is refined to its second stage, its appearance will change!</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/35637db8426b2f6e994196f0dd657ab2.png"></div><div>A solitary monster awakens from his slumber.</div><div>He perfects his flesh and takes his ultimate form.</div><div>He is an Agito&mdash;the pinnacle of evolution.</div><div><br></div><div>To this tyrant, the idea of coexistence is nothing more than a loathsome and abhorrent weakness. An emissary of extinction, he unleashes thunderbolts of annihilation in rebellion against a world that stagnates in peace. This crushing tyrant has a name, and that name is Kai Yan.</div><div><br></div><div>■Changes to Survival Bonuses and the Number of Revives</div><div>Survival bonuses and the number of revives will change at <span class="local_date" data-local_date="1611727200"></span>. The number of revives in Kai Yan&#39;s Wrath: Master will be changed to one, and survival bonuses will be added. The number of revives in Kai Yan&#39;s Wrath: Expert will be increased to two, and the survival bonus content will be changed. The number of revives in Kai Yan&#39;s Wrath: Standard will be increased to three, and the survival bonus content will be changed.</div><div><br></div><div>Notes:</div><div>1. Players must have completed Chapter 10 / 6-3 (Normal) of the main campaign and any of the Standard-difficulty Advanced Dragon Trials in solo or co-op play to play The Agito Uprising.</div><div>2. Players must have completed Kai Yan&#39;s Wrath: Master in solo or co-op play to play Kai Yan&#39;s Wrath: Legend in solo play.</div><div>3. Players must have completed Kai Yan&#39;s Wrath: Master in solo or co-op play to play Kai Yan&#39;s Wrath: Legend in co-op play.</div><div><br></div><div>Thank you for playing Dragalia Lost.</div><div><br></div>,start_time:1611122400,update_time1610434301