article_id:2536,category_name:Events,title_name:A New Raid Event, Faith Forsaken (Part Two), Is Now Live![Update],image_path:https://dragalialost.akamaized.net/attached/information/images/fd3bcee9812bc3ca1cbee866caca2fc2.png,message:<div>[Updated <span class="local_date" data-local_date="1634277600"></span>]<br>The adventurers Basileus and Sandalphon have been added to the Event Perks section.</div><hr><div><br></div><div>Up to four players with four adventurers each (up to 16 adventurers in total!) can battle together in the Faith Forsaken (Part Two) raid event, which began on <span class="local_date" data-local_date="1634104800"></span>.&nbsp;</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/fd3bcee9812bc3ca1cbee866caca2fc2.png"></div><div><br></div><div>On Nightmare difficulty, up to 16 players can control one adventurer each. Take on event-specific quests to defeat the raid boss with no elemental attunement and earn rewards!</div><div><br></div><div>This event&#39;s theme song is &quot;Light a Fire&quot; by Honoka Watanabe.</div><div><br></div><div>■Event Duration</div><div><span class="local_date" data-local_date="1634104800"></span> to <span class="local_date" data-local_date="1635227999"></span></div><div><br></div><div>Omega difficulty will unlock on <span class="local_date" data-local_date="1634536800"></span>.</div><div><br></div><div>Note: If the event ends while you are in a quest, the quest will continue until the results have been determined. You will be able to earn rewards according to the results of the quest.</div><div><br></div><div>■Reward Availability Period</div><div><span class="local_date" data-local_date="1634104800"></span> to <span class="local_date" data-local_date="1635832799"></span></div><div>Note: You will be able to perform blazon summons and obtain emblem rewards during this period.</div><div><br></div><div>■Changes to Nightmare Difficulty</div><div>The raid battle on <strong>Nightmare difficulty</strong> features up to 16 players controlling one adventurer each, and players will be able to earn Daily Damage Rewards. See the &quot;About Daily Damage Rewards&quot; section of this notification for further details.</div><div><br></div><div>■Epilogue</div><div>The epilogue for this event will unlock on <span class="local_date" data-local_date="1635228000"></span>.</div><div><br></div><div>■Epilogue Availability</div><div><span class="local_date" data-local_date="1635228000"></span> to <span class="local_date" data-local_date="1635832799"></span></div><div><br></div><div>■Event Perks</div><div>While this event is active, the adventurers Nevin, Pinon, Faris, Ryszarda, Regina Basileus and Sandalphon will have special abilities that activate in quests for this event. See Event Perks on the main event screen in-game for more information.</div><div><br></div><div>■Co-op (Quick Play)</div><div>Raid battles on Beginner, Expert, and Nightmare difficulty feature a special co-op system that does not require players to create rooms to play together. Simply choose your desired difficulty and team and you will be automatically matched with other players.</div><div><br></div><div>■Raid Battles</div><div>Raid battles are co-op battles where up to four teams (up to 16 adventurers in total) can cooperate against a raid boss together! Creating or joining a room requires otherworld fragments and getherwings. You can obtain otherworld fragments from boss battles.</div><div><br></div><div>■Extra Raid Battles</div><div>To challenge the Extra Raid Battle, you must clear the raid battle on Expert. Creating or joining a room requires an otherworld gem. You can obtain otherworld gems from the Expert-, Nightmare-, and Omega-difficulty raid battles.</div><div><br></div><div>■Nightmare Difficulty</div><div>To challenge Nightmare difficulty, you must clear the Extra Raid Battle. The amount of otherworld fragments and getherwings required to challenge Nightmare difficulty and the drop rewards available from it are the same as Expert difficulty.</div><div><br></div><div>Once per day, when you clear Nightmare difficulty, you can get a Grand Bounty. The Grand Bounty you receive is randomly selected from a set of rewards.</div><div><br></div><div>The raid battle on Nightmare difficulty features up to 16 players controlling one adventurer each with the goal of dealing as much damage as possible to the boss within the allotted time. Damage dealt during this quest counts toward the completion of Daily Damage Rewards.</div><div><br></div><div>Shared skills cannot be used on Nightmare difficulty. If a shared skill can be used as a weapon skill, it will be used as a weapon skill (instead of a shared skill). Although only a single adventurer from your team will participate in the battle, any abilities or co-abilities that are equipped by the other members of the team will also take effect. Adventurers with the &quot;Locked Sigil&quot; debuff will have this debuff removed after the quest begins. Locked Sigil may be removed for different players at different times depending on the stability of their network connection.</div><div><br></div><div>■Damage Dealt on Nightmare Difficulty<br>Players can check how much damage has been dealt to the boss in the &quot;Damage (Nightmare)&quot; section of the event screen. &quot;All Players&quot; shows how much damage all players dealt in total on a certain day between 07:00 and 06:59 the following day and is updated every day at 07:20. &quot;You&quot; shows how much damage you dealt. Note that there are no rewards for damage dealt individually.<br><br>You can also see how much damage you dealt on the results screen. &quot;Damage Dealt&quot; shows how much damage you dealt in that particular quest. &quot;Personal Best&quot; shows the highest amount of damage you dealt in all quests during this event.<br><br>Your damage dealt will not be recorded if your connection is interrupted, you give up, or you leave due to inactivity. Damage dealt by afflictions will be credited to the player who inflicted that affliction. Damage dealt by summoned Personas or Bahamut will be credited to the player who summoned them.<br><br>■About Daily Damage Rewards<br>Players can earn Daily Damage Rewards based on the total amount of damage that all players deal to Satan in the raid battle on Nightmare difficulty. You must clear the quest in order to receive credit for the damage you inflicted during it. Both the damage counter and the available rewards reset each day. <strong>Once a day&#39;s rewards are earned, visit the event screen after 09:00 the following day to send those rewards to the Limited section of your goodie box.</strong><br><br>■About the Event-Exclusive Skill<br>As players continue to attack Satan throughout the battle, he will eventually become staggered. Each time Satan becomes staggered, players can use an event-exclusive skill by tapping the bottom-right corner of the screen. On Nightmare difficulty, this skill can be used to restore HP to the user.<br><br>■Omega Difficulty<br>To challenge Omega difficulty, you must clear the raid battle on Nightmare difficulty. Additionally, to unlock Omega difficulty, you must collect three omega keys. You can obtain one omega key from each type of emblem reward: bronze emblems, silver emblems, and gold emblems.<br><br>・Omega Level 1 (Solo)<br>This quest is for solo play only. It will unlock when you clear the raid battle on Nightmare difficulty.<br><br>・Omega Level 1 (Raid)<br>This quest is for co-op play only and will unlock when you clear Omega Level 1 (Solo).<br><br>・Omega Level 2 (Solo)<br>This quest is for solo play only and will unlock when you clear Omega Level 1 (Raid).<br><br>・Omega Level 2 (Raid)<br>This quest is for co-op play only and will unlock when you clear Omega Level 2 (Solo).<br><br>・Omega Level 3 (Solo)<br>This quest is for solo play only and will unlock when you clear Omega Level 2 (Raid).<br><br>・Omega Level 3 (Raid)<br>This quest is for co-op play only and will unlock when you clear Omega Level 3 (Solo).<br><br>■Raid Boosts<br>When you clear raid battles, you&#39;ll be able to get raid boosts, which power up adventurers for this event only.<br><br>Raid boosts you obtain will stack and only apply to your team. The maximum effects you can achieve with raid boosts are described below.<br>・Damage +100%<br>・HP +50%<br>・Shapeshift Prep +25%<br>・Dragon Time +50%<br><br>The number of raid boosts you can obtain by clearing a single quest varies depending on the difficulty. There are also special rare raid boosts. In this event, you will not be able to obtain rare raid boosts from boss battles or quests with fixed stats, or obtain rare raid boosts for Overdrive Punisher or Broken Punisher.<br><br>Raid battle co-op rooms will display each team&#39;s boosted might, which factors in the increased power from raid boosts. Boosted might does not affect the might required to start a quest.<br><br>■Blazon Summons<br>Complete boss battles and raid battles to obtain peregrine blazons. Blazons collected can be used for blazon summoning to get orichalcum and other rewards.<br><br>After obtaining orichalcum, you can reset the contents available. From the fifth reset onward, you must accept all rewards before you can reset the contents available.<br><br>■Emblems<br>You can obtain various rewards based on the total number of emblems you gather during the event.<br><br>■Event Endeavors<br>Two types of event endeavors will be available during the event: Daily and Limited.<br><br>■About Memory-Related Crashes<br>Playing this event on certain devices may cause the game to crash due to insufficient memory. To alleviate this issue, please try switching to the &quot;Basic&quot; option for Visual Effects in the Game section of the Options screen, or tapping the &quot;Enable Minimal Mode&quot; button in the System section of the Options screen.<br><br>Notes:<br>1. During raid battles, you will only recover 1/4 of the amount of HP from certain skills and abilities.<br>2. Players must have completed up to Chapter 2 / 2-1 (Normal) of the main campaign to participate in event quests.<br>3. Players must have completed up to Chapter 2 / 2-1 (Normal) of the main campaign to play co-op.<br>4. You will not be able to use blazons, emblems, or otherworld fragments obtained in this event in future events.<br>5. For details concerning this raid event, check the Help section on the raid event&#39;s top page in the game.<br><br>Thank you for playing Dragalia Lost.&nbsp;</div>,start_time:1634104800,update_time1634277797