article_id:2622,category_name:Updates,title_name:Version Update [Update],image_path:,message:<div><span style="color: rgb(41, 105, 176);"><strong>[Addendum <span class="local_date" data-local_date="1637895600"></span>]</strong></span><br>As a token of our appreciation, the following item has been sent to players who started playing before <span class="local_date" data-local_date="1637895600"></span>.<br><br>・Tenfold Summon Voucher &times; 1<br><br>This gift can be claimed from your goodie box for up to seven days after reception. If the gift isn&#39;t retrieved within seven days, it will be lost.</div><div><br></div><hr><div>Version 2.14.0 will be available for download around <span class="local_date" data-local_date="1637809200"></span>. You may install it when it becomes available; otherwise, an automatic update will occur around <span class="local_date" data-local_date="1637895600"></span>.</div><div><br></div><div>When you update to version 2.14.0 and play co-op, you will no longer be matched with players using earlier versions of the game. Rooms created by players using earlier versions will not display in the Room List, and you will not be able to join them using Find a Room, Join Nearby Players, Enter an ID, or alliance chat.</div><div><br></div><div>To celebrate the update, we&#39;ll be sending all players a Tenfold Summon Voucher after the automatic update. This notice will be updated after it has been distributed.</div><div><br></div><div>Note: The Tenfold Summon Voucher will not be distributed until after the automatic update, even if you complete the update to version 2.14.0 early.</div><div><br></div><div>■Update Details</div><div>・Players will be able to reread previous stories from the main campaign and certain events in Notte&#39;s Notes. To unlock this feature, you must clear Ch. 2 / 2-1, The Sylvan Archer.</div><div><br></div><div>Each chapter of the main campaign will be added to Notte&#39;s Notes when you complete the final story of that particular chapter. Part one of a chapter will not be added until you complete the final story of part two (at which point both parts will be added together).</div><div><br></div><div>Event stories will be added to Notte&#39;s Notes after each event ends, even if you have not completed all stories of that particular event. The stories of certain events will not be added to Notte&#39;s Notes.</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/1c6904a3bd8cf7a64edd5a2d58120632.png"></div><div><br></div><div>・Support for upcoming adventurers and quests scheduled to appear in late November through December will be added and certain unresolved issues will be addressed.</div><div><br></div><div>Notes:</div><div>1. It may take time for the store to reflect the updated information. Players may not be able to perform updates due to their device&#39;s data cache being full. If you are unable to perform the update, restart your device, and then try downloading it from the store.</div><div>2. Any adventurers and game screenshots shown are still in development.</div><div>3. A large data download will occur on the title screen the first time you start the game after updating to version 2.14.0. We recommend downloading this data while connected to Wi-Fi. Since approximately the same amount of existing data will simultaneously be deleted, there is no need to prepare a large amount of storage space on your device.</div><div><br></div><div>Thank you for playing Dragalia Lost.</div>,start_time:1637204400,update_time1637895577