article_id:2998,category_name:Events,title_name:A New Challenge Event, The Mercurial Gauntlet, is Here![Update],image_path:https://dragalialost.akamaized.net/attached/information/images/115cecefb42e37756f6deda273578a6f.png,message:<div><span style="color: rgb(44, 130, 201);"><strong>[Addendum <span class="local_date" data-local_date="1647324000"></span>]</strong></span></div><div><span style="color: rgb(0, 0, 0);">The following quests were added to The Mercurial Gauntlet at <span class="local_date" data-local_date="1647324000"></span>.<br>■The Mercurial Gauntlet (Flame) Lv. 71 - The Mercurial Gauntlet (Flame) Lv. 80</span></div><div><span style="color: rgb(0, 0, 0);">■The Mercurial Gauntlet (Shadow) Lv. 71 - The Mercurial Gauntlet (Shadow) Lv. 80</span></div><div><span style="color: rgb(0, 0, 0);">Note: Fafnir Roy III&#39;s attack behavior changes from level 51 onward.</span></div><div><span style="color: rgb(0, 0, 0);">・Starting at level 61, you must use a team of one or more specific elements.</span></div><div><br></div><hr><div>The Mercurial Gauntlet features Solo-only quests which can be played without expending stamina.</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/115cecefb42e37756f6deda273578a6f.png"></div><div>&quot;Faf fee! (I&#39;m Fafnir Roy III!)&quot;&nbsp;</div><div>There is a mysterious dragon called Fafnir Roy III who rules over a great treasury and is searching for someone worthy of obtaining that fortune. A dazzling mountain of treasure awaits those who can appease Fafnir Roy III. Enter the Mercurial Gauntlet to claim the prize!</div><div><br>■The Mercurial Gauntlet Overview</div><div>In this event quest, players will battle Fafnir Roy III, a dragon who lives in the Halidom&#39;s treasury and loves treasure, to obtain rewards.</div><div><br>■How to Play</div><div>The Mercurial Gauntlet is comprised of the following five elementally-attuned quests:</div><div>・The Mercurial Gauntlet (Flame) Lv. 1 - Lv. 80</div><div>・The Mercurial Gauntlet (Water) Lv. 1 - Lv. 80</div><div>・The Mercurial Gauntlet (Wind) Lv. 1 - Lv. 80</div><div>・The Mercurial Gauntlet (Light) Lv. 1 - Lv. 80</div><div>・The Mercurial Gauntlet (Shadow) Lv. 1 - Lv. 80</div><div>Note: Fafnir Roy III&#39;s attack behavior changes from level 51 onward.</div><div>・Starting at level 61, you must use a team of one or more specific elements.</div><div><br></div><div>You will face off with an elemental variant of Fafnir Roy III based on the quest you select.</div><div>Once defeated, the quest level for that element will rise and Fafnir Roy III will get stronger.</div><div>Each time you defeat Fafnir Roy III and increase the quest level, The Victor&#39;s Trove, which is the reward you&#39;ll get each month, will get even better.</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/3a8af1cc135a49d7ec919e27575224d0.png"></div><div>Feeling confident in your skills? All the better! Challenge these quests to see how high you can raise the level!</div><div><br></div><div>■Rewards</div><div>There are two types of rewards in The Mercurial Gauntlet.</div><div><br></div><div>・Clear Rewards</div><div>These are rewards you can obtain by completing quests.</div><div>They can only be obtained once per quest.</div><div><br></div><div>The Victor&#39;s Trove</div><div>These rewards can be claimed once per month.</div><div>The contents of The Victor&#39;s Trove vary based on your Combined Lv., which is a total of last level you cleared for each quest. <img src="https://dragalialost.akamaized.net/attached/information/images/041db69cf5d2cdc04a1c69e021a1e7d8.png"></div><div>The Victor&#39;s Trove can be claimed once on the event quest screen for The Mercurial Gauntlet after 10:00 PM PT on the 14th of each month. You can claim The Victor&#39;s Trove again after 10:00 PM PT on the 14th of the next month.</div><div>Note: If you do not claim The Victor&#39;s Trove before 10:00 PM PT on the 14th of the next month, you will be unable to claim it. Your Combined Lv. will not reset, even after claiming The Victor&#39;s Trove.</div><div><br>■Endeavors</div><div>There are endeavors which you can only complete by playing The Mercurial Gauntlet.</div><div>You can check the endeavors which can be completed by playing The Mercurial Gauntlet, and their rewards, via the The Mercurial Gauntlet Endeavors List notification.</div><div><a href="https://dragalialost.com/en/news/detail/20000">【The Mercurial Gauntlet Endeavors List】</a></div><div><br></div><div>Notes:</div><div>1. Players must have completed up to Chapter 2 / 2-1 (Normal) of the main campaign to participate.</div><div>2. For more information about The Mercurial Gauntlet, select More on the in-game footer menu, then tap Help/Support, and see The Mercurial Gauntlet under Help.</div><div>3. Once you clear a level in The Mercurial Gauntlet, you will be unable to challenge that level again.</div><div>Note: Once all levels for a given quest have been cleared, it is possible to replay the final level of that quest.</div><div>4. For certain endeavors, meeting the conditions by playing The Mercurial Gauntlet will not count toward completing the endeavor, unless the endeavor specifies The Mercurial Gauntlet in its conditions.</div><div>Example: If an endeavor&#39;s condition is &quot;Clear Five Quests,&quot; clearing The Mercurial Gauntlet quests will not count towards those five quests because playing The Mercurial Gauntlet is not included in its conditions.</div><div>5. You will not earn Player EXP or Adventurer EXP when clearing The Mercurial Gauntlet quests.<br><br>Thank you for playing Dragalia Lost.</div>,start_time:1647324000,update_time1647337707