article_id:406,category_name:News,title_name:High Mercury's Trial Added to Advanced Dragon Trials!,image_path:,message:<div>High Mercury&#39;s Trial was added to the Advanced Dragon Trials, the most challenging of event quests, at <span class="local_date" data-local_date="1555567200"></span>.</div><div><br></div><div>With both strength and kindness, Mercury uses her immense mana to coat her body. Prepare yourself for battle!</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/a9d746598e736ef0e8ce62100de92371.png"></div><div><br></div><div>Changes accompanying the release of High Mercury&#39;s Trial:</div><div><br></div><div>1. High Mercury and the Fafnir Statue (Water) facility were added to the Advanced Dragon Trials section of Treasure Trade.</div><div><br></div><div>The High Mercury dragon is described below.</div><div><br></div><div>■Stats</div><div>・Lv 100/100</div><div>・HP 357</div><div>・Strength 113</div><div>・Might 1070</div><div><br></div><div>■Dragon Details</div><div>The Waterwyrm Mercury after releasing her true powers. Her immense mana acts as a great current that coats her body. With the kindness to protect those she cares for&mdash;and the strength to repel all threats&mdash;she&#39;s a truly wondrous dragon.</div><div><br></div><div>■Skills</div><div>・Aqua Spiral</div><div>Deals water damage to surrounding enemies, draws them toward the user, and inflicts bog.</div><div><br></div><div>■Abilities</div><div>・(Water) HP &amp; Strength +30%</div><div>If the user is attuned to Water, increases HP and strength by 30%.</div><div>・Dragon Time +20%</div><div>Extends shapeshift time by 20%.</div><div><br></div><div>The stats shown here represent the dragon at maximum level, maximum bond, and fully unbound. They do not represent the stats when first obtained.</div><div><br></div><div>The Fafnir Statue (Water) facility is described below.</div><div><br></div><div>■Stats</div><div>・HP +11.5%</div><div>・Strength +11.5%</div><div>Boosts the HP and strength of water dragons.</div><div><br></div><div>The stats shown here represent the facility at maximum level. They do not represent the stats when first obtained.</div><div><br></div><div>2. The Queen of the Blue Seas wyrmprint was added to the Imperial Onslaught section of the Treasure Trade menu.</div><div><br></div><div>The Queen of the Blue Seas wyrmprint is described below.</div><div><br></div><div>■ Abilities</div><div>・High Mercury Res +25% (Max 25%)</div><div>・Mercury Res +20% (Max 25%)</div><div>・Water Res +5% (Max 15%)</div><div><br></div><div>The stats shown here represent the wyrmprint at maximum level and fully unbound. They do not represent the stats when first obtained.</div><div><br></div><div>Notes:</div><div>1. In order to challenge High Mercury&#39;s Trial, a player&#39;s team must have 13,000 might or higher.</div><div>2. Players must have completed Mercury&#39;s Trial: Master to challenge High Mercury&#39;s Trial.</div><div>3. Players must have completed up to Chapter 2 / 2-1 (Normal) of the campaign in order to play co-op.</div><div><br></div><div>Thank you for playing Dragalia Lost.</div>,start_time:1555567200,update_time1555468320