article_id:453,category_name:Events,title_name:A Raid Event Revival, Resplendent Refrain, Is Now Live!,image_path:,message:<div>Up to four players with four adventurers each (up to 16 adventurers in total!) can battle together in the Resplendent Refrain raid event revival, which began <span class="local_date" data-local_date="1557813600"></span>. Take on event-specific quests to defeat the shadow-attuned raid boss and earn rewards!</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/86a7a59da45d7760dfe77febff813977.png"></div><div>A melody, pure and peaceful, echoes throughout a snow-bound town. Its source is the town&#39;s well-known children&#39;s choir, a beacon of innocence for this tight-knit community. Behind the scenes, however, the town&#39;s adolescents slowly succumb to a dark presence... Will the Prince and friends be able to defeat the massive fiend Sabnock, who gains strength by absorbing the darkness in people&#39;s hearts?</div><div><br></div><div>An adventurer, Elias, will join you during this event. Increase your friendship with him to add him to your roster permanently. You can also collect blazons and emblems to get the dragon Maritimus and the As the Snow Falls wyrmprint.</div><div><br></div><div>Here are some of the additions you can expect to see in the Resplendent Refrain raid event revival:</div><div><br></div><div>■Additions</div><div>・New difficulty added</div><div>A new raid battle difficulty, Nightmare, has been added.</div><div>It will unlock after a certain amount of time if you have completed Sabnock Clash EX.</div><div>Note: Even if you complete Sabnock Clash EX, you will not be able to challenge the Nightmare battle until enough time has passed.</div><div>Nightmare difficulty requires the same amount of otherworld fragments and getherwings as Expert difficulty, and the drop rewards are also the same.</div><div>Once per day when you clear Nightmare difficulty, you can get a Grand Bounty.</div><div>Note: The Grand Bounty you receive is randomly selected from a set of amazing rewards.</div><div><br></div><div>・Refreshed emblem rewards</div><div>The bronze emblem and silver emblem rewards contain many items for upgrading light-attuned adventurers, such as Elias, an adventurer who appears in the event.</div><div>Use emblems acquired in the Beginner and Standard raid difficulties to upgrade your light-attuned adventurers!</div><div>Also, insignias and tablets, which can be acquired as rewards for The Imperial Onslaught, have been added to the rewards for gold emblems.</div><div><br></div><div>■Event Duration</div><div><span class="local_date" data-local_date="1557813600"></span> &nbsp;to &nbsp;<span class="local_date" data-local_date="1558677599"></span></div><div>・If the event ends while you are in a quest, the quest will continue until the results have been determined. You will be able to earn rewards according to the results of the quest.</div><div><br></div><div>■Reward Availability Period</div><div><span class="local_date" data-local_date="1557813600"></span> &nbsp;to &nbsp;<span class="local_date" data-local_date="1559282399"></span></div><div>・You will be able to perform blazon summons and obtain emblem rewards during this period.</div><div><br></div><div>■Temporary Adventurers</div><div>When you complete quests, you will increase the friendship with any temporary adventurers in your team. If you maximize your friendship with a temporary adventurer, they will permanently remain in your collection, allowing you to include them in your team after the event ends. Their level, stats, equipment, and position in your team and collection will be maintained.</div><div><br></div><div>Note: Even if an event adventurer isn&#39;t permanently added to your collection, any items used to upgrade their level, unlock their mana circles, and promote them will not be returned.</div><div><br></div><div>■If Elias Previously Joined as a Temporary Adventurer</div><div>You can include Elias in your team again when this event starts, and he will maintain the same level and stats as when this event was held previously.</div><div><br></div><div>■Raid Battles</div><div>Raid battles are co-op battles where up to four teams (16 adventurers) can cooperate against a raid boss together! There are four difficulty levels available: Beginner, Standard, Expert, and Nightmare.</div><div>To participate in a raid battle, you must either create a room as the host or join a room as a guest.</div><div><br></div><div>・As a Host:</div><div>Creating a room requires otherworld fragments and getherwings.</div><div>You can obtain otherworld fragments from boss battles.</div><div><br></div><div>・As a Guest:</div><div>Joining a room requires otherworld fragments and getherwings.</div><div>You must have unlocked the respective difficulty to participate in a raid battle.</div><div><br></div><div>■Extra Raid Battles</div><div>There is a chance that an Extra Raid Battle will appear for players who clear raid battles on Expert or Nightmare.</div><div>The quest will disappear again upon completion.</div><div>The quest will reappear when the conditions are met again.</div><div><br></div><div>・As a Host:</div><div>No getherwings or otherworld fragments are required.</div><div><br></div><div>・As a Guest:</div><div>No getherwings or otherworld fragments are required.</div><div><br></div><div>You can only participate in the Extra Raid Battle when it has appeared for you. It will disappear upon completion, regardless of whether you cleared it as a host or as a guest.</div><div><br></div><div>■Blazon Summons</div><div>Complete boss battles and raid battles to obtain peregrine blazons. Blazons collected can be used for blazon summoning to get event-specific 5★ dragons, 4★ wyrmprints, and other rewards.</div><div>After obtaining the dragon Maritimus through summoning, you can reset the contents available.</div><div>From the 5th reset onwards, you must accept all rewards before you can reset the contents available.</div><div><br></div><div>■Emblems</div><div>You can obtain rewards, such as items and event-specific wyrmprints, based on the total number of emblems you gather during the event.</div><div><br></div><div>■Event Endeavors</div><div>Two types of event endeavors will be available during the event: Daily and Limited.</div><div><br></div><div>Notes:</div><div>1. During raid battles, you will only recover 1/4 of the amount of HP from certain skills and abilities.</div><div>2. Players must have completed up to Chapter 2 / 2-1 (Normal) of the main campaign to participate in event quests.</div><div>3. Players must have completed up to Chapter 2 / 2-1 (Normal) of the main campaign in order to play co-op.</div><div>4. If you do not maximize your friendship with temporary adventurers during the event, they will not join you after the event ends, regardless of their level or stats.</div><div>5. If a temporary adventurer joins you after the event ends, you will be able to read their Adventurer Story.</div><div>6. You will not be able to use blazons, emblems, or otherworld fragments obtained in this event in future events.</div><div>7. For details concerning this raid event, check the Help section on the raid event&rsquo;s top page in the game.</div><div><br></div><div>Thank you for playing Dragalia Lost.</div>,start_time:1557813600,update_time1557726055