article_id:470,category_name:Events,title_name:New Void Enemies and Void Battle Limited-Time Endeavors!,image_path:,message:<div>New Void enemies will be added to Void Battles (event quests where you can battle powerful boss enemies) at <span class="local_date" data-local_date="1558332000"></span>!</div><div><br></div><div>You can craft new weapons using the materials obtained by defeating the newly added Void enemies. Additionally, a new drop reward will be added to Void Zephyr Strike and Void Agni Strike.</div><div><br></div><div>Furthermore, Limited Void Battle Endeavors will be available between <span class="local_date" data-local_date="1558332000"></span> and <span class="local_date" data-local_date="1559282399"></span>!</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/49e8f1d4f52740f07153215a2fdde956.png"></div><div>One day, the Prince and his companions received a call for help from a neighboring city in peril. Black mana-transformed dragons, among other terrors, are wreaking havoc!</div><div><br></div><div>■New Void Enemies</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/a532cc02e24390f9c70a27340f88f105.png"></div><div>Gust Shroom (Wind), Required Might: 9,000</div><div>Take care to avoid its sleep affliction and eliminate the Gust Shrooms spawned with its Disperse ability!</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/4b82c06cc02f60aeb7d6c338e9865215.png"></div><div>Violet Ghost (Shadow), Required Might: 9,000</div><div>A challenging foe protected by Ranged Resistance! Evade its curse affliction and take it down with close-quarters weapons!</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/f7132e5e31172a51f7a079ad4cc88e1c.png"></div><div>Amber Golem (Light), Required Might: 10,000</div><div>Watch out for its dull ability (which greatly decreases strength), and the paralysis affliction!</div><div><br></div><div>■Crafting</div><div>Craftable weapons will be added.</div><div>・The Leechspore Lance and other weapons crafted using materials obtained from the Gust Shroom can be enhanced into light-attuned weapons with the Copy Punisher ability.</div><div>・The Rest Eternal and other weapons crafted using materials obtained from the Violet Ghost can be enhanced into flame-attuned weapons with the Full HP = Strength +8% ability.</div><div>・The Hefty Ingot and other weapons crafted using materials obtained from the Amber Golem can be enhanced into wind-attuned weapons with the Fury Penetrator ability.</div><div>・The Impact Thrust and other weapons crafted using materials obtained from Void Zephyr can be enhanced into wind-attuned weapons with the Broken Punisher +15% ability.</div><div>・The Hellish Sting and other weapons crafted using materials obtained from Void Agni can be enhanced into flame-attuned weapons with the HP 70% = Critical Rate +5% ability.</div><div><br></div><div>■New Drop Rewards</div><div>Squishums will be added as drop rewards for Void Zephyr Strike and Void Agni Strike.</div><div><br></div><div>■Void Battles Schedule</div><div>You can play Void Battles anytime, regardless of the day of the week. However, the Void enemies that appear will differ based on the day. Check out the Void Battles Schedule notification for information about when each Void enemy is scheduled to appear.</div><div><a href="https://dragalialost.com/en-gb/news/detail/19999">【Void Battles Schedule】</a></div><div><br></div><div>Limited-Time Endeavors</div><div>To celebrate the addition of the new Void enemies, we&#39;re adding Limited Void Battle Endeavors! These are separated into Daily and Limited variations. You can complete the endeavors to obtain various rewards.</div><div><br></div><div>While the Limited Void Battle Endeavors are active, a wide variety of Void enemies will appear each day!</div><div><br></div><div>■Limited Void Battle Endeavors Duration</div><div><span class="local_date" data-local_date="1558332000"></span> to <span class="local_date" data-local_date="1559282399"></span></div><div><br></div><div>Notes:</div><div>1. For more information about Void Battles, tap Events on the main page, then go to the Void Battles page and select Help.</div><div>2. For more information about Void enemies, tap Events on the main page, then go to the Void Battles page and check Details on the various quest pages.</div><div>3. You can check the Endeavors added for a limited time by tapping Endeavors on the main page, then selecting the Daily or Limited tabs.</div><div>4. Players must have completed up to Chapter 7 / 5-6 (Normal) of the main campaign in order to participate in Void Battles.</div><div><br></div><div>Thank you for playing Dragalia Lost.</div>,start_time:1558332000,update_time1558336038