article_id:762,category_name:Events,title_name:A New Raid Event, Fractured Futures, Is Now Live![Update],image_path:https://dragalialost.akamaized.net/attached/information/images/aa990ad667c1f92fd1fa04ad577f419f.png,message:<div><span style="color: rgb(44, 130, 201);"><strong>[Addendum <span class="local_date" data-local_date="1570176000"></span>]<br></strong></span>The following is information regarding the behavior of AI adventurers in quests that are part of the Fractured Futures event, which is now live.<br><br>When AI adventurers attack, they aim for target markers (the circular markers that display under enemies).<br>When part of an enemy with a target marker is destroyed, the AI adventurers will sometimes stop attacking until another target marker appears.<br>If the AI stops attacking, they will begin attacking again when you approach the enemy&#39;s body, or another part of it, and cause a new target marker to appear.<br><br>We hope you take advantage of AI adventurers&#39; attacks as you challenge Fractured Futures quests.<br><br></div><hr><div>Up to four players with four adventurers each (up to 16 adventurers in total!) can battle together in the Fractured Futures raid event, which began <span class="local_date" data-local_date="1569823200"></span>. Take on event-specific quests to defeat the light-attuned raid boss and earn rewards!</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/aa990ad667c1f92fd1fa04ad577f419f.png"></div><div>On one fateful day, a loved one was lost, and a possible future was stolen forever... While lamenting over memories of days gone by, the prince is approached by a dragon named Chronos. The dragon offers to use his powers to alter time, giving the prince a chance to set things right&mdash;no matter the consequences!</div><div><br></div><div>A new adventurer, Audric, will join you during this event. Increase your friendship with him to officially add him to your roster. You can also collect blazons and emblems to get the dragon Parallel Zodiark and the The Bewitching Magician wyrmprint.</div><div><br></div><div>Find the Fractured Futures raid event details below.</div><div><br></div><div>■Event Duration</div><div><span class="local_date" data-local_date="1569823200"></span> to <span class="local_date" data-local_date="1570773599"></span></div><div>・If the event ends while you are in a quest, the quest will continue until the results have been determined. You will be able to earn rewards according to the results of the quest.</div><div><br></div><div>■Reward Availability Period</div><div><span class="local_date" data-local_date="1569823200"></span> to <span class="local_date" data-local_date="1571378399"></span></div><div>・You will be able to perform blazon summons and obtain emblem rewards during this period.</div><div><br></div><div>■Additions</div><div>●Trading for weapons</div><div>As a reward for the first time you clear the extra battle, you&#39;ll get a quantum cog, which can be traded just once for one of 40 elementally-attuned 5★ core weapons under 5★ Weapon Exchange on the event&#39;s main page.</div><div>Note: You will not be able to use the quantum cog obtained in this event in future events.</div><div><br></div><div>Weapon exchange duration:</div><div><span class="local_date" data-local_date="1569823200"></span> to <span class="local_date" data-local_date="1571378399"></span></div><div><br></div><div>●Raid boosts</div><div>When you clear boss battles and raid battles, you&#39;ll be able to get raid boosts, which power up adventurers for this event only.</div><div><br></div><div>Raid boosts you obtain will stack, and only apply to your team. The maximum effects you can achieve with raid boosts are described below.</div><div>・Damage +100%</div><div>・HP +50%</div><div>・Shapeshift Prep +25%</div><div>・Dragon Time +50%</div><div><br></div><div>The number of raid boosts you can obtain by clearing a single quest varies depending on the difficulty.</div><div>There are also special rare raid boosts.</div><div><br></div><div>Raid battle co-op rooms will now display each team&#39;s boosted might, which factors in the increased power from raid boosts.</div><div>Note: Boosted might does not affect the might required to start a quest.</div><div><br></div><div>●New Omega difficulty</div><div>We are adding a new Omega difficulty, where you can grapple with foes even more powerful than those in Nightmare difficulty.</div><div>The first time you clear Omega difficulty, you&#39;ll be able to obtain amazing rewards.</div><div><br></div><div>To challenge Omega difficulty, you must clear the raid battle on Nightmare difficulty. Additionally, to unlock Omega difficulty, you must collect three omega keys. You can obtain one omega key from each type of emblem rewards: bronze emblems, silver emblems, and gold emblems.</div><div><br></div><div>・Omega (Solo)</div><div>This quest is for solo play only.</div><div>It will unlock when you clear the raid battle on Nightmare difficulty.</div><div><br></div><div>・Omega (Raid)</div><div>This quest is for co-op play only.</div><div>It will unlock when you clear the omega battle in solo play.</div><div><br></div><div>The raid version of the Omega battle is only unlocked at certain times and will not be available at other times, even if you have met the conditions to unlock it.</div><div><br></div><div>Omega (raid) availability:</div><div>・<span class="local_date" data-local_date="1570255200"></span> to <span class="local_date" data-local_date="1570427999"></span></div><div>・<span class="local_date" data-local_date="1570600800"></span> to <span class="local_date" data-local_date="1570773599"></span></div><div><br></div><div>●New otherworld gem for challenging extra raid battles</div><div>You will be able to spend the otherworld gem event item to challenge extra raid battles at any time.</div><div>You can obtain otherworld gems from the Expert and Nightmare difficulty raid battles.</div><div><br></div><div>Just like otherworld fragments and other event items, otherworld gems can only be used in this event.</div><div><br></div><div>Note: To unlock the extra raid battle, you must clear the raid battle on Expert difficulty. Along with the addition of otherworld gems, the extra raid battle no longer randomly appear when you clear the raid battle on Expert or Nightmare difficulty.</div><div><br></div><div>●Emblems added to the grand bounty for Nightmare difficulty</div><div>The following emblems have been added to the grand bounty, which can be obtained from the Nightmare raid battle.</div><div>・Bronze emblems</div><div>・Silver emblems</div><div><br></div><div>■Temporary Adventurers<br>When you complete quests, you will increase the friendship with any temporary adventurers in your team. If you maximize your friendship with a temporary adventurer, they will permanently remain in your collection, allowing you to include them in your team after the event ends. Their level, stats, equipment, and position in your team and collection will be maintained.<br><br>Note: Even if an event adventurer isn&#39;t permanently added to your collection, any items used to upgrade their level, unlock their mana circles, and promote them will not be returned.<br><br>■Raid Battles<br>Raid battles are co-op battles where up to four teams (16 adventurers) can cooperate against a raid boss together! There are six difficulty levels available: Beginner, Standard, Expert, Nightmare, Extra, and Omega (Raid).<br>To challenge Beginner, Standard, Expert, and Nightmare difficulties, you must spend otherworld fragments and getherwings.<br>Otherworld fragments can be obtained from boss battles.<br>To challenge the Extra raid battle, you must spend otherworld gems.<br>To challenge Omega (Raid), you must spend getherwings.<br>Note: To join co-op as a guest, you must also have the difficulty unlocked.<br><br>・Nightmare Difficulty<br>To play this difficulty, you will also need to complete the extra raid battle.<br>Nightmare difficulty requires the same amount of otherworld fragments and getherwings as Expert difficulty, and the drop rewards are also the same.<br>Once per day when you clear Nightmare difficulty, you can get a Grand Bounty.<br>Note: The Grand Bounty you receive is randomly selected from a set of rewards.<br><br>■First Anniversary Wyrmprints<br>To commemorate the first anniversary, you can get the United by One Vision wyrmprint as a reward the first time you clear the following Fractured Futures quests.<br>・Boss Battle (Expert): First Clear Reward<br>・Raid Battle (Beginner): First Clear Reward<br>・Raid Battle (Standard): First Clear Reward<br>・Raid Battle (Expert): First Clear Reward<br>・Extra Raid Battle: First Clear Reward<br><br>■Blazon Summons<br>Complete boss battles and raid battles to obtain peregrine blazons. Blazons collected can be used for blazon summoning to get event-specific 5★ dragons, 4★ wyrmprints, and other rewards.<br>After obtaining the dragon Parallel Zodiark through summoning, you can reset the contents available.<br>From the 5th reset onward, you must accept all rewards before you can reset the contents available.<br><br>■Emblems<br>You can obtain rewards, such as items and event-specific wyrmprints, based on the total number of emblems you gather during the event.<br>Many items used to upgrade your shadow-attuned adventurers, including the event adventurer Audric, can be obtained via bronze and silver emblems. Augment items and rewards typically acquired from The Imperial Onslaught, such as insignias and tablets, can be obtained via gold emblems.<br><br>■Event Endeavors<br>Two types of event endeavors will be available during the event: Daily and Limited.<br><br>■Bonus Endeavor<br>If you fulfill certain conditions, you can unlock a new daily endeavor that tasks you with clearing all daily event endeavors. If you clear all of an event&#39;s daily endeavors, you&#39;ll receive an endeavor bonus reward!<br><br>■Epilogue<br>The epilogue for the Fractured Futures event will unlock <span class="local_date" data-local_date="1570773600"></span>.<br>Note: To view the epilogue, you must complete chapter 5 of the event story.<br><br>■Epilogue Availability<br><span class="local_date" data-local_date="1570773600"></span> to <span class="local_date" data-local_date="1571378399"></span><br><br>■Other<br>We have confirmed an issue with the Fractured Futures event where the game sometimes runs slowly on certain devices.<br>See the following notification for more information.<br><a href="https://dragalialost.com/en/news/detail/764">Regarding Slowdowns for Certain Devices in the Fractured Futures Raid Event<br></a><br>Notes:<br>1. During raid battles, you will only recover 1/4 of the amount of HP from certain skills and abilities.<br>2. Players must have completed up to Chapter 2 / 2-1 (Normal) of the main campaign to participate in event quests.<br>3. Players must have completed up to Chapter 2 / 2-1 (Normal) of the main campaign in order to play co-op.<br>4. If you do not maximize your friendship with temporary adventurers during the event, they will not join you after the event ends, regardless of their level or stats.<br>5. If a temporary adventurer permanently joins your roster, you will be able to read their Adventurer Story.<br>6. You will not be able to use blazons, emblems, otherworld fragments, otherworld gems, omega keys, or quantum cogs obtained in this event in future events.<br>7. For details concerning this raid event, check the Help section on the raid event&rsquo;s top page in the game.<br><br>Thank you for playing Dragalia Lost.</div><div><br></div><div><br></div>,start_time:1569823200,update_time1570175883