article_id:879,category_name:Events,title_name:New Void Enemy and Void Battle Limited-Time Endeavors!,image_path:https://dragalialost.akamaized.net/attached/information/images/0a4b476fc07e45b875708a911326d022.png,message:<div><span style="color: rgb(44, 130, 201);"><strong>[Update <span class="local_date" data-local_date="1574923800"></span>]</strong></span><br>We fixed an an error in the image for the smoldering manticore, which is now live in Void Battles.<br>The fixed areas are described below.<br><br>■In Notifications<br>・The image in the New Void Enemies and Void Battle Limited-Time Endeavors! notification<br>・The image in the Void Battles Schedule notification<br><br>■In Game<br>・The quest banner image for Smoldering Manticore Strike on the Void Battles main screen<br>・The header image for the Smoldering Manticore Strike page<br>・The header image for the details screen on the Smoldering Manticore Strike page<br><br>Thank you for playing Dragalia Lost.<br><br></div><hr><div>New Void enemies will be added to Void Battles (event quests where you can battle powerful boss enemies) at <span class="local_date" data-local_date="1574316000"></span>.</div><div><br></div><div>You can craft new weapons using the materials obtained by defeating the newly added Void enemies.</div><div><br></div><div>Furthermore, Limited Void Battle Endeavors will be available between <span class="local_date" data-local_date="1574316000"></span> and <span class="local_date" data-local_date="1575007199"></span>.</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/0a4b476fc07e45b875708a911326d022.png"></div><div>A call for help came from a neighboring city, reporting attacks by ferocious fiends and dragons that had been transformed by black mana! Now it&#39;s up to the Prince and his companions to save the city in peril!</div><div><br></div><div>■New Void Enemies</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/bd9d40d8700296eda739af68814b1fde.png"></div><div>Eolian Phantom (Wind), Required Might: 12,000</div><div>This powerful foe&#39;s Soul Eater ability restores HP based on the damage dealt to adventurers! You&#39;ll also need to watch out for the enemies summoned with Spectral Shield!</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/538fe9a163516af1c1e695fbf58267b3.png"></div><div>Smoldering Manticore (Flame), Required Might: 12,000</div><div>The Fury ability prevents the Overdrive gauge from dropping and greatly increases the smoldering manticore&#39;s strength and defense while in the Overdrive state!</div><div><br></div><div>■Crafting</div><div>Craftable Void weapons will be added.</div><div>・Weapons that can be crafted using materials obtained from Eolian Phantoms and the Smoldering Manticore have been added.</div><div>・Swords, blades, bows, and staffs have been added to the weapon types that can be crafted using materials obtained from the Raging Manticore and Greedy Manticore.</div><div>・Dimension Edge and other weapons crafted using materials obtained from the Catoblepas Anemos can be enhanced into flame-attuned weapons.</div><div><br></div><div>■Void Battles Schedule</div><div>You can play Void Battles anytime, regardless of the day of the week. However, the Void enemies that appear will differ based on the day. Check out the Void Battles Schedule notification for information about when each Void enemy is scheduled to appear.</div><div><a href="https://dragalialost.com/en-gb/news/detail/19999">Void Battles Schedule</a></div><div><br></div><div>■Limited-Time Endeavors</div><div>We&#39;re adding Limited-Time Void Battle Endeavors, separated into Daily and Limited variations.</div><div>You can complete the endeavors to obtain various rewards.</div><div><br></div><div>■Limited Void Battle Endeavors Duration</div><div><span class="local_date" data-local_date="1574316000"></span> to <span class="local_date" data-local_date="1575007199"></span></div><div><br></div><div>Void Battles Double Drops Event:</div><div>The drop rewards obtained from Void Battles will be doubled for the duration of the event.</div><div>Check the Void Battles Schedule notification for information about eligible quests.</div><div>Note: The eligible quests will rotate daily. When you tap the Special! button on the home page, the time remaining for the event will display as the time until 9:59 PM PT the next day. This event does not apply to weapons, wyrmprints, or astral pieces.</div><div><br></div><div>■Void Battles Double Drops Event Duration</div><div><span class="local_date" data-local_date="1574316000"></span> to <span class="local_date" data-local_date="1575007199"></span></div><div><br></div><div>■Other</div><div>The abilities for the following weapons were adjusted in a data update performed around <span class="local_date" data-local_date="1574314200"></span>.</div><div>・The ability for weapons crafted using materials obtained from the Wandering Shroom has been changed to Dragon Delay &amp; Soul Eater Res.</div><div>・The ability for weapons crafted using materials obtained from the Frost Hermit has been changed to Skill Resistance &amp; Fury Penetrator.</div><div><br></div><div>Notes:</div><div>1. For more information about Void Battles, tap Events on the main page, then go to the Void Battles page and select Help.</div><div>2. For more information about Void enemies, tap Events on the main page, then go to the Void Battles page and check Details on the various quest pages.</div><div>3. You can check the Endeavors added for a limited time by tapping Endeavors on the main page, then selecting the Daily or Limited tabs.</div><div>4. Players must have completed up to Chapter 7 / 5-6 (Normal) of the main campaign in order to participate in Void Battles.</div><div>Thank you for playing Dragalia Lost.</div><div><br></div>,start_time:1574316000,update_time1574923866