article_id:1044,category_name:Events,title_name:A New Event, MONSTER HUNTER PRIMAL CRISIS, Is Now Live!,image_path:https://dragalialost.akamaized.net/attached/information/images/4719331d2c2254477c30658b568e5ef2.png,message:<div>The MONSTER HUNTER PRIMAL CRISIS event went live at <span class="local_date" data-local_date="1580277600"></span>!</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/4719331d2c2254477c30658b568e5ef2.png"></div><div>Hunting season opens in the Dragalia Lost game as monsters from another world begin to appear!</div><div>Alongside new allies from the Soaratorium, the Prince must stand against the impending threat and fight as a team when confronted by Rathalos, King of the Skies.</div><div>The time has come for the prince and friends to test their hunting instincts!</div><div><br></div><div>■Event Overview</div><div>In the the MONSTER HUNTER PRIMAL CRISIS event, you can collect otherworld fragments from the boss battle and use them to challenge the raid boss to get rewards.</div><div>You can get the 5★ dragon Rathalos and event-exclusive wyrmprints by performing blazon summons on the event page, and get event-exclusive weapons from the Treasure Trade. What&#39;s more, there will also be a stamina recovery item you can only get for the duration of the event: well-done steak!</div><div>Note: You will be able to use well-done steaks even after the event has ended.</div><div><br></div><div>See below for details on the MONSTER HUNTER PRIMAL CRISIS event.</div><div><br></div><div>■Event Duration</div><div><span class="local_date" data-local_date="1580277600"></span> to <span class="local_date" data-local_date="1581919199"></span></div><div><br></div><div>■Event Update</div><div>The event will be updated at <span class="local_date" data-local_date="1580796000"></span> to add quests and rewards.</div><div><br></div><div>■Reward Availability Period</div><div><span class="local_date" data-local_date="1580277600"></span> to <span class="local_date" data-local_date="1582523999"></span></div><div><br></div><div>■Epilogue</div><div>The epilogue for the MONSTER HUNTER PRIMAL CRISIS event will unlock at <span class="local_date" data-local_date="1581919200"></span>.</div><div>Note: To view the epilogue, you must complete chapter 10 of the event story.</div><div><br></div><div>■Epilogue Availability</div><div><span class="local_date" data-local_date="1581919200"></span> to <span class="local_date" data-local_date="1582523999"></span></div><div><br></div><div>■Additions</div><div>●Fixed-stats quests</div><div>Certain quests in the MONSTER HUNTER PRIMAL CRISIS event are fixed-stats quests.</div><div>In these quests, changing your adventurer&#39;s level, weapon, dragon, and other equipment will not affect their HP and strength.</div><div>You will also be unable to use weapon skills.</div><div><br></div><div>●Boss Battle with parts</div><div>In the MONSTER HUNTER PRIMAL CRISIS event&#39;s Boss Battle, the boss enemy will have separate parts that can be attacked.</div><div>Attacking the parts and demolishing them will fill your dragon gauge.</div><div>Note: You cannot target the parts of the boss in the Boss Battle by tapping on them.</div><div><br></div><div>●Weapons with event bonus abilities</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/eb37be7f52acf56fdf2f0edb9689a186.png"></div><div>The weapons you can get in the MONSTER HUNTER PRIMAL CRISIS event have abilities that increase damage against enemies that appear in quests for this event.</div><div>Get weapons from the Treasure Trade and use them to challenge quests!</div><div><br></div><div>●Special action elements in the Raid Battle</div><div>The raid battle in the MONSTER HUNTER PRIMAL CRISIS event contains special action elements.</div><div><br></div><div>・Demon Horn</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/aaa1684cae6c31b075e6c6a2f587e489.png"></div><div>During the Raid Battle, Notte will blow the Demon Horn and a strength increase buff will be applied to your team.</div><div>There is also a rare raid boost that upgrades the Demon Horn by boosting the strength increase effect.</div><div><br></div><div>・Mega barrel bombs</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/a899b82294154b4fd2e3524c2c614e44.png"></div><div>You can place mega barrel bombs three times during the raid battle.</div><div>Certain attacks from enemies and adventurers under your control can blow up mega barrel bombs, dealing large amounts of damage to enemies.</div><div>Allied adventurers will not be damaged, even if hit by the explosion.</div><div><br></div><div>・Stagger gauge</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/65153c1f0f543a42fcc37948c5342adf.png"></div><div>When you demolish parts on the raid boss, the gauge for the demolished part will become a yellow stagger gauge.</div><div>The gauge will decrease as damage is dealt to the part, and if the gauge is depleted, the raid boss will stagger, creating an opportunity to strike.</div><div><br></div><div>●Trials</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/c4c2c932a019716ad29f98b91528fcb0.png"></div><div>The MONSTER HUNTER PRIMAL CRISIS event will feature Trials, high-difficulty quests that pit you against powerful foes.</div><div>Some Trials quests will have you facing off against two boss enemies at the same time, and defeating one of them will power up the remaining one.</div><div>Trials come in both solo and co-op variations, with co-op unlocking for each quest once you clear it on solo.</div><div><br></div><div>The co-op versions of the quests are only available at certain times, and you will not be able to challenge the quests unless they are available, even if you have met the requirements for co-op.</div><div>See the Schedule section on the event&#39;s main page for information on when co-op will be available.</div><div><br></div><div>Notes:</div><div>1. You can see more details about this event by tapping Help on the event page.</div><div>2. Players must have completed up to Chapter 2 / 2-1 (Normal) of the main campaign to participate in event quests.</div><div>3. Players must have completed up to Chapter 2 / 2-1 (Normal) of the main campaign in order to play co-op.</div><div>4. If the event ends while you are playing an event quest, the quest will continue until results have been determined and you will be able to gain the rewards shown.</div><div>5. You will not be able to use blazons, emblems, otherworld gems, or otherworld fragments obtained in this event in future events.</div><div><br></div><div>Thank you for playing Dragalia Lost.</div>,start_time:1580277600,update_time1580109592