article_id:1114,category_name:News,title_name:Regarding Issues in Update 1.17.0[Update],image_path:,message:<div><span style="color: rgb(41, 105, 176);"><strong>[Addendum <span class="local_date" data-local_date="1582714800"></span>]</strong></span><br>As a token of our gratitude for your patience, we have sent a tenfold summon voucher to all players who started playing before <span class="local_date" data-local_date="1582714800"></span>.<br>This gift can be claimed from your goodie box for up to 7 days after reception.<br>Note: We originally planned to give out this tenfold summon voucher following the automatic update that was supposed to occur at <span class="local_date" data-local_date="1582869600"></span>, but since this automatic update has been moved up to <span class="local_date" data-local_date="1582714800"></span> we will distribute this gift ahead of schedule. Please note that there will be no tenfold summon voucher distributed at <span class="local_date" data-local_date="1582869600"></span>.<br><br>Thank you for playing Dragalia Lost.</div><div><br></div><hr><div>We have confirmed several issues that occur in co-op games following the update to version 1.17.0:</div><div><br></div><div>・When playing Volk&#39;s Wrath: Expert in co-op, the dragon gauge keeps increasing and never decreases.</div><div>・Bosses&#39; HP don&#39;t display correctly in co-op.</div><div>・Team members&#39; HP don&#39;t display correctly in co-op.</div><div>・The effects of bleeding, HP regen, and skill charge are not applied correctly.</div><div><br></div><div>We believe these issues are occurring when players who have updated to version 1.17.0 play in co-op with players who haven&#39;t updated yet.</div><div><br></div><div>In order to solve these issues, we will apply the automatic update at <span class="local_date" data-local_date="1582714800"></span> instead of <span class="local_date" data-local_date="1582869600"></span> as initially planned.</div><div><br></div><div>Thank you for playing Dragalia Lost.</div>,start_time:1582712700,update_time1582714792