article_id:1209,category_name:News,title_name:This Month in Dragalia Lost,image_path:,message:<div>Hello there! Yuji Okada here, director of Dragalia Lost.</div><div><br></div><div>Thank you so much for playing Dragalia Lost!</div><div>Thanks to all of your support, the game has reached its 1.5-year anniversary! There are a lot of events to celebrate the occasion, so be sure to check them out. I talked a little bit about what&#39;s coming during the recent Dragalia Digest, but I&#39;d like to unpack that information a little more in this notification.</div><div><br></div><div>■Plans for This Month</div><div>・Are you enjoying the Scars of the Syndicate raid event?</div><div>The song that plays during the battle against the new raid boss, Aspidochelone, is &quot;Get up&quot; by MADKID. It also plays when things get heated during the story, so I hope you give it a listen.</div><div><br></div><div>・Aldred and Bellina</div><div>These two adventurers can&#39;t shapeshift, but they can enter a special state called dragondrive instead! While in dragondrive, certain parameters and skills will be boosted. Also, unlike shapeshifting, you can end dragondrive whenever you like without using up the special gauge entirely. I think you&#39;ll enjoy how the gameplay feels a little different without shapeshifting!</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/069e4b2dd8931f5472563e87cd3adb9b.png"></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/6b0ba58faa0e04254bdcc7f85f50998e.png"></div><div><br></div><div>・Grace, a shadow-attuned staff adventurer, will be added in the near future</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/4c8220690cb87cf0a887f8b42b002a8b.png"></div><div><br></div><div>Grace is a unique adventurer in that she&#39;s a healer who lacks recovery skills, but she&#39;s extremely powerful when partnered with adventurers like Natalie whose parameters are increased when their HP is lower!</div><div><br></div><div>・We&#39;ll revive The Hunt for Harmony facility event in mid-April.</div><div><br></div><div>・We&#39;ll also revive the Fire Emblem: Lost Heroes event starting April 19.</div><div>A summon showcase featuring Marth, Fjorm, and Veronica will also be available at the same time as the revival, of course.</div><div><br></div><div>・A chimera boss enemy of a new element, and new chimera weapons, will be added during the Fire Emblem: Lost Heroes event revival.</div><div><br></div><div>・A brand new Fire Emblem Heroes event will start at the end of April.</div><div><br></div><div>■Fire Emblem Heroes Events<br>As announced during the Dragalia Digest, we&#39;ll be reviving the Fire Emblem: Lost Heroes event starting April 19. Along with the event revival, we&#39;ll also be unlocking the mana spiral for Alfonse, Marth, Fjorm, and Veronica!<br>The event has been changed slightly for the revival, so you&#39;ll have the chance to view the full story before the start of the new event.<br>The defensive battles have also been adjusted to be playable in solo play. What&#39;s more, the new Fire Emblem Heroes event will feature new adventurers, story, and gameplay elements! You can also add Sharena, a new adventurer, to your roster by playing. This event is scheduled to start at the end of April, so keep an eye out for it!<br><br><img src="https://dragalialost.akamaized.net/attached/information/images/15fb73b6ff662dff70f3751c59e4c599.png"></div><div><br></div><div>■Chain Co-abilities<br>We added a new feature called chain co-abilities in a recent update. The reason we introduced this feature is because we wanted to increase the amount of strategy that goes into your team building. The number of adventurers that can be obtained by playing through the main campaign, events, and summon showcases has grown since the release of the game, and we want to make it more worthwhile to upgrade and use all of those adventurers.<br>Chain co-abilities are upgraded along with co-abilities, so while upgrading adventurers may be difficult, these parameters boost adventurers plenty, even at level one. I hope you&#39;ll try lots of different combinations!<br>Because of the introduction of chain co-abilities we&#39;d also like to increase the number of teams you can build in a future update, so please wait a little longer while we work on this.<br><br>■Future Updates<br>・A new feature for skills<br>We&#39;re planning on adding a new feature that allows adventurers to use the skills of other adventurers, as long as that adventurer meets certain conditions. This will make it possible to combine skills in brand-new ways, so we expect that it will create quite a bit of variance in quest strategy and how adventurers are used. We&#39;ll be sure to share more information about the feature in a future update notification.<br><br>・Events<br>We&#39;re also preparing new events in addition to raid events and facility events. In the first event format, you&#39;ll have to take on large amounts of enemies. The other format will center on defensive battles like in the Fire Emblem: Lost Heroes event. In this event, you&#39;ll be able to play battles with vast maps, reinforcements, and ever-changing battle situations.<br>We&#39;ll hold one of the two event types each month, and each will have a new story!<br><br>・The Agito Uprising<br>We&#39;re planning on adding a new boss to The Agito Uprising at the end of April. One of the two bosses shown during the Dragalia Digest will make their debut.<br><br><img src="https://dragalialost.akamaized.net/attached/information/images/8142c3fbe8f69f6be2343dfb88dd0364.png"></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/935c659f77c4ac3ee388b832e50a0c9a.png"></div><div><br></div><div>・Crafting</div><div>We plan on improving the game screens and functionality of the weapon crafting feature to make them more intuitive. Currently, there are a lot of weapons with different special characteristics, so it is easy to be confused about which ones you should craft. We want to make it easier to tell what effects each weapon has and which weapons you should make in your current situation. But don&#39;t worry, if the improvements we make end up meaning that you spent extra materials or rupies when crafting weapons up to that point, we&#39;ll compensate for those amounts.</div><div><br></div><div>■Game Difficulty<br>With the game having reached its 1.5-year anniversary, I&#39;d like to talk a little bit about the direction for the game going forward.<br><br>Dragalia Lost is an action RPG. Players are required to combine the RPG element of building up adventurers with the action element of moving around during battle to overcome powerful foes. Right now, we feel that there is a significant gap between players in regards to the action elements of the game.<br><br>We want to make it so that a wide variety of people can play the game, from those who like upgrading adventurers and straightforward game play but are not as interested in the action to those who prefer the action and working out ways to take on boss enemies. Of the two, we are currently prioritizing adding and adjusting content to help players who are not as interested in action enjoy the game.<br><br>I think the barrier to entry for Dragalia Lost is a little high for a smartphone game, and that&#39;s making matching during co-op difficult and causing some players to quit playing the game entirely. With the addition of chain co-abilities and the new skill feature, it will be possible to upgrade teams further than ever before and make it possible for players who are less interested in the action elements of the game to potentially clear high-difficulty quests. This is the reason why we&#39;ve kept the difficulty of The Agito Uprising down in terms of the action elements for Standard and Expert difficulties.<br><br>In the This Month in Dragalia Lost notification that was released back in March of this year, I said that The Agito Uprising is easier to tackle than Advanced Dragon Trials because I think that clearing The Agito Uprising on Standard difficulty and crafting a 6★ weapon before challenging Advanced Dragon Trials is one possible option, but it seems my lack of explanation generated some confusion, so I apologize for that. In regard to The Agito Uprising, we&#39;re planning to add difficulty levels in the future. When we do, we will make it possible to craft tier two 6★ weapons. Additionally, in the future we are hoping to add quests that are a little more difficult for those who are seeking a challenge, though you won&#39;t be able to collect any rewards or materials for increasing your might from them.<br><br>I apologize to users who are waiting for quests of a more challenging difficulty level who felt that these quests were lacking. I hope you&#39;re looking forward to these future quests and additions to The Agito Uprising. Due to development circumstances, there are a lot of problems we cannot resolve immediately, but we will continue to make improvements to the game so it better lives up to your expectations.<br><br>■In Conclusion<br>It&#39;s been 1.5 years since the release of the game, and there&#39;s a lot we want to work on as we start moving toward the second anniversary. We&#39;re working on a few other things besides the updates I mentioned, so I&#39;ll be sure to share more with you about that in notifications or a future edition of This Month in Dragalia Lost.<br><br>This month, we&#39;re giving the following items to players.<br><br>・Fafnir Medal x100<br>・Fortifying Crystal x100<br><br>This installment of This Month in Dragalia Lost was posted later than normal because of the puppy that wandered into the Halidom around April 1, but the next installment of This Month in Dragalia Lost will be posted around May 1, 2020 as per usual!<br><br>Thanks for reading, and for continuing to play Dragalia Lost!<br><br>Yuji Okada<br>Director, Dragalia Lost</div><div><br></div>,start_time:1585893600,update_time1586164863