article_id:1335,category_name:Events,title_name:New Void Enemies and Void Battle Limited-Time Endeavors!,image_path:https://dragalialost.akamaized.net/attached/information/images/d6346b3fa5047b8953b33306f0e2abce.png,message:<div>New Void enemies will be added to Void Battles (event quests where you can battle powerful boss enemies) at <span class="local_date" data-local_date="1590127200"></span>.</div><div><br></div><div>You can craft new weapons using the materials obtained by defeating the newly added Void enemies.</div><div><br></div><div>Furthermore, Limited Void Battle Endeavors will be available between <span class="local_date" data-local_date="1590127200"></span> and <span class="local_date" data-local_date="1590731999"></span>.</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/d6346b3fa5047b8953b33306f0e2abce.png"></div><div>A call for help came from a neighboring city, reporting attacks by ferocious fiends and dragons that had been transformed by black mana! Now it&#39;s up to the Prince and his companions to save the city in peril!</div><div><br></div><div>■New Void Enemies</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/35e8d0b2b3063a1257d914647ae04113.png"></div><div>Catoblepas Skia (Shadow), Required Might: 11,000</div><div>Adventurers turned to stone by its Petrify ability will be unable to move and will take damage at fixed intervals. You&#39;ll also need to watch out for the poison affliction!</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/c2274db9fc70465a43dcf88fca2212c2.png"></div><div>Abyssal Phantom (Water), Required Might: 12,000</div><div>This powerful foe&#39;s Soul Eater ability restores HP based on the damage dealt to adventurers! You&#39;ll also need to watch out for the enemies summoned with Spectral Shield!</div><div><br></div><div>■Crafting</div><div>Craftable Void weapons will be added.</div><div>・Weapons that can be crafted using materials obtained from the Catoblepas Skia have been added.</div><div>・Weapons that can be crafted using materials obtained from the Abyssal Phantom have been added.</div><div><br></div><div>■Void Battles Schedule</div><div>You can play Void Battles anytime, regardless of the day of the week. However, the Void enemies that appear will differ based on the day. Check out the Void Battles Schedule notification for information about when each Void enemy is scheduled to appear.</div><div><a href="https://dragalialost.com/en/news/detail/19999">Void Battles Schedule</a></div><div><br></div><div>■Limited Void Battle Endeavors</div><div>We&#39;re adding Limited-Time Void Battle Endeavors, separated into Daily and Limited variations. You can complete the endeavors to obtain various rewards.</div><div><br></div><div>■Limited Void Battle Endeavors Duration</div><div><span class="local_date" data-local_date="1590127200"></span> to <span class="local_date" data-local_date="1590731999"></span></div><div><br></div><div>■Other</div><div>・The ability for wind-attuned weapons crafted using materials obtained from the Frost Hermit has been changed to Whirlpool &amp; Soul Eater Res.</div><div><br></div><div>Notes:</div><div>1. For more information about Void Battles, tap Quests on the Home page, then go to the Void Battles page and select Help.</div><div>2. For more information about Void enemies, tap Quests on the Home page, then go to the Void Battles page and check Details on the various quest pages.</div><div>3. You can check the Endeavors added for a limited time by tapping Endeavors on the Home page, then selecting the Daily or Limited tabs.</div><div>4. Players must have completed up to Chapter 7 / 5-6 (Normal) of the main campaign in order to participate in Void Battles.</div><div><br></div><div>Thank you for playing Dragalia Lost.</div><div><br></div>,start_time:1590127200,update_time1589882477