article_id:1479,category_name:Events,title_name:A New Raid Event, Doomsday Getaway, Is Now Live!,image_path:https://dragalialost.akamaized.net/attached/information/images/ac9a45a7d167210c3566329226cbdf16.png,message:<div>Up to four players with four adventurers each (up to 16 adventurers in total!) can battle together in the Doomsday Getaway raid event, which began <span class="local_date" data-local_date="1595916000"></span>. Take on event-specific quests to defeat the water-attuned raid boss and earn rewards!</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/ac9a45a7d167210c3566329226cbdf16.png"></div><div>Having subdued the wicked fiend Scylla, the Prince and friends disembark on calmer waters in search of some well-deserved rest and relaxation. Unfortunately for them, bloodsport wasn&#39;t quite the diversion they had in mind.<br><br>A terrified shriek announces the first death, and the remote island&#39;s twisted game is soon afoot! As the death toll rises higher and higher, and with no way to reach the outside world, our heroes must tread carefully, lest their next move be their last...<br><br>Event theme song: &quot;Stealth Dance&quot; by Shiki Aoki<br><br>An adventurer, Summer Amane, will join you during this event. Increase your friendship with her to add her to your roster permanently. You can also use collected blazons and emblems to get Summer Amane&#39;s convictions and use them to upgrade Summer Amane&#39;s mana circles.<br><br>■Event Duration<br><span class="local_date" data-local_date="1595916000"></span> to <span class="local_date" data-local_date="1597125599"></span><br>・If the event ends while you are in a quest, the quest will continue until the results have been determined. You will be able to earn rewards according to the results of the quest.<br><br>■Reward Availability Period<br><span class="local_date" data-local_date="1595916000"></span> to <span class="local_date" data-local_date="1597730399"></span><br>・You will be able to perform blazon summons and obtain emblem rewards during this period.<br><br>In this raid event, one episode of the story will unlock each day after the event begins according to the below schedule.<br><br>・Boss Battles and Raid Battles may be played immediately after the event begins.<br>・The Prologue and Episode 1 will unlock as soon as the event begins.<br><br>Episode 2: from <span class="local_date" data-local_date="1596002400"></span><br>Episode 3: from <span class="local_date" data-local_date="1596088800"></span><br>Episode 4: from <span class="local_date" data-local_date="1596175200"></span><br>Episode 5: from <span class="local_date" data-local_date="1596261600"></span><br>Episode 6: from <span class="local_date" data-local_date="1596348000"></span><br><br>■Epilogue<br>The epilogue for the Doomsday Getaway event will unlock at <span class="local_date" data-local_date="1597125600"></span>.<br>・To view the epilogue, you must complete episode 6 of the event story.<br><br>■Epilogue Availability<br><span class="local_date" data-local_date="1597125600"></span> to <span class="local_date" data-local_date="1597730399"></span><br><br>■Temporary Adventurers<br>When you complete quests, you will increase the friendship with any temporary adventurers in your team. If you maximize your friendship with a temporary adventurer, they will permanently remain in your collection, allowing you to include them in your team after the event ends. Their level, stats, equipment, and position in your team and collection will be maintained.<br>・Even if an event adventurer isn&#39;t permanently added to your collection, any items used to upgrade their level or unlock their mana circles will not be returned.<br><br>・Event adventurer upgrade item<br>In this event you can earn up to 54 Summer Amane&#39;s convictions, an item used to upgrade the temporary adventurer Summer Amane, from emblem rewards, blazon summoning, and limited-time endeavors.<br><br>You can use event adventurer upgrade items earned in this event on the mana circles of temporary adventurers who join you in this event to unlock nodes or unbind new mana circles.<br><br>Until the epilogue availability period for this event ends, you can only unlock nodes or unbind new mana circles of temporary adventurers who join you in this event by using event adventurer upgrade items earned in this event.<br><br>Once the epilogue availability period for this event has ended, if you do not have any event adventurer upgrade items to unlock mana nodes or unbind new mana circles, then you can use materials and mana instead.<br><br>・Event perk<br>While this event is active, the temporary adventurer will have special abilities that &nbsp;activate in quests for this event. See Event Perks on the main event screen in-game for more information.<br><br>■Raid Battles<br>Raid battles are co-op battles where up to four teams (16 adventurers) can cooperate against a raid boss together! To participate in a raid battle, you must either create a room as the host or join a room as a guest.<br><br>・As a Host:<br>Creating a room requires otherworld fragments and getherwings.<br>You can obtain otherworld fragments from boss battles.<br><br>・As a Guest:<br>Joining a room requires otherworld fragments and getherwings.<br>You must have unlocked the respective difficulty to participate in a raid battle.<br><br>■Extra Raid Battles<br>To challenge the Extra Raid Battle, you must clear the raid battle on Expert.<br><br>・As a Host:<br>Creating a room requires an otherworld gem.<br>You can obtain otherworld gems from the Expert, Nightmare, and Omega difficulty raid battles.<br><br>・As a Guest:<br>Joining a room requires an otherworld gem.<br>You must have cleared the Expert difficulty to participate in a raid battle.<br><br>■Omega Difficulty<br>To challenge Omega difficulty, you must clear the raid battle on Nightmare difficulty. Additionally, to unlock Omega difficulty, you must collect three omega keys. You can obtain one omega key from each type of emblem rewards: bronze emblems, silver emblems, and gold emblems.<br><br>・Omega (Solo)<br>This quest is for solo play only.<br>It will unlock when you clear the raid battle on Nightmare difficulty.<br><br>・Omega Level 1 (Raid)<br>This quest is for co-op play only.<br>It will unlock when you clear the Omega battle in solo play.<br><br>・Omega Level 2 (Raid)<br>This co-op only quest is even more challenging.<br>It will unlock when you clear the Omega Level 1 (Raid).<br><br>The Omega Level 1 (Raid) and Omega Level 2 (Raid) battles are only unlocked at certain times and will not be available at other times, even if you have met the conditions to unlock them.<br><br>Omega Level 1 (Raid) and Omega Level 2 (Raid) availability:<br>・<span class="local_date" data-local_date="1596348000"></span> to <span class="local_date" data-local_date="1596520799"></span><br>・<span class="local_date" data-local_date="1596866400"></span> to <span class="local_date" data-local_date="1597125599"></span><br><br>■Raid Boosts<br>When you clear raid battles, you&#39;ll be able to get raid boosts, which power up adventurers for this event only.<br><br>Raid boosts you obtain will stack, and only apply to your team. The maximum effects you can achieve with raid boosts are described below.<br>・Damage +100%<br>・HP +50%<br>・Shapeshift Prep +25%<br>・Dragon Time +50%<br><br>The number of raid boosts you can obtain by clearing a single quest varies depending on the difficulty.<br>There are also special rare raid boosts.<br>・In this event, you will not be able to obtain rare raid boosts from boss battles.<br><br>Raid battle co-op rooms will display each team&#39;s boosted might, which factors in the increased power from raid boosts.<br>・Boosted might does not affect the might required to start a quest.<br><br>■Blazon Summons<br>Complete boss battles and raid battles to obtain peregrine blazons. Blazons collected can be used for blazon summoning to get Summer Amane&#39;s convictions, event-specific 4★ wyrmprints, and other rewards.<br><br>After obtaining Summer Amane&#39;s convictions through summoning, you can reset the contents available. From the 5th reset onward, you must accept all rewards before you can reset the contents available.<br><br>■Emblems<br>You can obtain rewards, such as Summer Amane&#39;s convictions and event-specific wyrmprints, based on the total number of emblems you gather during the event.<br><br>■Event Endeavors<br>Two types of event endeavors will be available during the event: Daily and Limited.<br><br>Notes:<br>1. During raid battles, you will only recover 1/4 of the amount of HP from certain skills and abilities.<br>2. Players must have completed up to Chapter 2 / 2-1 (Normal) of the main campaign to participate in event quests.<br>3. Players must have completed up to Chapter 2 / 2-1 (Normal) of the main campaign in order to play co-op.<br>4. If you do not maximize your friendship with temporary adventurers during the event, they will not join you after the event ends, regardless of their level or stats.<br>5. If a temporary adventurer permanently joins your roster, you will be able to read their Adventurer Story.<br>6. You will not be able to use blazons, emblems, otherworld gems, or otherworld fragments obtained in this event in future events.<br>7. For details concerning this raid event, check the Help section on the raid event&#39;s top page in the game.<br><br>Thank you for playing Dragalia Lost.</div>,start_time:1595916000,update_time1595916476