article_id:1622,category_name:News,title_name:Regarding Goodwill Gestures for Changes to the Wyrmprint System,image_path:,message:<div>The wyrmprint system underwent major changes in the Version 2.0.0 update implemented around <span class="local_date" data-local_date="1601002800"></span>. This notification serves as a record of the goodwill gestures that have been distributed in tandem with the implementation of these changes.</div><div><br></div><div>For details regarding the new system, please see the following notification:</div><div><br></div><div><a href="https://dragalialost.com/en/news/detail/1605">Regarding Changes to the Wyrmprint System</a></div><div><br></div><div>For details regarding goodwill gestures for in-game Shop offerings, please see the following notification:</div><div><br></div><div><a href="https://dragalialost.com/en/news/detail/1572">[Important] Regarding Goodwill Gesture Items for Purchasable Items Affected By System Changes</a></div><div><br></div><div>■Overview of the Wyrmprint System in Version 2.0.0</div><div>In Version 2.0.0 and beyond, each wyrmprint will typically have one ability (not including wyrmprints with event perks, which may have two).</div><div><br></div><div>With these changes, wyrmprints with the same name may have different abilities after the update than they had before the update. In addition, wyrmprints of the same rarity but different names may have the same abilities.</div><div><br></div><div>■Overview of the Goodwill Gestures for Changes to the Wyrmprint System in Version 2.0.0</div><div>For pre-2.0.0 wyrmprints, affected players have been sent a wyrmprint that has the same ability as the pre-2.0.0 wyrmprint, upgraded based on the number of pre-2.0.0 wyrmprints in the player&#39;s possession and their unbinding and upgrading progress.</div><div><br></div><div>Depending on the pre-2.0.0 wyrmprint, the abilities or rarity of the wyrmprints given as goodwill gestures to affected players may differ from those of the pre-2.0.0 wyrmprint&#39;s. In cases where these differences occur, eldwater will be provided.</div><div>Note: The amount of eldwater provided is based on the wyrmprint&#39;s pre-2.0.0 sale value.</div><div><br></div><div>If the pre-2.0.0 wyrmprint had more EXP gained than the wyrmprint given as a goodwill gesture, the difference has been made up in consecrated water.</div><div><br></div><div>Any HP or strength augments on pre-2.0.0 wyrmprints have been converted into their respective augment items (Fortifying Gemstones or Amplifying Gemstones) and provided to the affected player.</div><div><br></div><div>Further details are provided below.</div><div><br></div><hr><div>■Goodwill gesture procedure</div><div>Goodwill gestures have been provided to affected players according to the following procedure:</div><div><br></div><div>1. Players have been sent a wyrmprint that has the same name and illustration as the pre-2.0.0 wyrmprint.</div><div><br></div><div>2. If the first ability of the pre-2.0.0 wyrmprint and the first ability of the wyrmprint given as a goodwill gesture in step 1 had different effects, players were provided additional goodwill gestures in the form of a wyrmprint with an effect equivalent to the pre-2.0.0 wyrmprint&#39;s first ability.</div><div><br></div><div>3. If the second ability of the pre-2.0.0 wyrmprint and the first ability of the wyrmprint given as a goodwill gesture in step 1 had different effects, players were provided additional goodwill gestures in the form of a wyrmprint with an effect equivalent to the pre-2.0.0 wyrmprint&#39;s second ability.</div><div><br></div><div>4. For each of the wyrmprints given in steps 1, 2, and 3, a total number of converted wyrmprints was calculated based on the number and unbinding progress of the pre-2.0.0 wyrmprint.</div><div><br></div><div>A pre-2.0.0 wyrmprint&#39;s converted number was calculated as follows:</div><div>Unbound 0 times: 1</div><div>Unbound 1 time: 2 (= 2 copies of the same wyrmprint)</div><div>Unbound 2 times: 3 (= 3 copies of the same wyrmprint)</div><div>Unbound 3 times: 4 (= 4 copies of the same wyrmprint)</div><div>Unbound 4 times: 5 (= 5 copies of the same wyrmprint)</div><div><br></div><div>Example: If an affected player had two Valiant Crown wyrmprints, each unbound 4 times, then the total number of converted wyrmprints would be 10.</div><div>Note: If a pre-2.0.0 wyrmprint&#39;s converted number totaled 20, the unbinding and copy nodes of the wyrmprint given as a goodwill gesture were fully unlocked.</div><div><br></div><div>5. If the total number of converted wyrmprints calculated in step 4 was less than 20:</div><div>・If the total number of converted wyrmprints was 1 to 5, they were used to unlock the unbinding nodes.</div><div>・If the total number of converted wyrmprints was 6 to 20, the first five were used to unlock the unbinding nodes and the remainder were used in groups of five to unlock the copy nodes.</div><div>Note: If the remainder was not enough to unlock a copy node, it was converted into eldwater instead.</div><div>・The HP &amp; Strength nodes were unlocked based on the amount of EXP gained, with surplus EXP (if any) being converted into consecrated water.</div><div><br></div><div>6. If the total number of converted wyrmprints calculated in step 4 was 20 or more:</div><div>・The unbinding and copy nodes of the wyrmprint given as a goodwill gesture were fully unlocked;</div><div>・Its HP &amp; Strength nodes were unlocked based on the amount of EXP gained, with surplus EXP (if any) being converted into consecrated water;</div><div>・Surplus converted wyrmprints (number 21 and beyond) were converted into eldwater.</div><div><br></div><hr><div>Example: If the player had two Valiant Crown wyrmprints, each Lv. 1 and unbound 4 times (note that the ability values are those of a wyrmprint that has been unbound 0 times):</div><div>・Pre-2.0.0 wyrmprint</div><div>5★ Valiant Crown</div><div>First ability: Skill Damage +20%</div><div>Second ability: Strength Doublebuff +5%</div><div><br></div><div>・Wyrmprints provided as goodwill gestures</div><div>A: 5★ Valiant Crown</div><div>First ability: Skill Damage +20%</div><div>B: 4★ Sisters of the Anvil</div><div>First ability: Strength Doublebuff +5%</div><div><br></div><div>・Converted number of wyrmprints totaled in step 4</div><div>Number of wyrmprints: 10</div><div><br></div><div>Because the converted number totals 10, wyrmprints A and B would be upgraded as follows:</div><div>A: 5★ Valiant Crown / Lv. 1 / Unbinding node progress: 4 / Copy node progress: 2</div><div>First ability: Skill Damage +20%</div><div>B: 4★ Sisters of the Anvil / Lv. 1 / Unbinding node progress: 4 / Copy node progress: 2</div><div>First ability: Strength Doublebuff +5%</div><div><br></div><hr><div>Example: If the player had five Valiant Crown wyrmprints, each Lv. 1 and unbound 4 times (note that the ability values are those of a wyrmprint that has been unbound 0 times):</div><div>・Pre-2.0.0 wyrmprint</div><div>5★ Valiant Crown</div><div>First ability: Skill Damage +20%</div><div>Second ability: Strength Doublebuff +5%</div><div><br></div><div>・Wyrmprints provided as goodwill gestures</div><div>A: 5★ Valiant Crown</div><div>First ability: Skill Damage +20%</div><div>B: 4★ Sisters of the Anvil</div><div>First ability: Strength Doublebuff +5%</div><div><br></div><div>・Converted number of wyrmprints totaled in step 4</div><div>Number of wyrmprints: 25</div><div><br></div><div>Because the converted number totals 25, wyrmprints A and B would be upgraded as follows:</div><div>A: 5★ Valiant Crown / Lv. 1 / Unbinding node progress: 4 / Copy node progress: 4</div><div>First ability: Skill Damage +20%</div><div>B: 4★ Sisters of the Anvil / Lv. 1 / Unbinding node progress: 4 / Copy node progress: 4</div><div>First ability: Strength Doublebuff +5%</div><div><br></div><div>The remaining 5 wyrmprints would be converted into eldwater.</div><div><br></div><hr><div>■Regarding the Mana Fount wyrmprint</div><div>Players have been sent goodwill gestures of rupies and consecrated water instead of another wyrmprint for this pre-2.0.0 wyrmprint.</div><div><br></div><div>■Regarding the The Chocolatiers wyrmprint</div><div>The Skill Prep +100% effect obtained when fully unbound has been changed to Skill Prep +50%. With this change, players in possession of the The Chocolatiers wyrmprint have been sent the 4★ wyrmprint Rogues&#39; Banquet, which has the same effect.</div><div><br></div><div>The Rogues&#39; Banquet wyrmprint is available from the 4★ tab of the Treasure Trade for wyrmprints.</div><div><br></div><div>■Regarding unbinding items</div><div>If players used any of the following wyrmprint-unbinding items from unbind packs purchased in the in-game Shop before Version 2.0.0 was released, they have been sent the amount of these items used: Silver Key and Golden Key.</div><div><br></div><div>For further details, please see the following notification:</div><div><br></div><div><a href="https://dragalialost.com/en/news/detail/1572">[Important] Regarding Goodwill Gesture Items for Purchasable Items Affected by System Changes</a></div><div><br></div><div>Goodwill Gestures for the use of wyrmprint-unbinding items that were obtained from sources other than packs purchased in the in-game Shop has been provided in the form of Version 2.0.0 wyrmprints or eldwater.</div><div><br></div><div>■Wyrmprint storage capacity</div><div>If players purchased the Storage Pack and/or Wyrmprint Storage +5 storage expansions in the in-game Shop before Version 2.0.0 was released, they have been sent bonus diamantium or wyrmite.</div><div><br></div><div>For further details, please see the following notification:</div><div><br></div><div><a href="https://dragalialost.com/en/news/detail/1572">[Important] Regarding Goodwill Gesture Items for Purchasable Items Affected by System Changes</a></div><div><br></div><div>If a player had unlocked wyrmprint storage expansions as a clear reward in the main campaign before Version 2.0.0 was released, they have been sent the new clear rewards.</div><div><br></div><div>Thank you for playing Dragalia Lost.</div>,start_time:1601002800,update_time1600932904