article_id:1659,category_name:News,title_name:Dragalia Lost Director Yuji Okada Responds to Player Feedback (from September 27, 2020),image_path:,message:<div>On September 27, 2020, Dragalia Lost director Yuji Okada replied to feedback players sent via the in-game Leave Feedback feature.</div><div><br></div><div>This notification contains the contents of an interview with director Okada that was conducted by Yumi Uchiyama and Ayaka Asai, voice actors for the Japanese-language version of Dragalia Lost.</div><div><br></div><div>Notes:</div><div>・The feedback featured in this notification was chosen from feedback received between August 1 and August 31.</div><div>・Tap Feedback on the game&#39;s title screen to open the Leave Feedback screen.</div><div>・The content of the interview has been edited for this notification, so wording may differ from the original conversation.</div><div>・The content of the responses is from the time of the interview, so content that is in development may differ by the time of release in-game.</div><div><br></div><hr><div>■Responses to Feedback</div><div>Uchiyama &amp; Asai: The multitude of adjustments and additions in Version 2.0 have likely resolved some of the issues in the feedback that we&#39;ve received from players in the past, so let&#39;s focus on that first. With that said, how about something that was removed: the Mentor Bonus. What are your thoughts on that?</div><div>Okada: We have received a lot of feedback about the Mentor Bonus in the past, but with the introduction of completely separate solo and co-op variants of certain quests in Version 2.0 and corresponding rewards, we determined that the Mentor Bonus was no longer necessary.</div><div><br></div><div>The types of items that drop in solo and co-op play are the same. You can get the same amount of rewards that you could before the update by playing solo, and we have adjusted the enemy balance such that these quests are easier to complete than their co-op variants. However, slightly more rewards are available to those playing co-op.</div><div><br></div><div>These changes may cause fewer people to play co-op overall, making the Mentor Bonus harder to obtain if we had kept it. However, in the long run we believe that the loss of the Mentor Bonus is outweighed by the smoother player progression provided by solo-play variants of these quests.</div><div><br></div><div>We hope that both veteran players as well as players who haven&#39;t yet been able to master Advanced Dragon Trials and the Agito Uprising will find something to like in the solo-play quests. Of course, players still have the option of banding together with others in quick play or calling upon their fellow alliance members for some co-op fun should they wish to do so.</div><div><br></div><div><br></div><div>Uchiyama &amp; Asai: In the past, players have requested that the summoning system allow them a guaranteed way to obtain a featured summon. It seems that Version 2.0 has added just such a system, hasn&#39;t it?</div><div>Okada: That&#39;s right. We&#39;ve had a lot of requests for this feature too. In the latest update, we introduced wyrmsigils for this very purpose. Players earn wyrmsigils as they summon in a summon showcase, then redeem a certain number of them to obtain an adventurer or dragon of their choice from that showcase.</div><div><br></div><div>Wyrmsigils earned from a summon showcase can only be redeemed on that particular showcase, but once the showcase ends, the wyrmsigils will turn into wyrmsigil remnants, which can be exchanged for various items.</div><div><br></div><div><br></div><div>Uchiyama &amp; Asai: Some players wrote in to express a desire for a sort of &quot;training ground&quot; where players are free to try out different attacks and skills on target dummies, or just take the time to appreciate the game&#39;s movement and attack animations without any battlefield distractions.</div><div>Okada: I can understand the desire to want to take your favorite adventurer, dragon, or team out for a test drive given the freedom that players have in mixing and matching ever more complex skills and abilities. Certain players may even enjoy the trial-and-error that goes into finding the best results. I can&#39;t promise anything right away, but we will keep these requests in mind and work to meet them bit by bit.</div><div><br></div><hr><div>Director Okada will continue to reply to the feedback players send via Leave Feedback in the future. We&#39;re looking forward to hearing your comments. (The feedback featured in the next notification will be chosen from feedback received between September 1 and September 30.)</div><div><br></div><div>Thank you for playing Dragalia Lost.</div>,start_time:1601618400,update_time1601536767