article_id:1720,category_name:Events,title_name:A New Facility Event, The Phantom's Ransom, Is Now Live!,image_path:https://dragalialost.akamaized.net/attached/information/images/f532c932c025c42516ae104bf09f3dc5.png,message:<div>A new facility event, The Phantom&#39;s Ransom, went live at <span class="local_date" data-local_date="1603778400"></span>!</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/f532c932c025c42516ae104bf09f3dc5.png"></div><div>The Speranza Opera Troupe receives a letter from Lapis, the phantom thief, in which she threatens to abduct their lead singer, Belladonna. Despite the Prince and friends&#39; best efforts to protect her, Lapis manages to spirit the star performer away. In order to save Belladonna, the show must go on&mdash;but who will take the stage as the next prima donna? It&#39;s time for none other than the pirate captain Karina to shine!<br><br>■Event Overview<br>In The Phantom&#39;s Ransom, you can acquire an event-exclusive facility: the opera house. If you play the event, you&#39;ll have the chance to build one for your Castle Grounds!<br><br>The opera house boosts the stats of adventurers who wield bows or manacasters. It also boosts the damage that adventurers deal against enemies in event quests. Progress through the event story and level up your opera house.<br><br>Equip the event-specific wyrmprint Free-Spirited Opera to receive more librettos, which are used to upgrade the opera house. You can also equip the wyrmprints Welcome to the Opera! and Enter the Blue Rose! (available from the Treasure Trade for wyrmprints) to receive more vibrato when clearing quests. Use these three wyrmprints to get the most out of this event!<br><br>Please note that special effects conferred by event-specific wyrmprints do not apply if you begin a quest during the event period but complete the quest after the event period has ended.<br><br>■Event Duration<br><span class="local_date" data-local_date="1603778400"></span> to <span class="local_date" data-local_date="1604901599"></span><br><br>■Event Update<br>The event will be updated at <span class="local_date" data-local_date="1604037600"></span> to add stories, quests, and treasure trade rewards.<br><br>■Reward Availability Period<br><span class="local_date" data-local_date="1603778400"></span> to <span class="local_date" data-local_date="1605506399"></span><br><br>■Event-Exclusive Facility: Opera House<br>This facility increases the stats of adventurers who use bows or manacasters. It also confers a special effect that lets you deal more damage to enemies in these event quests. The strength of this effect increases as you level up the opera house. This effect only applies for the duration of this event. To level up the opera house, you&#39;ll need librettos, which you can find in these event quests.<br><br>■Upgrade Item: Librettos<br>You can get these items from the story quests, boss battles, and extra boss battles for this facility event.<br><br>■Boss Battles<br>Boss battles are quests where you can face off against boss enemies that appear in the event story. Rewards vary depending on the difficulty cleared. This quest can be played either solo or co-op.<br><br>■Extra Boss Battles<br>Although the difficulty level of extra boss battles is higher than the event boss battle on Expert difficulty, the rewards are generous and the battles do not cost stamina or getherwings. Extra boss battles occasionally appear after clearing the event boss battle on Expert difficulty.<br><br>Even if you clear the boss battle several times in a row using the auto-repeat feature, the extra boss battle will only become available once at most. It will disappear again after being successfully cleared. Once the conditions for the quest are met, you can unlock it repeatedly. This quest can be played either solo or co-op.<br><br>■Challenge Battles<br>Challenge battles are high-difficulty quests limited to solo play, and are available in Expert, Master, and Nightmare difficulties. The Expert difficulty challenge battle is unlocked after completing the event boss battle on Expert difficulty, and the Master difficulty challenge battle will unlock when you complete the Expert difficulty challenge battle.<br><br>The Nightmare difficulty challenge battle will become available at <span class="local_date" data-local_date="1603951200"></span>, and you must complete the Master difficulty challenge battle to play it.<br>Note: Even if you complete the Master difficulty challenge battle, you will not be able to play the Nightmare battle until it is available.<br><br>These quests will have you testing your strength against waves of enemies. If you fail to reach the last wave in Expert or Master difficulty, you will still receive rewards for the ones you did clear, but in Nightmare difficulty you must complete the final wave to earn rewards.<br><br>Finally, the drop rate for rewards differs based on the difficulty. The drop rate for rewards in Nightmare difficulty is the same as Master difficulty. Once per day when you clear Nightmare difficulty, you can get a Grand Bounty. The Grand Bounty you receive is randomly selected from a set of rewards.<br><br>■Trial Quests<br>You can play these high-difficulty quests in either solo or co-op. Trial quests will be available starting at <span class="local_date" data-local_date="1604037600"></span> and can be unlocked by progressing through the event quests.<br><br>■Vibrato Rewards<br>Vibrato points are event-exclusive points that can be earned by clearing event quests. Collect them to earn all kinds of rewards!<br><br>■Treasure Trade Rewards<br>You can earn thief&#39;s calling cards and blue roses by playing event quests and trade them for various rewards on the Treasure Trade menu. What&#39;s more, in this event you&#39;ll be able to trade librettos, which are required to level up the opera house event facility, for thief&#39;s calling cards and blue roses, which are only used in the Treasure Trade, and vice versa.<br><br>■Event Bonus<br>The following wyrmprints will have bonus effects during this event.<br>・Free-Spirited Opera<br>・Welcome to the Opera!<br>・Enter the Blue Rose!<br>If you equip these wyrmprints and clear event quests, you&#39;ll get even more librettos and vibrato points.<br><br>You can get Free-Spirited Opera from endeavor rewards. Welcome to the Opera! and Enter the Blue Rose! are available in the Treasure Trade for wyrmprints.<br>Note: The amount of event bonus effect differs based on the wyrmprint and how much the wyrmprint has been unbound.<br><br>■Endeavors<br>These endeavors can only be attempted for the duration of the event. They are separated into Daily and Limited variations. By accomplishing these endeavors, you can receive various rewards.<br>&nbsp;<br>Notes:<br>1. You can see more details about this event by tapping Help on the event page.<br>2. Players must have completed up to Chapter 2 / 2-1 (Normal) of the main campaign to participate.<br>3. Players must have completed up to Chapter 2 / 2-1 (Normal) of the main campaign to play co-op.<br>4. If the event ends while you are playing an event quest, the quest will continue until results have been determined and you will be able to gain the rewards shown.<br><br>Thank you for playing Dragalia Lost.</div>,start_time:1603778400,update_time1603692676