article_id:1777,category_name:Events,title_name:Legend Difficulty Is Coming to Volk's Wrath!,image_path:https://dragalialost.akamaized.net/attached/information/images/39eb5f75ecf67b263790dedaef00aab0.png,message:<div>A new Legend difficulty will be added to Volk&#39;s Wrath in The Agito Uprising (high-difficulty quests where you&#39;ll face powerful foes) at <span class="local_date" data-local_date="1606456800"></span>.</div><div><br></div><div>Volk&#39;s Wrath: Legend may only be undertaken by a team of flame-attuned adventurers. Clear this quest to earn materials required to further refine flame-attuned 6★ weapons. Once an Agito weapon is refined to its second stage, its appearance will change!</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/39eb5f75ecf67b263790dedaef00aab0.png"></div><div>The Agito are fangs.</div><div>The Agito are an awakening.</div><div>The Agito are an uprising.</div><div><br></div><div>When a masked being referred to as an Agito appears, violent winds of plague blow across the land, and a hungry wolf bares his fangs. That wolf has a name, and that name is Volk.</div><div><br></div><div>■Changes to Survival Bonuses and the Number of Revives</div><div>Survival bonuses and the number of revives will change at <span class="local_date" data-local_date="1606456800"></span>. The number of revives in Volk&#39;s Wrath: Master will be changed to one, and survival bonuses will be added. The number of revives in Volk&#39;s Wrath: Expert will be increased to two, and the survival bonus content will be changed. The number of revives in Volk&#39;s Wrath: Standard will be increased to three, and the survival bonus content will be changed.</div><div><br></div><div>Notes:</div><div>1. Players must have completed Chapter 10 / 6-3 (Normal) of the main campaign and any of the Standard-difficulty Advanced Dragon Trials in solo or co-op play to play The Agito Uprising.</div><div>2. Players must have completed Volk&#39;s Wrath: Master in solo or co-op play to play Volk&#39;s Wrath: Legend in solo play.</div><div>3. Players must have completed Volk&#39;s Wrath: Master in solo or co-op play to play Volk&#39;s Wrath: Legend in co-op play.</div><div><br></div><div>Thank you for playing Dragalia Lost.</div><div><br></div>,start_time:1605765600,update_time1605678013