article_id:1800,category_name:News,title_name:This Month in Dragalia Lost,image_path:,message:<div>Hello! Yuji Okada here, director of Dragalia Lost.</div><div><br></div><div>I want to start by thanking you for playing Dragalia Lost.</div><div><br></div><div>The Princess Connect! Re: Dive: A Voracious Visitor raid event is currently live. I hope you&#39;re enjoying the encounters between the denizens of the Halidom and Pecorine, a special girl from somewhere entirely different.</div><div>I also hope you&#39;re enjoying this event&#39;s original theme song sung by M・A・O. You&#39;ll be able to listen to it during the story scenes and can enjoy rocking out to a guitar arrangement while questing.</div><div>What&#39;s more, a Prize Showcase featuring the adventurers Pecorine and Forager Mitsuba and the dragon Lumi&egrave;re Pandora from this event is currently live!</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/9d941d74d695d2183573e6ecf3a05fcd.png"></div><div><br></div><div>Because Pecorine is the only character from the Princess Connect! Re: Dive game to join us for this event, we were able to devote a lot of effort to implementing her existing appearance and animations with a Dragalia Lost flair while remaining faithful to the source material. You may notice that her 3D model holds her sword with two hands rather than one, just as she does in her art. If you&#39;re familiar with her game, you&#39;ll definitely recognize the skill animations and cut-ins during battle, which come straight from the source. Despite this painstakingly accurate recreation, we were careful to ensure that Pecorine plays just as smoothly and enjoyably as any other adventurer.</div><div>As perpetually peckish as she is, Pecorine can&#39;t resist sneaking in a little bite here and there, like while she&#39;s out questing and even when she&#39;s placed into a team on the Edit Teams screen! We hope that both new and existing fans of Pecorine will enjoy using her!</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/7260b6981505de70d57ba82d2e96e10a.png"></div><div><br></div><div>Please note that Pecorine is not a limited adventurer and will continue to appear in future summon showcases.</div><div><br></div><div>■Plans for This Month</div><div>・Mana spirals for the adventurers Serena and Yuya will be added at <span class="local_date" data-local_date="1607319600"></span>.</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/7e417e0ab67f7634dac0029091478b65.png"></div><div><br></div><div>・A Dragonyule-themed onslaught event will be held in mid-December alongside a summon showcase featuring new Dragonyule versions of one male and one female adventurer. Dragonyule versions of adventurers from last year and earlier will return in a subsequent summon showcase.</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/e2936d36a263d430b4c8a1b005d04e99.png"></div><div><br></div><div>・The A Dash of Disaster facility event will be making a return in mid-December. This will be a good opportunity to level up the facility obtained from this event to boost the stats of blade- and wand-wielding adventurers if you haven&#39;t already.</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/3739bf0bc2fc11cf39af65298331cb15.png"></div><div><br></div><div>・Chapter 17 of the main campaign will be added in mid-December. The first destination our heroes set out for in the land of North Grastaea is a place called Grams. Many characters will debut in this chapter, so get ready to remember some new names and faces!</div><div><br></div><div>・The Time Attack Challenges event will be held in late December. Players will have a wider variety of quest difficulties to tackle this year when compared to the last, and the rankings themselves will only apply to a certain selection of high-difficulty quests. Rewards will be adjusted to account for these changes.</div><div>Players who complete eligible solo quests within the alloted time will receive rewards. Eligible quests are The Imperial Onslaught, Void Battles, Advanced Dragon Trials on Standard difficulty, and The Agito Uprising on Standard difficulty.</div><div>Rankings will be aggregated separately between solo and co-op play. Eligible quests for solo play are The Agito Uprising on Standard difficulty and eligible quests for co-op play are The Agito Uprising on Expert difficulty. Rankings will be updated daily and players will be able to see information on which teams were used.</div><div>Players who place in the top tier of these rankings will not receive any special items, but they will be rewarded with an event-exclusive epithet for their effort.</div><div><br></div><div>■Future Updates<br>・A year-end update for The Alberian Battle Royale is in the works. We plan to add new map mechanics and the ability to use skins of the adventurers in your roster and weapons in your inventory. Please note that skins for some, but not all, adventurers can be unlocked with certain items or traded for in the Treasure Trade. These adjustments will help keep the mode fresh, so be sure to check it out if you haven&#39;t played in a while.<br><br>・We are working hard on high-difficulty quests to succeed The Agito Uprising and hope to release more information sometime next year. As a sneak-peek, have a look at the design of one of the bosses you can expect to battle.</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/cf8f5fb7a5c3f2fffa9ab57a11edfaf7.png"></div><div>・The next Legend-difficulty quest for The Agito Uprising will be made available in late January of 2021. We will provide further information, including which boss will be featured, in an upcoming notification posted in-game and on the official social media channels.<br><br>・Though there will not be a year-end episode of Dragalia Digest this year, please rest assured that the traditional end-of-year events will be arriving in full force, including a lucky letters raffle and log-in bonus. Look forward to further details soon!<br>In addition, this year will close out with a Hinomotoan-themed event, just as previous ones did. However, unlike the events of the past two years, this one will have a slightly different atmosphere and will shine a light on those who would oppose the twelve wyrmclans rather than work with them.<br>Finally, we plan to start the new year off right with an announcement in early January, so I hope you&#39;ll find time for some Dragalia Lost fun throughout this holiday season!<br><br>■In Conclusion<br>This is the final installment of This Month in Dragalia Lost for the year of 2020, so please let me close out this tumultuous time with two simple words: thank you. I and everyone who works with me to bring the Dragalia Lost game to life would like to express our gratitude to you for playing and supporting the game this year. Please take care of yourself and others and use the holiday season as a time to rest and recharge. If our game has brought a smile to your face this year, then we have done our jobs.<br><br>In closing, we&#39;re giving all players the following items this month.<br><br>・Tenfold Summon Voucher &times; 1<br><br>The next installment of This Month in Dragalia Lost will be posted around <span class="local_date" data-local_date="1609480800"></span>.<br><br>Until then, thanks for reading, and for continuing to play Dragalia Lost!<br><br>Yuji Okada<br>Director, Dragalia Lost<br><br>Notes:<br>・The gift can be claimed from your goodie box for up to seven days after reception. If the gift isn&#39;t retrieved within seven days, it will be lost.<br>・Summon showcase, event, and update content may change without notice.<br>・Any adventurers and game screenshots shown are still in development.</div>,start_time:1606802400,update_time1606730943