article_id:1849,category_name:Events,title_name:Astral Raids Are Here!,image_path:https://dragalialost.akamaized.net/attached/information/images/011f0d1be28deb9ad8be621a29e7529a.png,message:<div>Astral Raids are available in Event Quests starting <span class="local_date" data-local_date="1608962400"></span>!</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/011f0d1be28deb9ad8be621a29e7529a.png"></div><div>The Astrals.</div><div>They are the culmination of countless memories amassed from the corners of the world.</div><div>They are the recollection of past ruin on the constant brink of reemergence.</div><div>They are the calamities that descended upon the world in bygone days.</div><div>Cleanse a world scourged by the flames of catastrophe!</div><div><br></div><div>See below for more information on Astral Raids.</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/7d6536f753d908646d15bd0f63d50d83.png"></div><div>■Featured Boss</div><div>Hypnos</div><div><br></div><div>■Astral Raids Overview</div><div>・Astral Raids are event quests where you can fight against past raid bosses, but they are only available on the weekends.</div><div>・To challenge Astral Raids quests, you will need to use astral pieces.</div><div>・You can spend astral pieces for multiple battles in a single go, allowing you to claim rewards for multiple raids in a single raid battle.</div><div>Example: If you use the number of astral pieces required for three battles, you will receive three times the rewards.</div><div><br></div><div>■Event Duration</div><div><span class="local_date" data-local_date="1608962400"></span> to <span class="local_date" data-local_date="1609135199"></span></div><div><br></div><div>■Astral Raid Battles</div><div>・Astral Raids are raid battles where up to four players with four adventurers each (up to 16 adventurers in total!) can battle together against raid bosses.</div><div>・There are four difficulty levels available: Beginner, Standard, Expert, and Master.</div><div>・The rewards and number of astral pieces required to challenge the battle vary based on the difficulty.</div><div>・The Expert and Master difficulties will drop special items that can be used to confer augments.</div><div><br></div><div>・Solo</div><div>Astral pieces will be used at the start of the battle.</div><div><br></div><div>・Co-op (host)</div><div>Astral pieces will be used when creating a room.</div><div><br></div><div>・Co-op (guest)</div><div>Astral pieces will be used when joining co-op.</div><div>When challenging Astral Raids, you must meet the required Might for the selected difficulty.</div><div><br></div><div>■Astral Pieces</div><div>・Astral pieces can be obtained from the main campaign and event quests.</div><div>・You will not receive astral pieces for clearing The Mercurial Gauntlet quests.</div><div>・You will not receive astral pieces for clearing quests while Astral Raids are active.</div><div>・The maximum number of astral pieces you can hold is 300.</div><div>・If you obtain astral pieces after reaching the limit, those astral pieces will be lost.</div><div>・You can purchase astral pieces from the shop while Astral Raids are active. If you have insufficient astral pieces when attempting to challenge a quest, you can also purchase them at that time.</div><div><br></div><div>■Treasure Trade Rewards</div><div>・Astral shards, which can be obtained from Astral Raids, can be traded in the Treasure Trade for insignias, special items that can be used to confer augments, and other rewards.</div><div>The number of times you can trade for rewards in the Treasure Trade resets each month.</div><div><br></div><div>Notes:</div><div>1. Players must have completed up to Chapter 2 / 2-1 (Normal) of the main campaign to participate in Astral Raids.</div><div>2. Players must have completed up to Chapter 2 / 2-1 (Normal) of the main campaign in order to play co-op.</div><div>3. Astral pieces will not be consumed if you fail or retire from an Astral Raids quest.</div><div>4. If not used to challenge the current Astral Raids quest, astral pieces you have obtained will be maintained for use in Astral Raids quests the next week and onward. These astral pieces can be used in future Astral Raids quests.</div><div>5. Even if you spend astral pieces for multiple battles to claim rewards for multiple raids in a single raid battle, the number of times you have cleared the quest will be counted as one.</div><div>6. For more information about Astral Raids, tap Help on the Astral Raids event page in-game.</div><div>7. In Astral Raids, demolishing enemy parts will not grant the part-demolish reward.<br><br></div><div>Thank you for playing Dragalia Lost.</div>,start_time:1608962400,update_time1608278851