article_id:1898,category_name:Events,title_name:A New Event, Fortune's Fray, Is Now Live!,image_path:https://dragalialost.akamaized.net/attached/information/images/85b9b32ce47305400cb20d82d73dccdf.png,message:<div>The Fortune&#39;s Fray event started at <span class="local_date" data-local_date="1610517600"></span>.</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/85b9b32ce47305400cb20d82d73dccdf.png"></div><div><br></div><div>The new year got off to a rocky start, but Seimei has decided to kick off the celebrations with a tournament! The competitors have already assembled&mdash;some familiar, and some mysterious. And with Luca and Elisanne both determined to claim victory, things are sure to get rowdy!</div><div><br></div><div>■Event Overview</div><div>This is a coliseum event in which players compete in a tournament to come out on top! Emerge victorious from the qualifying round against fiends to enter the big leagues where you&#39;ll square off in single combat against battle-hardened gladiators. Defeat each of these contestants to earn special rewards and move on to the next. Work your way up the ladder one by one until there&#39;s no one left to claim the glory of victory but you!</div><div><br></div><div>■Rewards</div><div>You can get flame tomes and wind tomes, which can unlock shared skills for flame- and wind-attuned adventurers respectively, as well as items that restore stamina as prestige rewards.</div><div><br></div><div>■Event Duration</div><div><span class="local_date" data-local_date="1610517600"></span> to <span class="local_date" data-local_date="1611208799"></span></div><div><br></div><div>■Reward Availability Period</div><div><span class="local_date" data-local_date="1610517600"></span> to <span class="local_date" data-local_date="1611813599"></span></div><div><br></div><div>■Story</div><div>In this event, you can enjoy a story about allies fighting with all of their might to come out on top. You can use the limited-time item, the tournament chronicle, to read the story.</div><div>Note: The story for this event will be partially voiced instead of fully voiced in Japanese.</div><div><br></div><div>■Playing the Event</div><div>This event has multiple quests for each difficulty (beginner, standard, expert, and master). At the start of the event, only one beginner quest will be unlocked. More quests can be unlocked using coliseum maps, items that are unique to the event. After clearing all of the quests of a given difficulty, you will receive a victory reward and the next difficulty will be unlocked.</div><div><br></div><div>To challenge the EX quest, you must collect coliseum maps to unlock the quest, then use a special invitation. Special invitations can be obtained from certain event quests or as prestige rewards, which are described below.</div><div><br></div><div>■Prestige Rewards</div><div>Prestige points are event-exclusive points that can be earned by clearing event quests. Collect them to earn all kinds of rewards! These rewards include limited-time items that can be used to unlock quests and new stories in this event, such as coliseum maps, special invitations, and tournament chronicles.</div><div><br></div><div>You can get coliseum maps by clearing quests in the event and collecting prestige, but you cannot get them as drop rewards.</div><div><br></div><div>■Castle Stories</div><div>A new castle story has been added under Castle. You can read castle stories by using looking glasses, which can be obtained as prestige rewards.</div><div><br></div><div>■Duels</div><div>Duels are special quests unique to coliseum events. These can only be played solo, and the player will control only one adventurer. Defeat the boss enemy to win the duel. If your adventurer&#39;s HP falls to zero, you will lose the duel.</div><div><br></div><div>■Treasure Trade Rewards</div><div>You can earn coliseum crystals by playing event quests and trade them for various rewards on the Treasure Trade menu.</div><div><br></div><div>■Endeavors</div><div>These endeavors can only be attempted for the duration of the event. They are separated into Daily and Limited variations. By accomplishing these endeavors, you can receive various rewards.</div><div><br></div><div>Notes:</div><div>1. You can see more details about this event by tapping Help on the event page.</div><div>2. Players must have completed up to Chapter 2 / 2-1 (Normal) of the main campaign to participate in event quests.</div><div>3. If the event ends while you are playing an event quest, the quest will continue until results have been determined, and you will be able to gain the rewards shown.</div><div>4. You will not be able to use coliseum crystals, coliseum maps, special invitations, or tournament chronicles obtained in this event in future events.</div><div><br></div><div>Thank you for playing Dragalia Lost.</div>,start_time:1610517600,update_time1609742746