article_id:1959,category_name:News,title_name:Dragalia Lost Director Yuji Okada Responds to Player Feedback (from January 24, 2021),image_path:,message:<div>On January 24, 2021, Dragalia Lost director Yuji Okada replied to feedback players sent via the in-game Leave Feedback feature.</div><div><br></div><div>This notification contains the contents of an interview with director Okada that was conducted by Yumi Uchiyama and Ayaka Asai, voice actors for the Japanese-language version of Dragalia Lost.</div><div><br></div><div>Notes:</div><div>・The feedback featured in this notification was chosen from that received between December 1 and December 31.</div><div>・Tap Feedback on the game&#39;s title screen to open the Leave Feedback screen.</div><div>・The content of the interview has been edited for this notification, so wording may differ from the original conversation.</div><div>・The content of the responses is from the time of the interview, so content that is in-development may differ by the time of its release in-game.</div><div><br></div><hr><div>■Responses to Feedback from Players</div><div>Uchiyama &amp; Asai: Let&#39;s begin by revisiting the Alberian Battle Royale. Since the mode is available only on weekdays, some players have found that their work or personal schedule restricts their ability to participate. Of course, for some players weekdays are a better fit than the weekend, but it would be nice if both weekday-focused players and weekend-focused players had an equal opportunity to participate.</div><div><br></div><div>Okada: First of all, let me thank players for their passion for the Alberian Battle Royale. Currently, the mode is only available for a period of two weekdays (late Tuesday to late Thursday Pacific Time) each week, but we are planning to add a period during Saturday and Sunday into the mix as well.</div><div><br></div><div>Initially we did not include a weekend period in the mode&#39;s schedule in order to avoid overwhelming players who wanted to take advantage of the various events available during the weekend, including Astral Raids and the Weekly Bonus, but since the Alberian Battle Royale offers rewards based on the amount of battle points that players earn each month, we think it would be wise to provide more flexibility in earning them.</div><div><br></div><div><br></div><div>Uchiyama &amp; Asai: Time Attack Challenges, a special event in which players compete against one another to see who can clear set quests in the fastest time, offers players a good chance to put their top teams to the test. However, in the spirit of fair and balanced competition, it may be better to enforce certain restrictions (such as dragon elemental attunements) or even create a common pool of adventurers, dragons, and wyrmprints that everyone can build their teams from. Doing so should allow the players who are truly skilled in the art of building teams and implementing strategies to stand out from players who enjoy the benefits of access to an extensive and powerful roster.</div><div><br></div><div>Okada: We are exploring ways to make Time Attack Challenges more engaging, including adding some variety to the quests. Now that the first iteration of this event has taken place, we are reflecting on potential areas of improvement. For example, top players were battling it out to shave off every last second from their clear times, so in the future these times will be displayed to the tenths of a second for improved precision and clarity. We&#39;d also like to lengthen the duration of some quests so that players can attempt both quick and sustained strategies.</div><div><br></div><div>For players who prefer to focus on a more concrete goal, this event also provided rewards for clearing quests in under a predetermined amount of time. These rewards could be earned once for each class (C, B, A, A+, S, and S+) and provided a sense of progression independent of other players. I&#39;m happy to say that these rewards were well-received, so they will return in future events.</div><div><br></div><div><br></div><div>Uchiyama &amp; Asai: Some particularly dedicated players have reached the player level cap and have remarked that their motivation to play has decreased a bit since that particular measure of progression is no longer there.</div><div><br></div><div>Okada: We plan to increase the player level cap around the end of March and kindly ask for your patience until then.</div><div><br></div><div><br></div><div>■Responses to Questions from Uchiyama &amp; Asai</div><div>Uchiyama &amp; Asai: What kinds of things can fans of the Phantom Thieves look forward to in the Caged Desire event?</div><div><br></div><div>Okada: Each member of the Phantom Thieves appearing in the event has their very own special weapon, and we&#39;ve implemented their animations in such a way that it seems like they jumped from their source game straight into the world of Dragalia Lost.</div><div><br></div><div>Perhaps the biggest feature that fans will notice is that the Caged Desire adventurers summon their unique Personas to fight alongside them in battle instead of shapeshifting into a dragon like every other adventurer. What&#39;s more, Joker, Panther, and Sophie each sport the equivalent of a manacaster when performing their force strike, so they can engage with the enemy from a variety of distances.</div><div><br></div><div>When Joker&#39;s Persona gauge is full, players can tap a button to summon Ars&egrave;ne to the battlefield for some tag-team takedowns. It&#39;s quite the sight to see Joker, Mona, Panther, and Sophie moving and fighting side-by-side with their respective Personas!</div><div><br></div><div><br></div><div>Uchiyama &amp; Asai: Is the story for this event one unique to the world of Dragalia Lost? How will the denizens of the Halidom interact with the Phantom Thieves?</div><div><br></div><div>Okada: The story for this event was tailor-made for Dragalia Lost and features interactions between the various adventurers of the Halidom and the Phantom Thieves of Hearts. As shown in the event trailer, the central figure in the story and the impetus for the Phantom Thieves&#39; otherworldly arrival is none other than the vain Prince Emile himself. Themes like falling from grace and reconciling with deep desires are hallmarks of the Persona series, and I am confident that this story is a faithful representation of what would happen if the Phantom Thieves found themselves in the world of Dragalia Lost&mdash;and one that can only be told in this unique format.</div><div><br></div><hr><div>Director Okada will continue to reply to the feedback players send via Leave Feedback again in the future. We&#39;re looking forward to hearing your comments. (The feedback featured in the next notification will be chosen from feedback received between January 1 and January 31.)</div><div><br></div><div>Thank you for playing Dragalia Lost.</div>,start_time:1611986400,update_time1611826651