article_id:1993,category_name:News,title_name:Part One of Main Campaign Chapter 18: The Forest of the Faeries, Added! More Dragons Can Be Unbound Using Draconic Essences!,image_path:https://dragalialost.akamaized.net/attached/information/images/492c60c241daf56a6c2dee3743e16678.png,message:<div>Part one of Chapter 18: The Forest of the Faeries was added to the main campaign on <span class="local_date" data-local_date="1613628000"></span>!</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/492c60c241daf56a6c2dee3743e16678.png"></div><div><br></div><div>The prince and his friends hurry on, leaving the forest and finding themselves on a snowy mountain path. Once there, they must face the faeries&#39; trial, which forces them to confront a fearsome foe: their own inner weaknesses. But just as the prince is about to lose heart and Notte finds herself at the mercy of an unfamiliar voice, a proud sylvan warrior rises up against a longtime foe to save them!</div><div><br></div><div>We hope you&#39;re looking forward seeing what&#39;s in store for the prince and his friends!</div><div><br></div><div>Also, as of <span class="local_date" data-local_date="1613628000"></span>, more dragons can be unbound using draconic essences. Draconic essences were added for the following dragons.</div><div>・Apollo</div><div>・Nimis</div><div>・Vayu</div><div>・Pop-Star Siren</div><div>・Andromeda</div><div><br></div><div>Notes:</div><div>1. Part one of Chapter 18: The Forest of the Faeries will unlock if you clear Ch. 17 / 5-4 &quot;The Faeries&#39; Home.&quot;</div><div>2. You can use the draconic essence icon displayed on the area map for each chapter in the main campaign to check the dragon whose draconic essence you can obtain, how many draconic essences you currently have, how many more you can obtain, and the quests from which you can obtain draconic essences.</div><div><br></div><div>Thanks for playing Dragalia Lost.</div>,start_time:1613628000,update_time1613386056