article_id:2004,category_name:Updates,title_name:Version Update [Update],image_path:,message:<div><span style="color: rgb(41, 105, 176);"><strong>[Addendum <span class="local_date" data-local_date="1614308400"></span></strong></span></div><div>]As a token of our appreciation, the following item has been sent to players who started playing before <span class="local_date" data-local_date="1614308400"></span>.</div><div><br>・Tenfold Summon Voucher &times; 1</div><div><br>This gift can be claimed from your goodie box for up to seven days after reception. If the gift isn&#39;t retrieved within seven days, it will be lost.</div><div><br>Thank you for playing Dragalia Lost.</div><div><br></div><hr><div>Version 2.5.0 will be available for download around <span class="local_date" data-local_date="1614222000"></span>. You may install it when it becomes available; otherwise, an automatic update will occur at approximately <span class="local_date" data-local_date="1614308400"></span>.</div><div><br></div><div>When you update to version 2.5.0 and play co-op, you will no longer be matched with players using earlier versions of the game. Rooms created by players playing earlier versions will not display in the Room List, and you will not be able to join them using Find a Room, Join Nearby Players, Enter an ID, or alliance chat.</div><div><br></div><div>To celebrate the update, we&#39;ll be sending all players a Tenfold Summon Voucher after the automatic update. This notice will be modified after it has been distributed.</div><div>Note: The Tenfold Summon Voucher will not be distributed until after the automatic update, even if you complete the update to version 2.5.0 early.</div><div><br></div><div>■Update Details</div><div>▼New Feature: Shapeshifting in Auto-Play</div><div>If both the Auto-Play and Shapeshift buttons are toggled on, adventurers will automatically shapeshift into their dragon form during quests as soon as they are able to do so. The Shapeshift button can only be toggled on while auto-play is enabled and is also available when using auto-repeat.</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/b825a591df6d07e3238b85555231eba5.png"></div><div><br></div><div><br></div><div>▼New Feature: Equipment Sets</div><div>When editing a team, players can register individual equipment sets that determine which weapon, dragon, and wyrmprints an adventurer will equip. Once registered, a set can be applied to a particular adventurer to have them automatically equip the specified loadout.</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/8f383e8d5b25197e21cccb055f34af22.png"></div><div><br></div><div><br></div><div>▼New Feature: Team Copy</div><div>Players can duplicate their team setups and overwrite existing setups with copied ones.</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/dbdac0e14171457b97aef7cba156a7d8.png"></div><div><br></div><div>▼New High-Difficulty Quest: Rise of the Sinister Dominion</div><div>A new series of high-difficulty quests, Rise of the Sinister Dominion, arrives <span class="local_date" data-local_date="1614924000"></span>. In certain difficulties of these quests, the player&#39;s current team will be swapped out mid-battle with another one, so they must prepare two teams of differing elemental attunements beforehand. Drop rewards include wyrmprints that can be equipped in new slots on weapons and the materials required to unbind and add copies of those wyrmprints. Players must complete Chapter 16 / 4-6 (Normal) of the main campaign, Setting Off, in order to play. Further details will be provided in a separate notification.</div><div><br></div><div>▼Updated System: Wyrmprints</div><div>With the addition of the first Rise of the Sinister Dominion quest, arriving <span class="local_date" data-local_date="1614924000"></span>, special slots in weapons, and wyrmprints that can only be equipped in those slots, will become available. Depending on the weapon, up to two of these wyrmprints may be equipped, and the slots for them may be unlocked using materials that drop from Rise of the Sinister Dominion quests. Affinities from these new wyrmprints will count toward affinity bonuses in the same manner as those from existing wyrmprints.</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/59cf82f22584b91579d2aaeb0e06bcfd.png"></div><div><br></div><div>Wyrmprints that may be equipped in these new slots are different from existing wyrmprints in that, in addition to holy water and consecrated water, they can also be upgraded using special items that drop in place of duplicated wyrmprints. These wyrmprints may be unbound and copies may be added with said special items as well as materials that drop from Rise of the Sinister Dominion. However, they may not be unbound with silver keys or golden keys.</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/b16df9dbd6c94b4d560fb873cecb249e.png"></div><div><br></div><div>▼New Mechanic: Overdrive Counter</div><div>A new mechanic, the overdrive counter, will appear in Rise of the Sinister Dominion quests. When (and only when) an enemy in the overdrive state attacks with a red action marker, players can reduce that enemy&#39;s overdrive mode gauge by an amount greater than normal if they use an attack skill to inflict damage (in other words, counter). We plan to include this mechanic in more quests in the future.</div><div><br></div><div><span style="color: rgb(41, 105, 176);"><strong>[Addendum <span class="local_date" data-local_date="1615543800"></span>]</strong></span><br>An overdrive counter is triggered by using an attack skill with the right timing against an enemy attack that can be countered by this mechanic. Enemy attacks that can be countered by this mechanic are indicated with an icon. If an overdrive counter is successfully executed, the text &quot;OVERDRIVE COUNTER&quot; will appear on screen.</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/f7f6a63c40456685888c44dbab8b8282.png"></div><div><br></div><div>■Other Changes</div><div>・The logic that determines how AI-controlled adventurers dodge certain action markers will be adjusted.</div><div>・The dragon Gala Reborn Poseidon&#39;s abilities (Water) Fury of the Seas I and (Water) Fury of the Seas II will be adjusted to also affect enemies with no elemental attunement.</div><div>・The dragon Gala Reborn Zephyr&#39;s abilities (Wind) Wrath of the Plains I and (Wind) Wrath of the Plains II will be adjusted so that they also affect enemies with no elemental attunement.</div><div>・Adventurers wielding rapid-fire manacasters will be able to move while performing their force strike.</div><div>・If auto-play is enabled and both the skill Hound Shot and Ace Operator are available for the adventurer Formal Joachim to use, he will use Ace Operator first and Hound Shot directly afterward.</div><div>・The appearance of certain objects in quests will be adjusted.</div><div>・The user interface will be adjusted in various places.</div><div><br></div><div>■Issues Addressed</div><div>・While playing Tartarus&#39;s Wrath on Standard, Expert, or Master difficulties, when the adventurer Dragonyule Lily performs an upgraded force strike after being granted the Saint Starfall Lily effect, if the team member that is most in need of healing is in a portal zone, their HP may not be restored and their max HP may not be increased.</div><div>・Certain normal endeavors for Advanced Dragon Trials and The Agito Uprising are able to be completed despite their names appearing as &quot;???.&quot;</div><div><br></div><div>Notes:</div><div>1. It may take time for the store to reflect the updated information. Players may not be able to perform updates due to their device&#39;s data cache being full. If you are unable to perform the update, restart your device, and then try downloading it from the store.</div><div>2. Any adventurers and game screenshots shown are still in development.</div><div><br></div><div>Thank you for playing Dragalia Lost.</div>,start_time:1613617200,update_time1615789009