article_id:2025,category_name:News,title_name:This Month in Dragalia Lost,image_path:,message:<div>Hello, everyone! Yuji Okada here, director of Dragalia Lost.</div><div><br></div><div>First off, as always, thank you for playing Dragalia Lost.</div><div><br></div><div>■The Divine Deception Facility Event is Here!</div><div>The Ilian Church of North Grastaea and its members played a central role in the Agents of the Goddess facility event in September of 2020, and Divine Deception, a new facility event featuring even more apostles and angels, is now live.</div><div><br></div><div>Materials earned from Divine Deception may be used to upgrade the event-exclusive cleansing fount facility that boosts damage dealt to enemies in event quests and powers up adventurers that wield daggers or manacasters. Aim to upgrade your cleansing fount to level 30 as soon as you can to reap those benefits!</div><div><br></div><div>I also hope that you enjoy the groovy songs that play during the event!</div><div><br></div><div>Now that Divine Deception has arrived, I&#39;m happy to say that we can finally put names and faces to all five apostles and their angels. In case you need a refresher, Basileus is paired with Michael, Nevin with Ramiel, Pinon with Gabriel, Ryszarda with Raphael, and Faris with Uriel. These five are lead by a commander named Regina who&#39;s paired with Sandalphon. Though they are united in purpose, the relationship that each apostle has with their particular angel varies wildly from trusted companion to caring partner akin to a foster parent.</div><div><br></div><div>The adventurer Ryszarda and dragon Gala Reborn Jeanne are now available to summon in Gala Dragalia.</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/8a61edef06ee4c49919b3bd25629a00a.png"></div><div><br></div><div>The adventurer Faris and dragon Gabriel (the very same Gabriel who is partnered with Pinon, in fact!) will be available to summon in a showcase starting <span class="local_date" data-local_date="1614751200"></span>.</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/6848d496c34b8856fb0ab4baa15dceea.png"></div><div><br></div><div>■Plans for This Month</div><div>・The first set of quests in a new series of high-difficulty content, Rise of the Sinister Dominion, will arrive in mid-March.</div><div><br></div><div>Rise of the Sinister Dominion features bosses that are tied to the apostles and angels who appear in the Divine Deception facility event going on now. Details of these relationships will continue to be fleshed out as the overarching story evolves over time.</div><div><br></div><div>The first set of Rise of the Sinister Dominion quests, Lilith&#39;s Encroaching Shadow, will debut in three difficulties: Standard, Expert, and Master. The demon Lilith will appear in Expert and above. What&#39;s more, Master difficulty features a new mechanic that causes the boss to change their elemental attunement mid-battle. When this occurs, players must adapt to this new threat by changing their team, and therefore must prepare two teams before embarking on the quest.</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/8ebd1aad1456b5d26df87fc777ccd413.png"></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/71202d5bdecd957d635e9c69161c036f.png"></div><div><br></div><div>Players can unlock additional wyrmprint slots in their Agito weapons using materials earned from Rise of the Sinister Dominion quests, increasing the total number of wyrmprints that these weapons can equip from five to seven. However, only special wyrmprints earned from Rise of the Sinister Dominion quests can be equipped in these two additional slots. To upgrade these special wyrmprints, players will need to collect the required materials by playing Rise of the Sinister Dominion quests. It&#39;s clear, then, that playing these quests has many benefits, new weapon slots and wyrmprints included.</div><div><br></div><div>Since the plot of Rise of the Sinister Dominion takes place in North Grastaea, players must complete chapter 16 of the main campaign before they can attempt this challenge. If you&#39;re not that far in the main campaign yet, I encourage you to continue upgrading your team and playing through the story until you are ready to go toe-to-toe with these powerful foes.</div><div><br></div><div>Please note that Lilith&#39;s Encroaching Shadow: Master (which makes use of the new Team Change mechanic) will only be available in solo play upon release, but a co-op play version will be added at a later date. Rise of the Sinister Dominion quests released after Lilith&#39;s Encroaching Shadow will debut with both solo-play and co-op play versions available from the get-go.</div><div><br></div><div>Further details will be provided in an upcoming notification. I hope you&#39;re looking forward to learning more about what awaits you!</div><div><br></div><div>・A new defensive event will be held in mid-March. The story will unfold in the North Grastaean city of Grams and will feature a pair of combat androids from the region. Here&#39;s a sneak peek at one of them, Eirene. Like Laxi, she has a mind of her own despite her android origins.<br><img src="https://dragalialost.akamaized.net/attached/information/images/4a787c85c9799b4343cf51b7a4f2a805.png"><br></div><div><br></div><div>・The Echoes of Antiquity raid event will return in late March. You&#39;ll have the chance to add the adventurer Xuan Zang to your team if you haven&#39;t already.<br><img src="https://dragalialost.akamaized.net/attached/information/images/9129590fea5f2a114ceb83827483f0a5.png"><br></div><div><br></div><div>・Part two of chapter 18 of the main campaign will be released in late March. What awaits the prince and friends in the deepest recesses of the forest of the faeries?<br><br>・Additional events taking place in late March will be revealed in an upcoming Dragalia Digest.<br><br>■Future Updates<br>・Dragalia Lost celebrates another momentous milestone, two-and-a-half years of service, on <span class="local_date" data-local_date="1616824800"></span>. As with previous anniversaries, information on upcoming updates and events will be provided in a Dragalia Digest beforehand. I hope you&#39;re looking forward to seeing what exciting news Notte has to share!<br><br>■In Conclusion<br>Thank you for reading this month&#39;s update. We&#39;re giving all players the following gift this month.<br>・Summon Voucher x5<br>・Exquisite Honey x30<br><br>The next installment of This Month in Dragalia Lost will be posted around <span class="local_date" data-local_date="1617256800"></span>.<br><br>Until then, thanks for reading, and for continuing to play Dragalia Lost!<br><br>Yuji Okada<br>Director, Dragalia Lost<br><br>Notes:<br>・The gift can be claimed from your goodie box for up to seven days after reception. If the gift isn&#39;t retrieved within seven days, it will be lost.<br>・Summon showcase, event, and update content may change without notice.<br>・Any adventurers and game screenshots shown are still in development.</div>,start_time:1614578400,update_time1614648247