article_id:2027,category_name:News,title_name:Dragalia Lost Director Yuji Okada Responds to Player Feedback (from February 21, 2021),image_path:,message:<div>On February 21, 2021, Dragalia Lost director Yuji Okada replied to feedback players sent via the in-game Leave Feedback feature.</div><div><br></div><div>This notification contains the contents of an interview with director Okada that was conducted by Yumi Uchiyama and Ayaka Asai, voice actors for the Japanese-language version of Dragalia Lost.</div><div><br></div><div>Notes:</div><div>・The feedback featured in this notification was chosen from that received between January 1 and January 31.</div><div>・Tap Feedback on the game&#39;s title screen to open the Leave Feedback screen.</div><div>・The content of the interview has been edited for this notification, so wording may differ from the original conversation.</div><div>・The content of the responses is from the time of the interview, so content that is in-development may differ by the time of its release in-game.</div><div><br></div><hr><div>■Responses to Questions That Could Not Be Addressed During the Broadcast Time of the Japanese-Language Caged Desire Livestream on YouTube Live on February 5</div><div>Uchiyama &amp; Asai: Some players believe that the plots of event quests are generally intended to fill in any gaps in understanding that may emerge during the main campaign&#39;s storyline or shine a light on the lesser-known aspects of Dragalia Lost&#39;s lore. Is that indeed the case?</div><div><br></div><div>Okada: There are many aspects of Dragalia Lost&#39;s world that cannot be fully fleshed out in the limited scope of the main campaign alone. For example, there are many important figures and organizations, such as those from Hinomoto, that have only appeared in events thus far. At the same time, regions like North Grastaea and its related characters have been slowly revealed over time in both the main campaign and event stories. By doing so, we can focus on developing certain characters in events first without worrying about derailing the ongoing plot of the main campaign. With that said, if we include too much of a character&#39;s development in a standalone event, then their impact on the main campaign may be lessened, so we must strike a careful balance between these two approaches. It&#39;s worth nothing that the Fractured Futures and Forgotten Truths raid events that ran during the first and second anniversaries have been made available to play in the Event Compendium at any time precisely because their plots are so closely intertwined with that of the main campaign.</div><div><br></div><div><br></div><div>Uchiyama &amp; Asai: Will we ever see the Wagabond Pupper again?</div><div><br></div><div>Okada: Players seemed to really enjoy last year&#39;s April Fools event in which they could play with a puppy that wandered into the Halidom for a single day. To those who have been clamoring for the adorable doggo&#39;s return ever since, I will say this much: this event may return in one form or another this year, so stay tuned!</div><div><br></div><div><br></div><div>■Responses to Feedback from Players</div><div>Uchiyama &amp; Asai: Some players feel that the recently added Morsayati Reckoning quest is just as hard as the Legend-difficulty quests in the Agito Uprising. Since the former drops materials necessary for functional upgrades while the latter only drops materials necessary for cosmetic upgrades, players who are not strong enough to clear this quest are prevented from fully developing their Halidom. Why not make materials necessary for functional upgrades available from other sources as well?</div><div><br></div><div>Okada: This quest was assigned a required might of 40,000 and designed with the expectation that players would level their facilities as high as they possibly could before attempting to undertake it. However, since facility level is not the only factor in determining whether or not a player can clear a quest, we are considering making the materials from this quest available from other quests as well.</div><div><br></div><div><br></div><div>Uchiyama &amp; Asai: In the Alberian Battle Royale, if the match comes down to the final three players and one of them is using the Seimei adventurer skin (and thus has access to his unique skill) while the remaining two are not, the players controlling standard adventurers may form an impromptu alliance against the player controlling Seimei due to the perceived advantage granted by his unique skill. This seems a bit unfavorable for both parties, does it not? If adventurer skins with unique skills continue to appear in the future, players may feel forced to use them over the standard adventurers or gang up on them during the battle, and the balance between weapon types may suffer. Are these skins intended to be only available for a limited time, or do you plan on adding more as time goes on?</div><div><br></div><div>Okada: In a three-way battle, it makes sense for two players to first focus on one in order to increase their own odds of survival. We do not plan to add adventurer skins with unique skills on a frequent basis, but when we do, we endeavor to ensure that their unique skill is not overly powerful. In addition, we are constantly monitoring the usage and win rates of each weapon type and are performing balance adjustments as necessary each month. Our ultimate goal is to allow for the introduction of interesting and unique skills while maintaining a fair balance between weapon types so that all players can enjoy the experience regardless of what adventurer or weapon they choose.</div><div><br></div><div><br></div><div>Uchiyama &amp; Asai: Players are appreciative of the various events that occur from time to time that allow them to focus on upgrading their team, including double drops for Elemental Ruins, Dragon Trials, and the Imperial Onslaught. Materials from these quests, as well as others, such as orichalcum, tend to be in short supply for new players, so why not triple the drop rate and make these in-demand items easier to come by during events?</div><div><br></div><div>Okada: This consideration for new players is admirable. However, we believe that double drops is already quite generous, and we would like to save triple drops for marquee events. I encourage players to check out the event available now that increases drops for certain quests on a daily basis. Orichalcum and certain other materials tend to be scarce early on and only available from higher-difficulty quests, so we&#39;d like to increase access to them by making them available from the Treasure Trade and as event rewards.</div><div><br></div><hr><div>Director Okada will continue to reply to the feedback players send via Leave Feedback again in the future. We&#39;re looking forward to hearing your comments. (The feedback featured in the next notification will be chosen from feedback received between February 1 and February 28.)</div><div><br></div><div>Thank you for playing Dragalia Lost.</div>,start_time:1614837600,update_time1614823402