article_id:2044,category_name:Events,title_name:The Wagabond Pupper Event Is Now Live!,image_path:https://dragalialost.akamaized.net/attached/information/images/12d18ea3289d7ab5b15a67469232045f.png,message:<div>The Wagabond Pupper event returned on <span class="local_date" data-local_date="1617256800"></span>.</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/12d18ea3289d7ab5b15a67469232045f.png"></div><div>This event was live for only one day last year, but now it&#39;s back for good, with some improvements to boot! Now you can invite dragons to join the puppy on walks along with adventurers, and what&#39;s more, you can invite up to four of each at a time.</div><div><br></div><div>■How to Play</div><div>1. Play with the puppy in the Walkies quest!</div><div>You can control the puppy and play with your favorite adventurers and dragons. Tap on the camera icon to pause the action and enter photo mode.</div><div><br></div><div>In photo mode, you can move the camera and zoom in and out to look at the puppy, adventurers, and dragons from different angles and perspectives. Find a scene that you like and take a screenshot to capture the moment! When you&#39;re done, don&#39;t forget to step into the circle of light within the quest to clear it.</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/5193c05ba071b7fc67f438638ba306da.png"></div><div>Although only one adventurer or dragon can interact with the puppy at a time, you can now invite up to four of each along for the ride in the Walkies quest. When you want to change the active adventurer and dragon, tap on the corresponding icon at the bottom of the screen to rotate through the lineup.</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/ff86e4e79567e7327f070d86903619f2.png"></div><div>In photo mode, you can use the on-screen slider to adjust the strength of the newly added bokeh effect to your liking. Tweak this setting until the object that you want to focus on stands out clearly against the blurred background. Tap on the button next to the slider to enable or disable this effect.</div><div><br></div><div>2. Interact with the puppy in the Dragon&#39;s Roost!</div><div>Head to the Dragon&#39;s Roost where you can pet the puppy to become friends. You can also increase your bond with the puppy by feeding it Pup Grub, which you can earn as a reward for clearing the Walkies quest for the first time.</div><div><br></div><div>When your bond with the puppy reaches certain points, the types of balls that you can use to play fetch will increase. The bond that you built with the puppy last year (if any) carries over to this event.</div><div><br></div><div>Note: No changes will occur in the puppy&#39;s voice or movements in the Dragon&#39;s Roost if the Dragon&#39;s Roost Display Preference setting is set to &quot;2D.&quot;</div><div><br></div><div>■Sticker</div><div>You can complete an endeavor to get a puppy sticker as a reward. Feed the puppy Pup Grub via Gifts in the Dragon&#39;s Roost to complete this endeavor. Players who complete this endeavor and already have the sticker will receive 25 wyrmite instead.</div><div><br></div><div>■Event Availability</div><div>Starting <span class="local_date" data-local_date="1617256800"></span></div><div><br></div><div>Notes:</div><div>1. Players must have completed up to Chapter 2 / 2-1 (Normal) of the main campaign to participate in this event.</div><div>2. To play the Walkies quest, tap Quests on the Home screen, then select Wagabond Pupper from Recurring Events.</div><div>3. You cannot feed Pup Grub to dragons.</div><div>4. To check the status of endeavors, tap the Endeavors icon on the Home screen, then select the Normal tab.</div><div><br></div><div>Thank you for playing Dragalia Lost.</div>,start_time:1617256800,update_time1617153623