article_id:2062,category_name:Events,title_name:Legend Difficulty Was Added to Ciella's Wrath!,image_path:https://dragalialost.akamaized.net/attached/information/images/1d5f53de89d3c0fe52db7a93bad92726.png,message:<div>A new Legend difficulty was added to Ciella&#39;s Wrath in The Agito Uprising (high-difficulty quests where you&#39;ll face powerful foes) on <span class="local_date" data-local_date="1616738400"></span>.<br><br>Ciella&#39;s Wrath: Legend may only be undertaken by a team of wind-attuned adventurers and dragons. Clear this quest to earn materials required to further refine wind-attuned 6★ weapons. Once an Agito weapon is refined to its second stage, its appearance will change!</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/1d5f53de89d3c0fe52db7a93bad92726.png"></div><div>The Agito despair before this cruel reality.<br>The Agito despair before putrid deception.<br>The Agito despair before false salvation.<br><br>With a malicious sneer, the wings of contempt thrust those who profess false justice into the depths of misery and anguish. These wings that laugh derisively at such despair have a name, and that name is Ciella.<br><br>■New Agito Series Weapons<br>The ability to refine the powerful wind-attuned 6★ Agito weapons to their second stage was unlocked on <span class="local_date" data-local_date="1616738400"></span>. By refining these weapons to their second stage, you can change their appearance.<br><br>You must have first obtained specific weapons before you can craft weapons using materials obtained from Ciella. The required weapons are the wind-attuned 5★ weapons that can be crafted using materials obtained from the Tempest Chimera in Void Battles.<br><br>The weapon that is required differs based on the weapon type for the weapon you wish to craft. You can check the requirements by selecting Materials for the wind-attuned weapons in the Agito Weapons section of the Weapons/Crafting menu.<br><br>■Facility<br>The maximum level of the Wind Tree facility has been increased to 30.<br><br>■Changes to Survival Bonuses and the Number of Revives<br>Survival bonuses and the number of revives were changed on <span class="local_date" data-local_date="1616738400"></span>. The number of revives in Ciella&#39;s Wrath: Master has been changed to one, and survival bonuses have been added. The number of revives in Ciella&#39;s Wrath: Expert has been increased to two, and the survival bonus content has been changed. The number of revives in Ciella&#39;s Wrath: Standard has been increased to three, and the survival bonus content has been changed.<br><br>Notes:<br>1. Players must have completed Chapter 10 / 6-3 (Normal) of the main campaign and any of the Standard-difficulty Advanced Dragon Trials in solo or co-op play to play The Agito Uprising.<br>2. Players must have completed Ciella&#39;s Wrath: Master in solo or co-op play to play Ciella&#39;s Wrath: Legend in solo play.<br>3. Players must have completed Ciella&#39;s Wrath: Master in solo or co-op play to play Ciella&#39;s Wrath: Legend in co-op play.<br><br>Thank you for playing Dragalia Lost.</div>,start_time:1616738400,update_time1616135580