article_id:2077,category_name:Events,title_name:Co-op Play For Lilith's Encroaching Shadow: Master in Rise of the Sinister Dominion Is Coming Soon!,image_path:https://dragalialost.akamaized.net/attached/information/images/c65da2969ecd9bb40a50b510956ddd09.png,message:<div>Co-op play for Lilith&#39;s Encroaching Shadow: Master in Rise of the Sinister Dominion will be added on <span class="local_date" data-local_date="1617343200"></span>.</div><div><br></div><div>&quot;If you worms think one mere defeat is enough to put me down for good, then you&#39;re in way over your heads.&quot; When the insatiable desire for revenge gushes forth from the abyss between worlds, a hatred doomed to fester for eternity stains white wings black. A girl eats away at the reasoning once espoused by the angelic herald of the Goddess&#39;s will, fanning the flames of a burning darkness. She is Lilith, the avatar of atrocity masked in a veneer of innocence, and she is evil incarnate, driven to consume all existence on instinct alone.</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/c65da2969ecd9bb40a50b510956ddd09.png"></div><div>Required might for Lilith&#39;s Encroaching Shadow: Master (Shadow/Flame): 36,000</div><div><br></div><div>■How to Unlock</div><div>Players must complete Chapter 16 / 4-6 (Normal) of the main campaign in order to play.</div><div><br></div><div>■Team Change</div><div>This quest features a mechanic that causes the boss to change their elemental attunement mid-battle. When this occurs, players must adapt to this new threat by changing their team, and therefore must prepare two teams of predetermined elemental attunements before embarking on the quest. Be sure that both of your teams are equally ready to take on this challenge!</div><div><br></div><div>Note: Quests with the Team Change mechanic do not reward Adventurer EXP.</div><div><br></div><div>Thank you for playing Dragalia Lost.</div><div><br></div>,start_time:1616824800,update_time1616657087