article_id:2108,category_name:News,title_name:This Month in Dragalia Lost,image_path:,message:<div>Hello, everyone! Yuji Okada here, director of Dragalia Lost.</div><div><br></div><div>First off, thank you for playing Dragalia Lost, which is enjoying its two-and-a-half year anniversary thanks to the passion and support of players like you. I&#39;m excited to bring you the latest news on what&#39;s happening in and around the game this month.</div><div><br></div><div>■The Dawn of Dragalia Raid Event is Here!</div><div>What would a half anniversary be without a lore-heavy raid event to go along with it? On the eve of the game&#39;s second year and a half, the Dawn of Dragalia event spins a three-hundred-year-old tale of the legendary hero Alberius. Along the way, he&#39;s joined by allies including Midgardsormr&mdash;this time in human form! You can play through the event to add the adventurer Humanoid Midgardsormr to your roster.</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/58900128e09b7c01a3430efe58d12f3f.png"></div><div><br></div><div>You&#39;ll also meet the adventurer Myriam, who appears alongside Gala Notte, in a Gala Dragalia that&#39;s going on now. Yes, you read that right, Notte has finally become a playable adventurer! She has a unique shapeshift called &quot;metamorphosis&quot; that replaces the dragon gauge, effectively allowing her to fight in two different forms. After playing spectator for so long, this faerie is eager to fight for her friends!</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/cbcc594069991e12c2e6755778b8d306.png"></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/d17c4a0f8e0943e8049a91bd99d1f75a.png"></div><div><br></div><div>■The Wagabond Pupper Event is Back for Good!</div><div>Everyone&#39;s favorite doggo returned to the Halidom on <span class="local_date" data-local_date="1617256800"></span>. This event was live for only a single day last year, but it&#39;s back for good this time with some improvements to boot! Now you can invite dragons on walks alongside adventurers, and what&#39;s more, you can invite up to four of each of your favorites at a time.</div><div><br></div><div>We&#39;ve also added an optional bokeh effect to the photo mode in the Walkies quest. You can use the on-screen slider to adjust its strength to your liking. Use it to spice up your screenshots or emphasize the focus of the image.</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/1e81dabaff64e1abe6d8fc2e414de218.png"></div><div>Players are very rarely given the opportunity to control the camera themselves, so we hope those of you with a passion for sharing your screenshots on social media will have a lot of fun finding the perfect shot to post. In fact, we&#39;re holding a Twitter event to encourage players to do just that, so check the official Dragalia Lost Twitter account for more details and get those digital shutters snapping!</div><div><br></div><div>■Plans for This Month</div><div>・The adventurer Alberius and dragon High Chthonius will be featured in a Prize Showcase starting on <span class="local_date" data-local_date="1617343200"></span>. For further details including their stats, check out the summon showcase notification when it&#39;s posted.</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/8d2f192f5fca59ecfd1e7d0929b6c1bd.png"></div><div><br></div><div>・A new series of quests, Trials of the Mighty, will debut on <span class="local_date" data-local_date="1617775200"></span>. You&#39;ll be challenged with taking on various bosses with a team of one or more predetermined elements and weapon types. Clear these quests to earn rewards from the daily bonus, like materials for unlocking the mana spirals of certain adventurers, nature&#39;s blessings, and fortifying dragonscales.</div><div><br></div><div>If you miss out on earning a daily bonus, you&#39;ll be able to earn them retroactively for up to three days, so don&#39;t fret if you need to miss a day or two of playing. That said, please keep in mind that the reward from each daily bonus depends on the boss who was available to battle on that particular day. Additional bosses will be available in the future and existing bosses will make routine appearances.</div><div><br></div><div>Materials for unlocking mana spirals will be available from the daily bonus in April for certain Gala Dragalia adventurers, and said materials for additional adventurers (including those without a Gala Dragalia version) will be available in the future.</div><div><br></div><div>・An onslaught event will start on <span class="local_date" data-local_date="1618207200"></span>. It looks like this rough rider Ranzal is going back to school...hopefully he doesn&#39;t end up in detention for too long!</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/e6e6bc779230f1f4f21092e53a6c2ed8.png"></div><div><br></div><div>・A Time Attack Challenges event pitting you against shadow-attuned enemies will be held in late April.</div><div><br></div><div>・Part one of chapter 19 of the main campaign will be added in late April. With the way to the Faerie Kingdom unbarred, the mysteries surrounding the prince will continue to unravel in parts one and two of this chapter.</div><div><br></div><div>・As revealed in the latest Dragalia Digest, an event featuring Vania and another adventurer and dragon from the Rage of Bahamut game will be held at the end of April.</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/4e36f9f18c0a545d6153be78b320c3b3.png"></div><div><br></div><div>■Future Updates</div><div>I briefly touched on these points in the latest episode of Dragalia Digest, but allow me to reiterate and expand upon them here.</div><div><br></div><div>・Players will be able to automatically unlock up to a specific mana node or even all five of an adventurer&#39;s mana circles at once. As it stands now, the auto-unlock feature only supports unlocking a single circle at a time and some nodes need to be manually unlocked. With this change we hope that it becomes easier to manage your ever-growing roster of adventurers, and we will continue to work on future updates that improve this functionality.</div><div><br></div><div>・With the increasing number of facilities to build and upgrade, it has become harder and harder over time to manage the sometimes sprawling Halidom. To address this difficulty, we plan to add a single screen from which players can view and upgrade all of their facilities, eliminating the need to hunt down individual facilities from the many spread across the entire castle grounds.</div><div><br></div><div>・Players will be able to see the teams that others have been using to successfully clear certain high-difficulty quests, including those in Advanced Dragon Trials and The Agito Uprising. Check out the combinations of adventurers, dragons, and wyrmprints that other players have found most effective and use these hints to put together a successful team and strategy of your own.</div><div><br></div><div>・We will iterate on the functionality of Notte&#39;s Notes over time. For starters, we plan to add a feature that allows you to easily identify the adventurers whom you&#39;ve used to clear high-difficulty quests as well as a feature that allows you to revisit past story scenes.</div><div><br></div><div>・Main story chapters up to and including chapter 21 will continue to be released in halves each month. As the prince and friends delve deeper and deeper into the Faerie Kingdom, more and more mysteries stand to be revealed. Look forward to seeing new faces and more as the story soldiers on.</div><div><br></div><div>・Those of you who missed the opportunity to recruit Alfonse or Sharena to your roster will be happy to learn that the Fire Emblem: Lost Heroes and Fire Emblem: Kindred Ties events will be made available in the Event Compendium to enjoy at any time in solo play. If you&#39;re interested in other Fire Emblem adventurers, be sure to check the notification board for upcoming information on returning summon showcases.</div><div><br></div><div>■In Conclusion</div><div>Thank you for reading this month&#39;s update and especially for playing the game for some (or all!) of these past two and a half years. We remain hard at work making the game even more fun to play and bringing you fresh content to experience and enjoy. This month, we&#39;re giving all players the following gift.</div><div>・Eldwater &times; 25,000</div><div>・Champion&#39;s Testament &times; 2</div><div><br></div><div>The next installment of This Month in Dragalia Lost will be posted around <span class="local_date" data-local_date="1619848800"></span>. Until then, thanks for reading, and for continuing to play Dragalia Lost!</div><div><br></div><div>Yuji Okada</div><div>Director, Dragalia Lost</div><div><br></div><div>Notes:</div><div>・The gift can be claimed from your goodie box for up to seven days after reception. If the gift isn&#39;t retrieved within seven days, it will be lost.</div><div>・Summon showcase, event, and update content may change without notice.</div><div>・Any adventurers and game screenshots shown are still in development.</div>,start_time:1617256800,update_time1617187103