article_id:2215,category_name:Events,title_name:Legend Difficulty Was Added to Ayaha & Otoha's Wrath!,image_path:https://dragalialost.akamaized.net/attached/information/images/376020094243c846f0eaa1ea092b1021.png,message:<div>A new Legend difficulty was added to Ayaha &amp; Otoha&#39;s Wrath in The Agito Uprising (high-difficulty quests where you&#39;ll face powerful foes) on <span class="local_date" data-local_date="1622181600"></span>.<br><br>Ayaha &amp; Otoha&#39;s Wrath: Legend may only be undertaken by a team of water-attuned adventurers and dragons. Clear this quest to earn materials required to further refine water-attuned 6★ weapons. Once an Agito weapon is refined to its second stage, its appearance will change!</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/376020094243c846f0eaa1ea092b1021.png"></div><div>The twin-girl Agito laugh innocently. The black-haired girl flashes a sneer at the unsightliness before her while the white-haired girl looks down on her insipid foes.<br><br>Their two bodies house a single heart... A heart that has room for little more than shameless cruelty. These two Agito proclaim freedom as they crave and devour entertainment. The merciless twin girls have names, and those names are Ayaha and Otoha.<br><br>■New Agito Series Weapons<br>The ability to refine the powerful water-attuned 6★ Agito weapons to their second stage was unlocked on <span class="local_date" data-local_date="1622181600"></span>. By refining these weapons to their second stage, you can change their appearance.<br><br>You must have first obtained specific weapons before you can craft weapons using materials obtained from Ayaha &amp; Otoha. The required weapons are the water-attuned 5★ weapons that can be crafted using materials obtained from the Tidal Chimera in Void Battles.<br><br>The weapon that is required differs based on the weapon type for the weapon you wish to craft. You can check the requirements by selecting Materials for the water-attuned weapons in the Agito Weapons section of the Weapons/Crafting menu.<br><br>■Facility<br>The maximum level of the Water Tree facility has been increased to 30.<br><br>■Changes to Survival Bonuses and the Number of Revives<br>Survival bonuses and the number of revives were changed on <span class="local_date" data-local_date="1622181600"></span>. The number of revives in Ayaha &amp; Otoha&#39;s Wrath: Master has been changed to one, and survival bonuses have been added. The number of revives in Ayaha &amp; Otoha&#39;s Wrath: Expert has been increased to two, and the survival bonus content has been changed. The number of revives in Ayaha &amp; Otoha&#39;s Wrath: Standard has been increased to three, and the survival bonus content has been changed.<br><br>Notes:<br>1. Players must have completed Chapter 10 / 6-3 (Normal) of the main campaign and any of the Standard-difficulty Advanced Dragon Trials in solo or co-op play to play The Agito Uprising.<br>2. Players must have completed Ayaha &amp; Otoha&#39;s Wrath: Master in solo or co-op play to play Ayaha &amp; Otoha&#39;s Wrath: Legend in solo play.<br>3. Players must have completed Ayaha &amp; Otoha&#39;s Wrath: Master in solo or co-op play to play Ayaha &amp; Otoha&#39;s Wrath: Legend in co-op play.<br><br>Thank you for playing Dragalia Lost.</div>,start_time:1622181600,update_time1621315604