article_id:2381,category_name:Events,title_name:The Raid Battle Lilith's Trial (Flame) Is Now Available in Trials of the Mighty!,image_path:https://dragalialost.akamaized.net/attached/information/images/e3feafd9615f9e914c5a00e4639ba0a9.png,message:<div>The raid battle Lilith&#39;s Trial (Flame) became available in Trials of the Mighty on <span class="local_date" data-local_date="1629266400"></span>.</div><div><br></div><div>In Trials of the Mighty, you&#39;ll be challenged to take on various bosses with a team of one or more predetermined elements and weapon types. Clear these quests to earn rewards like materials for unlocking the mana spirals of certain adventurers (called &quot;convictions&quot; and &quot;devotions&quot; that are unique to each adventurer) from the daily bonus.</div><div><br></div><div>■Raid Events in Trials of the Mighty</div><div>Lilith&#39;s Trial (Flame) is a quest similar to battles from raid events. When playing solo, you will create a team of four adventurers, and when playing co-op, you will combine forces with up to three other players to create a squad of up to 16 adventurers.</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/7027cb54b13de70aa1f48023a1843e13.png"></div><div>Suggested might for Lilith&#39;s Trial (Flame): Standard (Flame): 15,000</div><div>Suggested might for Lilith&#39;s Trial (Flame): Expert (Flame): 20,000</div><div>Suggested might for Lilith&#39;s Trial (Flame): Master (Flame): 38,000</div><div><br></div><div>■Quest Duration</div><div><span class="local_date" data-local_date="1629266400"></span> to <span class="local_date" data-local_date="1629871199"></span></div><div><br></div><div>■Eligible Element and Weapon Types</div><div>Water, All</div><div><br></div><div>■Eligible Convictions and Devotions</div><div>Lea&#39;s</div><div><br></div><hr><div>■Daily Bonus Content</div><div>Materials for unlocking the mana spirals of certain adventurers (called &quot;convictions&quot; and &quot;devotions&quot; that are unique to each adventurer) are available from the daily bonus.</div><div><br></div><div>The daily bonus for Trials of the Mighty differs from the traditional daily bonus in that players may stock multiple unearned bonuses. This stock grows incrementally by one every day at 6:00 AM (up to a maximum of three). When a Trials of the Mighty quest is cleared, players may choose to obtain the reward from the daily bonus so long as one daily bonus is available.</div><div><br></div><div>Daily bonus rewards depend on the quest difficulty and are as follows:</div><div><br></div><div>・Standard: Eligible adventurer&#39;s Conviction &times; 1, Nature&#39;s Blessing &times; 1, Fortifying Dragonscale &times; 2, Amplifying Dragonscale &times; 2</div><div>・Expert: Eligible adventurer&#39;s Conviction &times; 2, eligible adventurer&#39;s Devotion &times; 1, Nature&#39;s Blessing &times; 1, Fortifying Dragonscale &times; 2, Amplifying Dragonscale &times; 2</div><div>・Master: Eligible adventurer&#39;s Conviction &times; 2, eligible adventurer&#39;s Devotion &times; 1, Nature&#39;s Blessing &times; 2, Fortifying Dragonscale &times; 3, Amplifying Dragonscale &times; 3</div><div><br></div><div>The reward from each daily bonus depends on the boss who was defeated when it is earned. For example, if you stock a daily bonus while Thor&#39;s Trial is available, then earn it while Poseidon&#39;s Trial is available, you will earn the rewards from Poseidon&#39;s Trial, not Thor&#39;s Trial.</div><div><br></div><div>■Daily Bonus Chest Colors and Amounts</div><div>The daily bonus chests displayed on the Trials of the Mighty quest selection screen are either blue or gray. You can earn as many daily bonuses in a single day as you have blue chests. One blue chest will turn gray when you earn one daily bonus, and one gray chest will turn blue when you stock one daily bonus.</div><div><br></div><div>For example, if you have one blue chest and two gray chests and clear a quest in Trials of the Mighty, you will earn one daily bonus and the one blue chest will turn gray. You will then have three gray chests. When you have three gray chests, you will not earn a daily bonus from clearing a Trials of the Mighty quest that day. When your stock of daily bonuses grows incrementally by one the next day, one gray chest will turn blue, resulting in you having one blue chest and two gray ones. Supposing that you do not clear a quest in Trials of the Mighty that day, when your stock of daily bonuses increases by one again on the day after that, another gray chest will turn blue, resulting in you having two blue chests and one gray one. In this way, you can have a maximum of three blue chests on any given day.</div><div><br></div><div>Notes:</div><div>1. Players must have completed up to Chapter 10 / 6-3 (Normal) of the main campaign to participate.</div><div>2. During raid battles, you will only recover 1/4 of the amount of HP from certain skills and abilities.</div><div><br></div><div>Thank you for playing Dragalia Lost.</div>,start_time:1629266400,update_time1627272592