article_id:2407,category_name:Events,title_name:Iblis's Surging Cascade Has Arrived in Rise of the Sinister Dominion!,image_path:https://dragalialost.akamaized.net/attached/information/images/7de8d3bd7eea823ae3080dba2dc212f8.png,message:<div>Iblis&#39;s Surging Cascade was added to Rise of the Sinister Dominion on <span class="local_date" data-local_date="1630648800"></span>. Should players manage the titanic task of repelling the demonic menace descending upon North Grastaea, they will be rewarded with the ability to equip new wyrmprints to their weapons!</div><div><br></div><div>How unseemly are the gentled masses of the inferior! The secluded demon chuckles scornfully, contempt and disgust commingling as he thinks of the angels that have been swallowed by the seething herd. The weak are an anchor yoked to the neck of others, and as such ought to remain silent and servile to the strong. And the name of the one who espouses vainglory as principle? Iblis! His is an opportunistic independence, and he cherishes arrogance above all else as he flits gracefully about the dark.</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/7de8d3bd7eea823ae3080dba2dc212f8.png"></div><div><br></div><div>Required might for Iblis&#39;s Surging Cascade: Standard (Water): 22,000</div><div>Required might for Iblis&#39;s Surging Cascade: Expert (Water): 34,000</div><div>Required might for Iblis&#39;s Surging Cascade: Master (Water/Shadow): 36,000</div><div><br></div><div>■How to Unlock</div><div>Players must complete Chapter 16 / 4-6 (Normal) of the main campaign in order to play.</div><div><br></div><div>■New Weapon Slots</div><div>Players can use the materials obtained from clearing the quest Iblis&#39;s Surging Cascade to unlock sixth and seventh wyrmprint slots for their wind-attuned Agito weapons. Only wyrmprints obtained from Rise of the Sinister Dominion quests (including Iblis&#39;s Surging Cascade) may be equipped in a weapon&#39;s sixth or seventh slot.</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/1531fb87faceea3ae3cae48d5440462d.png"></div><div><br></div><div>Materials for unlocking the sixth and seventh wyrmprint slots for Agito weapons of elemental attunements other than light, flame, shadow, and wind will be available from future Rise of the Sinister Dominion quests.</div><div><br></div><div>■New Wyrmprints</div><div>Players can obtain special wyrmprints from clearing Rise of the Sinister Dominion quests.</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/b019b74ec3f4c7f5af66e2dc8baebd78.png"></div><div><br></div><div>These special wyrmprints differ from existing wyrmprints in two ways: they may only be equipped in a weapon&#39;s sixth or seventh slot, and upgrading them requires materials that are earned when a duplicate special wyrmprint drops.</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/d6b502692c76eb0308f206210b53a4f8.png"></div><div><br></div><div>■Team Change Mechanic</div><div>The quest Iblis&#39;s Surging Cascade: Master features a mechanic that causes the boss to change their elemental attunement mid-battle. When this occurs, players must adapt to this new threat by changing their team, and therefore must prepare two teams of predetermined elemental attunements before embarking on the quest. Be sure that both of your teams are equally ready to take on this challenge!</div><div><br></div><div>Note: Quests with the Team Change mechanic do not reward Adventurer EXP.</div><div><br></div><div>■Weekly Bonuses</div><div>Materials, fortifying dragonscales, and amplifying dragonscales may be obtained as weekly bonuses for Iblis&#39;s Surging Cascade quests.</div><div><br></div><div>Thank you for playing Dragalia Lost.</div>,start_time:1630648800,update_time1628574735