article_id:251,category_name:Events,title_name:Stories Added to the Valentine's Confections Story Event!,image_path:,message:<div>Hildegarde&#39;s and Prometheus&#39;s limited-time stories were added to the Valentine&#39;s Confections story event at <span class="local_date" data-local_date="1550642400"></span>!</div><div>Unlocking stories increases the number of items you can trade for in the event&#39;s Treasure Trade menu.</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/ecd7acc9d8da8fae0dce50438c7022c5.png"></div><div>With everyone in the Halidom working themselves into a frenzy over the Valentine&#39;s festivities, it seemed Hildegarde was the only one not getting into the holiday spirit. But then...</div><div><br></div><div>We hope you enjoy these heart-shaped moments!</div><div><br></div><div>■Event Overview</div><div>The Valentine&#39;s Confections story event is a new type of event where you can use event items acquired by clearing main-story quests and various events to unlock special Valentine&#39;s stories. You&#39;ll be able to check out event stories for the various characters.</div><div><br></div><div>■Acquiring Event Items</div><div><span style="color: rgb(209, 72, 65);"><strong>To be able to acquire event items by clearing main-story quests and various events, you must clear Ch. 2 / 2-1 (Normal), The Sylvan Archer and view the main page for the event at least once.</strong></span></div><div>If you have not viewed the main page for the event before, you will not receive event items when clearing main-story quests and various events.</div><div><br>■Rare Enemy Information<br>Have you run into a limited-time rare enemy yet?<br>The Valentine&#39;s event is coming to a close, so here are some hints for clearing the limited-time endeavors!<br><br>The rare enemy Valentine&#39;s Slime is more likely to appear in the Beginner and Standard difficulties of recurring event quests.<br><br>The rare enemy Choco Golem is more likely to appear in the Expert and Master difficulties of recurring event quests.<br><br>Rare enemies may appear in campaign chapters, too!<br><br>If you have yet to encounter a rare enemy, may the above hints guide you in your search.<br><br></div><div>Notes:</div><div>1. Details for the Valentine&#39;s Confections event are available by tapping Help on the event page.</div><div>2. You must clear Ch. 2 / 2-1 (Normal), The Sylvan Archer, to participate in the event.</div><div>3. You must clear Ch. 2 / 2-1 (Normal), The Sylvan Archer, to play co-op.</div><div>4. To check the additional limited-time Daily Endeavors, tap Endeavors on the home page, then check the Limited tab.</div><div>5. You will not be able to use the Ravishing Roses in future events.</div><div>6. The schedule and content may change without warning.</div><div><br></div><div>Thank you for playing Dragalia Lost.</div>,start_time:1550642400,update_time1550641226