article_id:2532,category_name:News,title_name:This Month in Dragalia Lost,image_path:,message:<div>Hello, everyone! Yuji Okada here, director of Dragalia Lost.</div><div><br></div><div>First off, as always, thank you for playing Dragalia Lost. I&#39;m again excited to bring you the latest news on what&#39;s happening in and around the game this month.</div><div><br></div><div>■It&#39;s Time to Celebrate the 3rd Anniversary!</div><div>・Dragalia Lost reached another momentous milestone on September 27: three whole years since the release of the game! On behalf of the entire team, let me express my heartfelt gratitude for the passion and support that you&#39;ve shown us these past three years. Just like last year and the year before that, we&#39;ve prepared a whole host of events to celebrate, and we can&#39;t wait for you to dive in and enjoy the festivities.</div><div><br></div><div>・Zethia forged a pact with Bahamut, a powerful figure who plays a major role in the events of chapter 21 of the main campaign. Now their Gala Dragalia versions are ready and raring to join the fight! Gala Zethia and Gala Bahamut each have some unique mechanics, so be sure to check them out.</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/dbc1f2c775d1f6a87b60c8adaaa6521d.png"></div><div><br></div><div>・As part of the 3rd anniversary celebration, we&#39;re holding a daily free tenfold summon, which allows you to perform a tenfold summon on the applicable summon showcase for free once per day. This will be followed by a free hundredfold summon, during which you can perform one hundred summons on the applicable summon showcase for free&mdash;but only for a single day, so be sure to mark your calendar!</div><div><br></div><div>■Angels and Apostles Assemble in the Faith Forsaken Raid Event!</div><div>・The Faith Forsaken raid event is a two-part spectacular that brings together the angels and apostles who you&#39;ve met over the course of previous events. The story is split into two halves, each with its own series of twists and turns. Those familiar with the plot of the main campaign will be excited to see the mysteries of northern Ilian Church resolved and learn even more about the characters who we&#39;ve come to know and love.</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/9ecbc3e703541ffb6d1e93788a21a94c.png"></div><div><br></div><div>This event is tied to the main campaign in more ways than one&mdash;you&#39;ll be able to recruit the ever-illusive Harle into your roster by reading far enough through the event story. Note that Harle&#39;s Convictions will only be obtainable during the first half of the event, so don&#39;t miss out on them if you&#39;re thinking about upgrading him. He has some secrets of his own just waiting to be revealed. If you think you know Harle, think again...</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/dcebfdb18095a865cea7b3fea187236d.png"></div><div><br></div><div>・This event takes place after chapter 22 of the main campaign, so we&#39;re jumping a bit ahead in the timeline here. The prince and friends will make an appearance in the second half, but to find out what happened to them before that, be sure to play through chapter 22 when it&#39;s released later this year.</div><div><br></div><div>■Plans for This Month</div><div>・The adventurer Regina will be featured in a Prize Showcase starting on <span class="local_date" data-local_date="1633413600"></span>. She makes her debut as leader of the apostles in the Faith Forsaken raid event and is partnered with the angel Sandalphon. For further details, like her stats and skills, please see the corresponding in-game notification.</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/f64cad69707df680d15903c139608c01.png"></div><div><br></div><div>・The second half of the Faith Forsaken raid event begins in mid-October. You&#39;ll be able to go toe-to-toe with a formidable foe that appears in the conclusion of the first half. You&#39;ll fight through your share of familiar quests, but are you ready for a co-op battle in which up to 15 of your fellow players each control a single adventurer? Prepare to have your teamwork tested!</div><div><br></div><div>・Wind Legion&#39;s Trial will be added to Trials of the Mighty in mid-October. Materials for unlocking Wedding Aoi&#39;s mana spiral will be available from the daily bonus.</div><div><br></div><div>・A Time Attack Challenges event pitting you against water-attuned enemies will be held in late October.</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/9fd2bf5a4f6fe9a429d46ac447daf006.png"></div><div><br></div><div>・With the addition of Surtr to Rise of the Sinister Dominion in late October, this series of quests will now feature a boss from each of the five elements. Once all five bosses are available, clear each of their battles on Expert difficulty to unlock an epilogue.</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/92fd059d0a3437e18f9fd814e09226bf.png"></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/849de6f7b74185da398aac1a9c1008e7.png"></div><div><br></div><div>・Part one of chapter 22 of the main campaign will be added on October 31. This is a little later in the month than usual for story chapter releases, but I think it will be worth the wait&mdash;you&#39;ll get to battle a certain powerful dragon.</div><div><br></div><div>■Future Updates</div><div>・Legend difficulty will be added to Rise of the Sinister Dominion. We will also update the Treasure Trade lineup and add epithets accordingly.</div><div><br></div><div>・As announced in the most recent episode of Dragalia Digest, we are hard at work putting the finishing touches on the Enter the Kaleidoscape event set to release by the year&#39;s end. For those who missed the preview, you start off with a single adventurer at level 1 and attempt to delve as deep into the labyrinth as you can without being defeated. The weapons, wyrmprints, and skills you collect from fallen foes will help you survive, but you&#39;ll need your wits most of all. Stay on your toes in this ever-changing adventure, for you never know what dangers are lurking around the corner! Further details will be provided closer to the event&#39;s release.</div><div><br></div><div>■In Conclusion</div><div>Thank you for reading this month&#39;s update. Once again, allow me to express my heartfelt gratitude for your support these past three years. I hope that all of the anniversary events, and the two-part raid event in particular, make this special celebration fun and memorable for you!</div><div><br></div><div>We&#39;re giving all players the following gift this month.</div><div><br></div><div>・Rupie &times; 100,000,000<br>・Sunlight Stone &times; 1</div><div><br></div><div>The next installment of This Month in Dragalia Lost will be posted around <span class="local_date" data-local_date="1635746400"></span>. Until then, thanks for reading and for continuing to play Dragalia Lost!</div><div><br></div><div>Yuji Okada</div><div>Director, Dragalia Lost</div><div><br></div><div>Notes:</div><div>・The gift can be claimed from your goodie box for up to seven days after reception. If the gift isn&#39;t retrieved within seven days, it will be lost.</div><div>・Summon showcase, event, and update content may change without notice.</div><div>・Any adventurers and game screenshots shown are still in development.</div>,start_time:1633068000,update_time1632998946