article_id:2600,category_name:News,title_name:Dragalia Lost Director Yuji Okada Responds to Player Feedback (from October 31, 2021),image_path:,message:<div>On October 31, 2021, Dragalia Lost director Yuji Okada replied to feedback players sent via the in-game Leave Feedback feature.</div><div><br></div><div>This notification contains the contents of an interview with director Okada that was conducted by Yumi Uchiyama and Ayaka Asai, voice actors for the Japanese-language version of Dragalia Lost.</div><div><br></div><div>Notes:</div><div>・The feedback featured in this notification was chosen from that received between September 1 and September 30.</div><div>・Tap Feedback on the game&#39;s title screen to open the Leave Feedback screen.</div><div>・The content of the interview has been edited for this notification, so wording may differ from the original conversation.</div><div>・The content of the responses is from the time of the interview, so content that is in development may differ by the time of its release in-game.</div><div><br></div><hr><div>■Responses to Feedback from Players</div><div>Uchiyama &amp; Asai: Regarding the changes in version 2.12.0, a player wrote in to praise the improvements made to material drop rates as a welcome change for new players in particular, but suggested that the rupie cost to craft these weapons may need to be adjusted as well. This player has now found themselves with plenty of materials but not enough rupies and is now repeating quests in the Agito Uprising on Standard difficulty to earn rupies rather than materials. Perhaps the rate at which players earn rupies should be increased to ensure a healthy balance between material and rupie supplies?</div><div><br></div><div>Okada: Players were able to earn a significant amount of rupies during the recent Faith Forsaken raid event, and we gave every player 100,000,000 rupies as part of the gifts for the October edition of This Month in Dragalia Lost. We plan to provide regular opportunities for players to earn rupies, such as by playing events, so stay tuned.</div><div><br></div><div><br></div><div>Uchiyama &amp; Asai: We&#39;ve received a request to increase the number of skip tickets that players are given. With so many different things to do in game, it seems that many players are noticing their stock of these tickets dwindling dangerously low.</div><div><br></div><div>Okada: We will increase the number of quests that can be skipped using skip tickets and provide more of them each day in a future update.</div><div><br></div><div><br></div><div>Uchiyama &amp; Asai: A player wrote in to express appreciation for the large increase in material drops, but is worried that their stock of said materials will soon be completely full. They already have the maximum amount of mana and crystals, forcing them to painstakingly dismiss the message that appears at the end of every quest informing them that excess items were discarded because their inventory is full. Would you consider increasing the storage cap for these materials or adding an option to disable this message in the settings?</div><div><br></div><div>Okada: We programmed the game to display this message as a way to warn the player that they were no longer earning a particular material, but this and other feedback has helped us realize that not every player may need or want to see it every time they begin a quest with a full inventory. With that said, we will consider ways to alleviate the issue that this player is facing.</div><div><br></div><div><br></div><div>Uchiyama &amp; Asai: With the announcement that certain certain 5★ dragons can be unbound up to five times instead of four, a player decided to stock up on the various draconic essences available from the main campaign. However, they soon realized that moving between chapters and changing difficulties as required for each particular draconic essence was somewhat tedious. Why not add a feature that allows players to select the specific draconic essence they want, then automatically plays through the various quests that offer it?</div><div><br></div><div>Okada: We understand how important it is for players to be able to unbind their eligible 5★ dragons to the fifth stage since doing so helps these dragons become much more powerful and can give players without Gala dragons an easier time with high-difficulty quests. With that in mind, we will consider how to make this process less tedious.</div><div><br></div><hr><div>Director Okada will continue to reply to the feedback players send via Leave Feedback again in the future. We&#39;re looking forward to hearing your comments. (The feedback featured in the next notification will be chosen from feedback received between October 1 and October 31.)</div><div><br></div><div>Thank you for playing Dragalia Lost.</div>,start_time:1636092000,update_time1636007253