article_id:2677,category_name:Updates,title_name:Version Update [Update],image_path:,message:<div><span style="color: rgb(41, 105, 176);"><strong>[Addendum <span class="local_date" data-local_date="1640314800"></span>]</strong></span><br>As a token of our appreciation, the following item has been sent to players who started playing before <span class="local_date" data-local_date="1640314800"></span>.<br><br>・Tenfold Summon Voucher &times; 1<br><br>This gift can be claimed from your goodie box for up to seven days after reception. If the gift isn&#39;t retrieved within seven days, it will be lost.</div><div><br></div><hr><div>Version 2.15.0 will be available for download around <span class="local_date" data-local_date="1640228400"></span>. You may install it when it becomes available; otherwise, an automatic update will occur around <span class="local_date" data-local_date="1640314800"></span>.</div><div><br></div><div>When you update to version 2.15.0 and play co-op, you will no longer be matched with players using earlier versions of the game. Rooms created by players using earlier versions will not display in the Room List, and you will not be able to join them using Find a Room, Join Nearby Players, Enter an ID, or alliance chat.</div><div><br></div><div>To celebrate the update, we&#39;ll be sending all players a Tenfold Summon Voucher after the automatic update. This notice will be updated after it has been distributed.</div><div><br></div><div>Note: The Tenfold Summon Voucher will not be distributed until after the automatic update, even if you complete the update to version 2.15.0 early.</div><div><br></div><div>■Update Details</div><div>▼The Kaleidoscape Makes Its Debut!</div><div>A brand-new way to play, The Kaleidoscape, will be available on <span class="local_date" data-local_date="1640584800"></span>. You begin your journey by selecting a single adventurer from your roster to explore the labyrinth. There&#39;s only one goal: reach the bottom in one piece!</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/bb7c285336146871d1debbcf8d06fefe.png"></div><div><br></div><div>Your adventurer begins at level 1 but will increase in both level and strength as they collect weapons, wyrmprints, and shared skills from treasure chests and defeated enemies. As you progress through the labyrinth, powerful bosses will attempt to stand in your way. Once defeated, they will drop dragons, which you can then collect and shapeshift into.</div><div><br></div><div>When choosing which adventurer and dragons to use, know that stat increases provided by castle facilities and encyclopedia bonuses will have no effect in the Kaleidoscape. Similarly, the HP and strength of your adventurer, as well as the stats of dragons, weapons, and wyrmprints found in the Kaleidoscape, are unique to this mode.</div><div><br></div><div>You can earn portrait wyrmprints by delving deeper and deeper into the labyrinth. What&#39;s more, you can trade any dawn amber or dusk amber that you find along your journey for rewards like materials or weapon skins in the Treasure Trade.</div><div><br></div><div>For further information on the Enter the Kaleidoscape mode and its mechanics, please see the corresponding notification when the mode is released.</div><div><br></div><div>▼Primal Midgardsormr&#39;s Trial Makes Its Debut!</div><div>The first in a new series of high-difficulty quests to succeed Rise of the Sinister Dominion, Primal Midgardsormr&#39;s Trial, will be available on <span class="local_date" data-local_date="1640325600"></span>.</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/36ff0fa8d28249fca00c1e54f792c819.png"></div><div><br></div><div>To play this quest, players must have completed the quest &quot;Setting Off&quot; in the main campaign (Chapter 16 / 4-6) on Normal difficulty and any Advanced Dragon Trial on Master difficulty. Primal Midgardsormr&#39;s Trial will be available in Standard, Expert, and Master difficulties and rewards will include materials for crafting weapons from the new Primal Dragon series.</div><div><br></div><div>For further information on Primal Midgardsormr&#39;s Trial, please see the corresponding notification when the quest is released.</div><div><br></div><div>▼Skip Even More Quests with Tickets!</div><div>Players will be able to use skip tickets to skip the following quests starting on <span class="local_date" data-local_date="1640325600"></span>, and the number of skip tickets awarded by the daily login bonus will be increased to 12.</div><div><br></div><div>Advanced Dragon Trials:</div><div>High Midgardsormr&#39;s Trial: Prelude/Standard/Expert/Master (Solo)</div><div>High Brunhilda&#39;s Trial: Prelude/Standard/Expert/Master (Solo)</div><div>High Mercury&#39;s Trial: Prelude/Standard/Expert/Master (Solo)</div><div>High Jupiter&#39;s Trial: Prelude/Standard/Expert/Master (Solo)</div><div>High Zodiark&#39;s Trial: Prelude/Standard/Expert/Master (Solo)</div><div><br></div><div>The Agito Uprising:</div><div>Volk&#39;s Wrath: Standard/Expert/Master (Solo)</div><div>Kai Yan&#39;s Wrath: Standard/Expert/Master (Solo)</div><div>Ciella&#39;s Wrath: Standard/Expert/Master (Solo)</div><div>Ayaha &amp; Otoha&#39;s Wrath: Standard/Expert/Master (Solo)</div><div>Tartarus&#39;s Wrath: Standard/Expert/Master (Solo)</div><div><br></div><div>Rise of the Sinister Dominion:</div><div>Lilith&#39;s Encroaching Shadow: Standard (Solo)</div><div>Jaldabaoth&#39;s Piercing Gale: Standard (Solo)</div><div>Asura&#39;s Blinding Light: Standard (Solo)</div><div>Iblis&#39;s Surging Cascade: Standard (Solo)</div><div>Surtr&#39;s Devouring Flame: Standard (Solo)</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/150e083d70eb82630d5fd542629a3c61.png"></div><div><br></div><div>▼Stretch Your Stamina Farther with Reduced Costs!</div><div>The stamina cost of the following quests will be reduced on <span class="local_date" data-local_date="1640325600"></span>.</div><div><br></div><div>Please note that this change does not affect the amount of stamina recovered from the 30-Day Pack (Recovery) or from the use of wyrmite or honey, nor does it affect the type, amount, or rate of drop rewards from the affected quests.</div><div><br></div><div>The Agito Uprising:</div><div>Volk&#39;s Wrath: Standard/Expert/Master (Solo)</div><div>Kai Yan&#39;s Wrath: Standard/Expert/Master (Solo)</div><div>Ciella&#39;s Wrath: Standard/Expert/Master (Solo)</div><div>Ayaha &amp; Otoha&#39;s Wrath: Standard/Expert/Master (Solo)</div><div>Tartarus&#39;s Wrath: Standard/Expert/Master (Solo)</div><div><br></div><div>Rise of the Sinister Dominion:</div><div>Lilith&#39;s Encroaching Shadow: Standard (Solo)</div><div>Jaldabaoth&#39;s Piercing Gale: Standard (Solo)</div><div>Asura&#39;s Blinding Light: Standard (Solo)</div><div>Iblis&#39;s Surging Cascade: Standard (Solo)</div><div>Surtr&#39;s Devouring Flame: Standard (Solo)</div><div><br></div><div>▼Trade for More Rewards from Advanced Dragon Trials!</div><div>The number of times you can trade for certain rewards in the Treasure Trade for Advanced Dragon Trials will be increased on <span class="local_date" data-local_date="1640325600"></span>. This change will affect the rewards for High Midgardsormr, High Brunhilda, High Mercury, High Jupiter, and High Zodiark.</div><div><br></div><div>▼Use Suggested Teams to Set Shared Skills and More!</div><div>Suggested Teams, a feature that allows players to browse and copy team loadouts that others have used to successfully clear certain quests, will support the use of shared skills. If you copy a team&#39;s loadout that uses a shared skill you have not unlocked, the default shared skill will be used instead.</div><div><br></div><div>With the addition of the Kaleidoscape, players will also be able to inspect equipped portrait wyrmprints (but not set them). The HP and strength values displayed for portrait wyrmprints may not reflect those of the portrait wyrmprints actually equipped by the indicated team.</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/d4b23cdfc13ebfcc635a1b3b87a89f84.png"></div><div><br></div><div>■Balance Adjustments</div><div>・Butterflies summoned by the adventurer Meene&#39;s standard attacks, force strikes, and dash attacks will no longer disappear when coming into contact with a wall.</div><div><br></div><div>・An AI-controlled Sandalphon will automatically activate her unique shapeshift when the team does not require healing and deactivate it when the team does (allowing her to then heal as necessary).</div><div><br></div><div>・The timing of when Curse of Nihility is applied to adventurers in some of the Rise of the Sinister Dominion and Trials of the Mighty quests will be adjusted on <span class="local_date" data-local_date="1640325600"></span>.</div><div><br></div><div>■Other Changes</div><div>・The following events will be added to the Event Compendium on <span class="local_date" data-local_date="1640325600"></span>.</div><div><br></div><div>Faith Forsaken (Part One)</div><div>Faith Forsaken (Part Two)</div><div>Summertime Saviors</div><div>Twinkling Twilight</div><div><br></div><div>Note: Daily Damage Rewards will not be awarded when Faith Forsaken (Part Two) is played through the Event Compendium.</div><div><br></div><div>・The Alberian Battle Royale will be available every day starting on <span class="local_date" data-local_date="1640325600"></span>.</div><div><br></div><div>・The three comic panels that were selected in the surveys to celebrate the release of issue 400 of Dragalia Life will be implemented as in-game stickers on <span class="local_date" data-local_date="1640930400"></span>.</div><div><br></div><div>・New Year&#39;s voice lines will be available from <span class="local_date" data-local_date="1640930400"></span> to <span class="local_date" data-local_date="1642485599"></span>. To listen to them, tap or press and hold an adventurer on the Adventurers screen or the Edit Team screen, then tap the magnifying glass icon in the bottom right corner of the screen. You will be able to listen to the voice lines on the screen that opens (so long as voices are enabled in the Options menu).</div><div><br></div><div>・Support for upcoming adventurers and quests scheduled to appear in late December through January will be added and certain unresolved issues will be addressed.</div><div><br></div><div>[Addendum <span class="local_date" data-local_date="1641967200"></span>]<br>With the release of the Kaleidoscape on [Operation:Time JST=&quot;&quot;2021/12/27 15:00:00&quot;], additional special slots in weapons, as well as wyrmprints that can only be equipped in those slots, have become available.&nbsp;</div><div><br></div><div>Notes:</div><div>1. It may take time for the store to reflect the updated information. Players may not be able to perform updates due to their device&#39;s data cache being full. If you are unable to perform the update, restart your device, and then try downloading it from the store.</div><div>2. Any adventurers and game screenshots shown are still in development.</div><div><br></div><div>Thank you for playing Dragalia Lost.</div>,start_time:1639623600,update_time1641967610