article_id:2694,category_name:Events,title_name:A New Series of Quests, Primal Dragon Trials, Is Coming Soon! ,image_path:https://dragalialost.akamaized.net/attached/information/images/48835ce6842ceddbdaa3a0996d4d0088.png,message:<div>A new series of high-difficulty quests, Primal Dragon Trials, becomes available on <span class="local_date" data-local_date="1640325600"></span>.&nbsp;</div><div>Challenge the Greatwyrms with their primal might restored and use the rewards to craft and upgrade new 6★ weapons!</div><div>Note: Curse of Nihility will be inflicted at the outset of quests in Primal Dragon Trials.</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/48835ce6842ceddbdaa3a0996d4d0088.png"></div><div><br></div><div>To bring about the true awakening of the woman who traveled a millennium<br>through time, the Windwyrm recovers his primal powers and readies a trial.<br>Can the Wind Auspex overcome this tempest and unlock her true potential?</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/0dcb843a0d8fe3b8164fc50d22232654.png"></div><div>Required might for Primal Midgardsormr&#39;s Trial: Standard (Wind): 22,000</div><div>Required might for Primal Midgardsormr&#39;s Trial: Expert (Wind): 34,000</div><div>Required might for Primal Midgardsormr&#39;s Trial: Master (Wind): 36,000</div><div><br></div><div>■How to Unlock</div><div>Players must complete Chapter 16 / 4-6 (Normal) of the main campaign and any one of the Advanced Dragon Trials on Master difficulty in order to play.</div><div><br></div><div>■New Weapon Series: Primal Dragon Weapons</div><div>Powerful new 6★ Primal Dragon weapons will be added to the Weapons/Crafting screen on <span class="local_date" data-local_date="1640325600"></span>. You can use materials obtained by defeating Primal Midgardsormr to craft wind-attuned weapons with a skill that deals damage, increases the user&#39;s strength, and grants the &quot;Primal Dragalia&quot; effect. Primal Dragalia is not affected by Curse of Nihility (which removes buffs and nullifies their effects).</div><div><br></div><div>You must have first obtained specific weapons before you can craft weapons using materials obtained from Primal Midgardsormr. The required weapons are the wind-attuned 5★ weapons that can be crafted using materials obtained from High Midgardsormr in Advanced Dragon Trials. The weapon that is required differs based on the weapon type for the weapon you wish to craft.</div><div><br></div><div>Thank you for playing Dragalia Lost.</div><div><br></div>,start_time:1639980000,update_time1648544513