article_id:2697,category_name:Events,title_name:A Limited-Time Event Revival, A Sweeping Retrospective, Is Now Live!,image_path:https://dragalialost.akamaized.net/attached/information/images/94df26266ed1c2a5fed58efdae01e510.png,message:<div>A limited-time event revival, A Sweeping Retrospective, started on <span class="local_date" data-local_date="1640325600"></span>.</div><div><br></div><div>During the A Sweeping Retrospective revival event, you can play the event-exclusive quests to get drop rewards and complete endeavors. Help Cleo with a major cleanup and see how all the residents of the Halidom are spending their time as this year draws to a close!</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/94df26266ed1c2a5fed58efdae01e510.png"></div><div><br></div><div>It&#39;s the end of the year and Cleo is leading the charge to give the Halidom a much needed deep clean, but something is amiss and groups of fiends are appearing in the castle! Help your allies and wipe the floor with the intruding fiends!</div><div><br></div><div>■Event Duration</div><div><span class="local_date" data-local_date="1640325600"></span> to <span class="local_date" data-local_date="1640930399"></span></div><div><br></div><div>■Quests</div><div>A Sweeping Retrospective comprises the following three quests.</div><div><br></div><div>・Treasure Slime Clean-Up</div><div>Battle the advancing treasure slimes in this quest to obtain flame orbs, refulgence orbs, and other upgrade materials. We recommend this quest for players who want to unbind mana circle nodes.</div><div><br></div><div>A story will unlock when you clear this quest. After reading the unlocked story, the Fafnir Clean-Up quest will unlock.</div><div><br></div><div>・Fafnir Clean-Up</div><div>Battle the fafnirs that are running around in this quest to get upgrade materials used for powering up adventurers, weapons, dragons, and wyrmprints. We recommend this quest for players who want to upgrade their adventurers and wyrmprints.</div><div><br></div><div>A story will unlock when you clear this quest. After reading the unlocked story, the Gold Slime Clean-Up quest will unlock.</div><div><br></div><div>・Gold Slime Clean-Up</div><div>Battle the advancing gold slimes in this quest to obtain rupies. We recommend this quest for players who want to get rupies.</div><div><br></div><div>A story will unlock when you clear this quest.</div><div><br></div><div>■Endeavors</div><div>In the A Sweeping Retrospective event, there are endeavors you can complete by clearing event-exclusive quests and collecting items. The endeavor rewards include epithets, stickers, materials, and lucky letters!</div><div><br></div><div><a href="https://dragalialost.com/en/news/detail/30003">See here for information about lucky letters.</a></div><div><br></div><div>Note: Ripe Dragonfruit, Succulent Dragonfruit, Blessed Water, and Consecrated Water will not be counted toward the completion of these endeavors.</div><div><br></div><div>Notes:</div><div>1. Players must have completed up to Chapter 2 / 2-1 (Normal) of the main campaign to participate.</div><div>2. Players must have completed up to Chapter 2 / 2-1 (Normal) of the main campaign to play co-op.</div><div>3. There will not be a period after the A Sweeping Retrospective event has ended when you can still read the story.</div><div><br></div><div>Thank you for playing Dragalia Lost.</div>,start_time:1640325600,update_time1640326234