article_id:273,category_name:Events,title_name:A New Raid Event, A Waltz with Fate, Is Now Live!,image_path:,message:<div>Up to four players with four adventurers each (up to 16 adventurers in total!) can battle together in the A Waltz with Fate raid event, which began <span class="local_date" data-local_date="1551333600"></span>. Take on event-specific quests to defeat the shadow-attuned raid boss and earn rewards!</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/14adc2203ce489311024346f4da92963.png"></div><div>After being imprisoned by a ruler with twisted affections, the dancer Felicia is rescued by the dragon Phantom. During their escape they find the prince and his friends, who resolve to help them fight the king of death himself... Thus begins a tale of love for the ages!</div><div><br></div><div>A new adventurer, Felicia, will join you during this event. Increase your friendship with her to officially add her to your roster. You can also collect blazons and emblems to get the dragon Phantom and the wyrmprint Delightful Dancer.</div><div><br></div><div>Here are some of the additions you can expect to see in the A Waltz with Fate raid event:</div><div><br></div><div><strong>■Additions</strong></div><div>・Regarding the Raid Boss&#39; Skills<br>Thanatos&#39; &quot;Grim Haze&quot; attack sets a timer on one of your squad members.<br>When the timer reaches 0, the affected adventurer will suffer drawbacks such as decreasing HP or having their dragon form ended.<br>Thanatos&#39; &quot;Reaper of Fate&quot; skill also has similar effects, so beware!</div><div><br></div><div>・Bonus endeavor</div><div>If you fulfill certain conditions, you can unlock a new daily endeavor that tasks you with clearing all daily event endeavors. If you clear all of an event&#39;s daily endeavors, you&#39;ll receive an endeavor bonus reward!</div><div><br></div><div>・Updated emblem rewards</div><div>Many items used to upgrade your light-attuned adventurers, including the event adventurer Felicia, can be obtained via bronze and silver emblems. Insignias and tablets typically rewarded from The Imperial Onslaught can be obtained via gold emblems.</div><div><br></div><div>Use emblems obtained from each raid battle quest to upgrade your light-attuned adventurers!</div><div><br></div><div><strong>■Regarding an Issue with iPhone 6 Plus Devices</strong><br>We have confirmed that the &quot;A Waltz with Fate&quot; event may not play correctly on iPhone 6 Plus devices depending on the game&#39;s settings.<br>Changing the graphic settings in the options menu may make the event playable on these devices.<br>Affected users should try either of the following methods:<br>・Tap the Menu button in the bottom right corner, then go to the Game tab of the Options menu, and change the Visual Effects settings to Good or Basic.<br>・Tap the Menu button in the bottom right corner, then go to the Game tab of the Options menu, and change the Image Quality settings to Normal.</div><div><br></div><div><strong>■Event Duration</strong></div><div><span class="local_date" data-local_date="1551333600"></span> to <span class="local_date" data-local_date="1552370399"></span></div><div>・If the event ends while you are in a quest, the quest will continue until the results have been determined. You will be able to earn rewards according to the results of the quest.</div><div><br></div><div><strong>■Reward Availability Period</strong></div><div><span class="local_date" data-local_date="1551333600"></span> to <span class="local_date" data-local_date="1552975199"></span></div><div>・You will be able to perform blazon summons and obtain emblem rewards during this period.</div><div><br></div><div><strong>■Temporary Adventurers</strong></div><div>When you complete quests, you will increase the friendship with any temporary adventurers in your team. If you maximize your friendship with a temporary adventurer, they will permanently remain in your collection, allowing you to include them in your team after the event ends. Their level, stats, equipment, and position in your team and collection will be maintained.</div><div><br></div><div>Note: Even if an event adventurer isn&#39;t permanently added to your collection, any items used to upgrade their level, unlock their mana circle, and promote them will not be returned.</div><div><br></div><div><strong>■Raid Battles</strong></div><div>Raid battles are multiplayer co-op battles where up to four teams (16 adventurers) can cooperate against a raid boss together! There are three difficulty levels available: Beginner, Standard, and Expert.</div><div>To participate in a raid battle, you must either create a room as the host or join a room as a guest.</div><div><br></div><div>・As a Host:</div><div>Creating a room requires otherworld fragments and getherwings.</div><div>You can obtain otherworld fragments from boss battles.</div><div><br></div><div>・As a Guest:</div><div>Joining a room requires otherworld fragments and getherwings.</div><div>You must have unlocked the respective difficulty to participate in a raid battle.</div><div><br></div><div><strong>■Extra Raid Battles</strong></div><div>There is a chance that an Extra Raid Battle will appear for players who clear raid battles on Expert.</div><div>The quest will disappear again upon completion.</div><div>The quest will reappear when the conditions are met again.</div><div><br></div><div>・As a Host:</div><div>No getherwings or otherworld fragments are required.</div><div><br></div><div>・As a Guest:</div><div>No getherwings or otherworld fragments are required.</div><div>You can only participate in the Extra Raid Battle when it has appeared for you. It will disappear upon completion, regardless of whether you cleared it as a host or as a guest.</div><div><br></div><div><strong>■Blazon Summons</strong></div><div>Complete boss battles and raid battles to obtain peregrine blazons. Blazons collected can be used for blazon summoning to get event-specific 5★ dragons, 4★ wyrmprints, and other rewards.</div><div>After obtaining the dragon Phantom through summoning, you can reset the contents available.</div><div>From the 5th reset onwards, you must accept all rewards before you can reset the contents available.</div><div><br></div><div><strong>■Emblems</strong></div><div>You can obtain rewards such as items and event-specific wyrmprints based on the total number of emblems you gather during the event.</div><div><br></div><div><strong>■Event Battles</strong></div><div>Two types of event battles will be available during the event: Daily and Limited.</div><div><br></div><div>Notes:</div><div>1. During raid battles, you will only recover 1/4 of the amount of HP from certain skills and abilities.</div><div>2. Players must have completed up to Chapter 2 / 2-1 (Normal) of the main campaign to participate in event quests.</div><div>3. Players must have completed up to Chapter 2 / 2-1 (Normal) of the main campaign in order to play co-op.</div><div>4. If you do not maximize your friendship with temporary adventurers during the event, they will not join you after the event ends, regardless of their level or stats.</div><div>5. If a temporary adventurer joins you after the event ends, you will be able to read their Adventurer Story.</div><div>6. You will not be able to use blazons, emblems, or otherworld fragments obtained in this event in future events.</div><div>7. For details concerning this raid event, check the Help section on the raid event&rsquo;s top page in the game.</div><div><br></div><div>Thank you for playing Dragalia Lost!</div>,start_time:1551333600,update_time1551324485