article_id:2786,category_name:Events,title_name:A New Invasion Event, The Blood That Binds, Is Now Live![Update],image_path:https://dragalialost.akamaized.net/attached/information/images/d09c7e92bd273c5fed8630d893457dad.png,message:<div>The Blood That Binds invasion event started on <span class="local_date" data-local_date="1643608800"></span>.<br><br>During this limited-time event, defeat as many enemies as possible before time runs out to earn points. You&#39;ll be rewarded for your effort with wyrmprints, weapon skins, and more, so be sure to check it out!</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/d09c7e92bd273c5fed8630d893457dad.png"></div><div><br></div><div>■Event Overview<br>By clearing various event quests, you can earn rewards like wyrmprints and materials. You must face a huge number of enemies during invasion quests, and that number only increases as time goes on. Defeat as many as you can to put a stop to these menacing fiends!<br><br>■Event Duration<br><span class="local_date" data-local_date="1643608800"></span> to <span class="local_date" data-local_date="1644818399"></span><br><br>■Reward Availability Period<br><span class="local_date" data-local_date="1643608800"></span> to <span class="local_date" data-local_date="1645423199"></span><br><br>■Rewards<br>You can earn the following wyrmprints and weapon skins as heroism rewards and Treasure Trade rewards.<br><br>・Wyrmprints<br>5★ A Royal Tea Party<br>4★ BFFs!<br>4★ The Nobles&#39; Day Off<br><br>・Weapon skin<br>Conviction Striker (Axe)<br><br>■Heroism Rewards<br>You can earn various rewards by collecting heroism from invasion quests during this event.<br><br>■Treasure Trade Rewards<br>You can earn guardian&#39;s shields and guardian&#39;s swords by playing event quests and trade them for various rewards on the Treasure Trade menu.<br><br>■Co-op (Quick Play)<br>Invasion quests on Standard and Expert difficulty feature a special co-op system that does not require players to create rooms to play together. Simply choose your desired difficulty and team and you will be automatically matched with other players.<br><br>■Invasion Quests</div><div><span style="color: rgb(41, 105, 176);"><strong>[Addendum <span class="local_date" data-local_date="1643623200"></span>]</strong></span><br>There was an issue in the part of this notice concerning the special characteristic of certain enemies in the &quot;■Invasion Quests&quot; section, which has been corrected as follows.<br><br>[Before correction]<br>This time, they&#39;ll be more resistant to close-range attacks.<br><br>[After correction]<br>This time, they&#39;ll be more resistant to long-range attacks.<br><br>Thank you for playing Dragalia Lost.<br><br>These quests can be played in either solo play or co-op play, and the focus is on defeating as many enemies as possible within the allotted time. You&#39;ll have to use skills and shapeshifting to stand fast against the ever-increasing tide of enemies, but also note that some enemies have special characteristics. This time, they&#39;ll be more resistant to long-range attacks.<br><br>These quests don&#39;t have any defeat conditions and the amount of rewards you receive depends on the number of enemies you defeat, so focus on taking down as many enemies as you can as quickly as you can!<br><br>These quests will unlock as you progress through the event. Master difficulty will unlock on <span class="local_date" data-local_date="1643954400"></span>.<br><br>■Trials<br>Trials are very difficult quests that can be played in either solo play or co-op play and do not reward heroism. These quests will unlock as you progress through the event. Master difficulty will unlock on <span class="local_date" data-local_date="1643954400"></span>.<br><br>■Reward Quests<br>Obtain enigmatic vouchers from daily endeavors and use them to take on solo-play-exclusive quests that feature only enemies who reward a large number of points when defeated.<br><br>■Endeavors<br>These endeavors can only be attempted for the duration of the event. They are separated into Daily and Limited variations and can be completed to earn various rewards.<br><br>■Notes<br>1. You can see more details about this event by tapping Help on the event page.<br>2. Players must have completed up to Chapter 2 / 2-1 (Normal) of the main campaign to participate in event quests.<br>3. Players must have completed up to Chapter 2 / 2-1 (Normal) of the main campaign to play co-op.<br>4. If the event ends while you are playing an event quest, the quest will continue until results have been determined, and you will be able to gain the rewards shown.<br><br>Thank you for playing Dragalia Lost.</div>,start_time:1643608800,update_time1643623844