article_id:2909,category_name:Events,title_name:A Raid Event Revival, New Year's Tidings: Fortune from Afar, Is Now Live!,image_path:https://dragalialost.akamaized.net/attached/information/images/31790c9453ccbeb3ffd79cf78bcfcad5.png,message:<div>Up to four players with four adventurers each (up to 16 adventurers in total!) can battle together in the New Year&#39;s Tidings: Fortune from Afar raid event revival, which started on <span class="local_date" data-local_date="1663653600"></span>. Take on event-specific quests to defeat the light-attuned raid boss and earn rewards!</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/31790c9453ccbeb3ffd79cf78bcfcad5.png"></div><div>An adventurer, Botan, will join you during this event. Increase your friendship with her to permanently add her to your roster. You can also collect blazons and emblems to get the dragon Shishimai.<br><br>■Event Duration<br><span class="local_date" data-local_date="1663653600"></span> to <span class="local_date" data-local_date="1664517599"></span><br>・If the event ends while you are in a quest, the quest will continue until the results have been determined. You will be able to earn rewards according to the results of the quest.<br><br>■Reward Availability Period<br><span class="local_date" data-local_date="1663653600"></span> to <span class="local_date" data-local_date="1665122399"></span><br>・You will be able to perform blazon summons and obtain emblem rewards during this period.<br><br>■Epilogue<br>The epilogue for this event will unlock on <span class="local_date" data-local_date="1664517600"></span>.<br>Note: To view the epilogue, you must complete episode 8 of the event story.<br><br>■Epilogue Availability<br><span class="local_date" data-local_date="1664517600"></span> to <span class="local_date" data-local_date="1665122399"></span><br><br>■Temporary Adventurers<br>When you complete quests, you will increase the friendship with any temporary adventurers in your team.<br><br>If you maximize your friendship with a temporary adventurer, they will permanently remain in your collection, allowing you to include them in your team after the event ends. Their level, stats, equipment, and position in your team and collection will be maintained. Even if an event adventurer isn&#39;t permanently added to your collection, any items used to upgrade their level, unlock their mana circles, and promote them will not be returned.<br><br>There are no event adventurer upgrade items or event perks for the adventurer Botan.<br><br>■If Botan Previously Joined as a Temporary Adventurer<br>You can include Botan in your team again when this event starts, and she will maintain the same level and stats as when this event was held previously.<br><br>■Raid Battles<br>Raid battles are co-op battles where up to four teams (up to 16 adventurers in total) can cooperate against a raid boss together! To participate in a raid battle, you must either create a room as the host or join a room as a guest.<br><br>・As a Host:<br>Creating a room requires otherworld fragments and getherwings. You can obtain otherworld fragments from boss battles.<br><br>・As a Guest:<br>Joining a room requires otherworld fragments and getherwings. You must have unlocked the respective difficulty to participate in a raid battle.<br><br>■Extra Raid Battles<br>To challenge the Extra Raid Battle, you must clear the raid battle on Expert.<br><br>・As a Host:<br>Creating a room requires an otherworld gem. You can obtain otherworld gems from the Expert- and Nightmare-difficulty raid battles.<br><br>・As a Guest:<br>Joining a room requires an otherworld gem. You must have cleared the Expert difficulty to participate in a raid battle.<br><br>■Omega Difficulty<br>This raid event revival does not feature Omega difficulty.<br><br>■Blazon Summons<br>Complete boss battles and raid battles to obtain peregrine blazons. Blazons collected can be used for blazon summoning to get event-specific 5★ dragons and other rewards.<br><br>After obtaining the dragon Shishimai, you can reset the contents available. From the 5th reset onward, you must accept all rewards before you can reset the contents available.<br><br>■Emblems<br>You can obtain various rewards based on the total number of emblems you gather during the event.<br><br>■Event Endeavors<br>Two types of event endeavors will be available during the event: Daily and Limited.<br><br>Notes:<br>1. During raid battles, you will only recover 1/4 of the amount of HP from certain skills and abilities.<br>2. Players must have completed up to Chapter 2 / 2-1 (Normal) of the main campaign to participate in event quests.<br>3. Players must have completed up to Chapter 2 / 2-1 (Normal) of the main campaign to play co-op.<br>4. If you do not maximize your friendship with temporary adventurers during the event, they will not join you after the event ends, regardless of their level or stats.<br>5. If a temporary adventurer joins you after the event ends, you will be able to read their Adventurer Story.<br>6. You will not be able to use blazons, emblems, otherworld gems, or otherworld fragments obtained in this event in future events.<br>7. For details concerning this raid event, check the Help section on the raid event&rsquo;s top page in the game.<br><br>Thank you for playing Dragalia Lost.</div>,start_time:1663653600,update_time1646190392