article_id:2914,category_name:Updates,title_name:Regarding Balance Adjustments to the Kaleidoscape,image_path:,message:<div>The following balance adjustments have been made to the Kaleidoscape in an update on <span class="local_date" data-local_date="1646373600"></span> to make the mode more accessible and enjoyable.</div><div><br></div><div>■Adventurers</div><div>・When skipping to floor 30, your adventurer&#39;s starting level will be increased. (This change will not apply when skipping to floors other than 30.)</div><div><br></div><div>■Fafnir Abilities</div><div>The percentage gain from upgrading these abilities beyond level 10 will be increased.</div><div><br></div><div>The following abilities will increase by 1.5% instead of 0.5% each level:</div><div>・HP Boost</div><div>・Strength Boost</div><div>・Skill Damage Boost</div><div>・Thaumian Res, Physian Res, Demihuman Res, Therion Res, Undead Res, Demon Res, Dragon Res</div><div>・Dawn Amber Intake Boost</div><div>・EXP Boost</div><div><br></div><div>The following abilities will increase by 1% instead of 0.5% each level:</div><div>・Critical Rate Boost</div><div>・Critical Damage Boost</div><div>・Force Strike Boost</div><div>・Recovery Boost</div><div>・Dusk Amber Intake Boost</div><div><br></div><div>■Enemies</div><div>・Certain enemies will have their level reduced.</div><div>・Certain enemies will have their HP reduced.</div><div>・Many enemies will have their strength reduced.</div><div>・The interval between the enemy&#39;s healing skills will be increased.</div><div><br></div><div>■Bosses</div><div>・All bosses will have their HP reduced.</div><div>・All bosses will have their strength reduced.</div><div>・The interval between Harle&#39;s attacks will be increased.</div><div>・Harle&#39;s attack Raven&#39;s Gale will take longer to activate.</div><div>・The Freezing Ice attacks used by the Pincers family of bosses will pursue the player for less time.</div><div><br></div><div>If these adjustments are made while you are playing the Kaleidoscape, they will not be applied to your run until you suspend and resume your progress (excluding updated enemy levels, which will be applied when you advance to the next floor).</div><div><br></div><div>Thank you for playing Dragalia Lost.</div>,start_time:1646373600,update_time1646374302