article_id:2974,category_name:Events,title_name:A Raid Event Revival, Rage of Chronos, Is Now Live!,image_path:https://dragalialost.akamaized.net/attached/information/images/914d52cff9aa24b7693f9181e642fbc5.png,message:<div>Up to four players with four adventurers each (up to 16 adventurers in total!) can battle together in the Rage of Chronos raid event revival, which began on <span class="local_date" data-local_date="1669010400"></span>. Take on event-specific quests to defeat the raid boss with no elemental attunement and earn rewards!</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/914d52cff9aa24b7693f9181e642fbc5.png"></div><div>This event&#39;s theme song is &quot;Sample Answer&quot; by Megumi Ogata.<br><br>■Event Duration<br><span class="local_date" data-local_date="1669010400"></span> to <span class="local_date" data-local_date="1669701599"></span><br>Note: If the event ends while you are in a quest, the quest will continue until the results have been determined. You will be able to earn rewards according to the results of the quest.<br><br>■Reward Availability Period<br><span class="local_date" data-local_date="1669010400"></span> to <span class="local_date" data-local_date="1669701599"></span><br>Note: You will be able to perform blazon summons and obtain emblem rewards during this period.<br><br>■Epilogue<br>The epilogue for this event will unlock on <span class="local_date" data-local_date="1669701600"></span>.<br>Note: To view the epilogue, you must complete episode 6 of the event story.<br><br>■Epilogue Availability<br><span class="local_date" data-local_date="1669701600"></span> to <span class="local_date" data-local_date="1669787999"></span><br><br>■Event Perks<br>While this event is active, certain adventurers will have special abilities that activate in quests for this event. See Event Perks on the main event screen in-game for more information.<br><br>■Raid Battles<br>Raid battles are co-op battles where up to four teams (up to 16 adventurers) can cooperate against a raid boss together! To participate in a raid battle, you must either create a room as the host or join a room as a guest.<br><br>・As a Host:<br>Creating a room requires otherworld fragments and getherwings. You can obtain otherworld fragments from boss battles.<br><br>・As a Guest:<br>Joining a room requires otherworld fragments and getherwings. You must have unlocked the respective difficulty to participate in a raid battle.<br><br>■Extra Raid Battles<br>This event does not include Extra Raid Battles.<br><br>■Roar of the Mad Cyclone<br>To challenge this solo-play-exclusive quest, you must unlock it by clearing the raid battle on Expert difficulty. Playing this quest requires cyclone bindings instead of stamina. You can obtain cyclone bindings from endeavors and the Grand Bounty. Clear this quest to earn a large amount of various emblems and peregrine blazons.<br><br>■Omega Difficulty<br>To challenge Omega difficulty, you must clear the raid battle on Nightmare difficulty and complete episode 6 of the event story. Additionally, to unlock Omega difficulty, you must collect three omega keys. You can obtain one omega key from each type of emblem rewards: bronze emblems, silver emblems, and gold emblems.<br><br>・Omega Level 1 (Solo)<br>This quest is for solo play only. It will unlock when you clear the raid battle on Nightmare difficulty and complete episode 6 of the event story.<br><br>・Omega Level 1 (Raid)<br>This quest is for co-op play only and will unlock when you clear Omega Level 1 (Solo).<br><br>・Omega Level 2 (Solo)<br>This quest is for solo play only and will unlock when you clear Omega Level 1 (Raid).<br><br>・Omega Level 2 (Raid)<br>This quest is for co-op play only and will unlock when you clear Omega Level 2 (Solo).<br><br>・Omega Level 3 (Solo)<br>This quest is for solo play only and will unlock when you clear Omega Level 2 (Raid).<br><br>・Omega Level 3 (Raid)<br>This quest is for co-op play only and will unlock when you clear Omega Level 3 (Solo).<br><br>Omega (Raid) availability:<br><span class="local_date" data-local_date="1669701600"></span> to <span class="local_date" data-local_date="1669787999"></span><br><br>■Raid Boosts<br>When you clear raid battles, you&#39;ll be able to get raid boosts, which power up adventurers for this event only.<br><br>Raid boosts you obtain will stack and only apply to your team. The maximum effects you can achieve with raid boosts are described below.<br>・Damage +100%<br>・HP +50%<br>・Shapeshift Prep +25%<br>・Dragon Time +50%<br><br>The number of raid boosts you can obtain by clearing a single quest varies depending on the difficulty. There are also special rare raid boosts. In this event, you will not be able to obtain rare raid boosts from boss battles.<br><br>Raid battle co-op rooms will display each team&#39;s boosted might, which factors in the increased power from raid boosts. Boosted might does not affect the might required to start a quest.<br><br>■Blazon Summons<br>Complete boss battles and raid battles to obtain peregrine blazons. Blazons collected can be used for blazon summoning to get orichalcum and other rewards.<br><br>After obtaining orichalcum, you can reset the contents available. From the fifth reset onward, you must accept all rewards before you can reset the contents available.<br><br>■Emblems<br>You can obtain various rewards based on the total number of emblems you gather during the event.<br><br>■Event Endeavors<br>Two types of event endeavors will be available during the event: Daily and Limited.<br><br>Notes:<br>1. During raid battles, you will only recover 1/4 of the amount of HP from certain skills and abilities.<br>2. Players must have completed up to Chapter 2 / 2-1 (Normal) of the main campaign to participate in event quests.<br>3. Players must have completed up to Chapter 2 / 2-1 (Normal) of the main campaign to play co-op.<br>4. You will not be able to use blazons, emblems, otherworld gems, or otherworld fragments obtained in this event in future events.<br>5. For details concerning this raid event, check the Help section on the raid event&#39;s top page in the game.<br><br>Thank you for playing Dragalia Lost.</div>,start_time:1669010400,update_time1664520097