article_id:431,category_name:News,title_name:Dragalia Lost Official Twitter Account Follow and Retweet Campaign to Support Beginners, Now Live! [Update],image_path:,message:<div>There will be a Dragalia Lost Official Twitter Account Follow and Retweet Campaign to Support Beginners to celebrate the start of the Fire Emblem: Lost Heroes event!</div><div><br></div><div>To make it easier for players starting the game because of this event to progress, we will be giving out upgrade items based on the number of players who retweet the specified tweet.</div><div><br></div><div>Additionally, those who follow either the official Japanese Dragalia Lost Twitter account (@dragalialost) or the official English Dragalia Lost Twitter account (@DragaliaLostApp) and retweet the specified tweet from the account they followed could be randomly selected to receive one of each of the 5★ dragons that appeared in the game before 7:59 PM PT on 04/25/2019.</div><div><br></div><div>Upgrading Alfonse, the 5★ adventurer who joins you in this event, will make it easier to progress, so please use these upgrade items and enjoy the event!</div><div><br></div><div><span style="color: rgb(41, 105, 176);"><strong>[Updated at <span class="local_date" data-local_date="1556420400"></span>]</strong></span><br>Thanks to your support, we have exceeded 10,000 retweets, so we&#39;ve sent all players who started playing the game before <span class="local_date" data-local_date="1559314799"></span> 100 of each of the following upgrade items:</div><div><br></div><div>・Gold crystals</div><div>・Succulent dragonfruit</div><div>・Gold whetstones</div><div>・Consecrated water</div><div><br></div><div>For players who log in before <span class="local_date" data-local_date="1559314799"></span>, this gift can be claimed from your goodie box for up to 7 days after logging in.</div><div><br></div><div><span style="color: rgb(41, 105, 176);"><strong>[Updated at <span class="local_date" data-local_date="1556593200"></span>]</strong></span></div><div>Thanks to your support, we have exceeded 40,000 retweets, which is more than our goal for this campaign, so we&#39;ve sent all players who started playing the game before <span class="local_date" data-local_date="1559314799"></span> an additional 100 of each of the following upgrade items.</div><div><br></div><div>・Gold crystals</div><div>・Succulent dragonfruit</div><div>・Gold whetstones</div><div>・Consecrated water</div><div><br></div><div>For players who log in before <span class="local_date" data-local_date="1559314799"></span>, this gift can be claimed from your goodie box for up to 7 days after logging in.</div><div><br></div><div><span style="color: rgb(41, 105, 176);"><strong>[Updated at <span class="local_date" data-local_date="1557198000"></span>]</strong></span><br>On or around May 15, the official Dragalia Lost Twitter accounts will notify the 12 randomly selected winners of the retweet campaign via direct message about how to accept their prizes!</div><div><br></div><div>Thank you for playing Dragalia Lost.</div><div><br></div><hr><div>OFFICIAL RULES<br><br>General Participation Terms and Data Privacy Policy for Dragalia Lost Contest on Twitter</div><div><br></div><div>GENERAL PARTICIPATION TERMS FOR DRAGALIA LOST CONTEST ON TWITTER</div><div><br></div><div>1. These General Participation Terms for the Dragalia Lost Contest on Twitter (&quot;Participation Terms&quot;) apply to the Dragalia Lost Contest (&ldquo;Contest&rdquo;) held on the Dragalia Lost official Twitter Account of Nintendo Co., Ltd. (&ldquo;Nintendo&rdquo;) that is aimed at consumers in United States, Japan, Taiwan, Hong Kong, Macau, Australia, Canada (excluding Quebec), Singapore, New Zealand, United Kingdom and Ireland.<br><br>2. All individuals who are at least 13 years old at the time of entry and have their permanent residence in the United States, Japan, Taiwan, Hong Kong, Macau, Australia, Canada (excluding Quebec), Singapore, New Zealand, the United Kingdom or Ireland are eligible to participate. Participants under the age of majority in the country where they live must have the consent of their legal guardians to participate. Legal representatives and employees of Nintendo, affiliated undertakings and undertakings commissioned by Nintendo for the execution of the Contest, and parties affiliated with them (e.g., persons with whom each are domiciled and immediate family members) may not participate.<br><br>3. NO PURCHASE NECESSARY. Participation and chances of winning do not depend on the purchase of a Nintendo product in any way. Participants need a Twitter profile and must have access to the game &quot;Dragalia Lost&quot; for iOS or Android. Each person may participate only once. The deadline for participation is stated in the Contest announcement.<br><br>4. To enter, during the Contest entry period (&ldquo;Entry Period&rdquo;), participants must follow one of Nintendo&#39;s Dragalia Lost official Twitter Accounts - @DragaliaLostApp (English) or @dragalialost (Japanese) - and must retweet a post as described in the relevant Contest announcement on the Dragalia Lost official Twitter Account. The retweet must be a public one. The Entry Period is from 20:00 on April 25, 2019 Pacific Time (3:00 April 26, 2019 UTC) to 7:59 on May 6, 2019 Pacific Time (14:59 May 6, 2019 UTC).<br><br>5. Individuals whose Twitter profiles meet one of the following criteria will not be eligible to win a prize:<br><br>a.The settings of the participant&rsquo;s profile do not allow sending the participant direct messages;<br>b.The participant&rsquo;s retweet to enter the Contest was non-public;<br>c.The participant&rsquo;s account unfollows the Dragalia Lost official Twitter Account before the end of the campaign;<br>d.The profile violates Twitter rules or these Participation Terms; or<br>e.The participant uses multiple Twitter accounts to enter the Contest.<br><br>6. The number of winners will be stated in the Contest announcement. On or about May 10, 2019, the winners will be chosen randomly from among all the participants and notified by Nintendo via a Twitter direct message on or about May 15, 2019. The winners will be asked for their Dragalia Lost ID which will be used to provide the prize to the winners in Dragalia Lost. To receive a prize, the winner must follow the instructions contained within the Twitter direct message and provide Nintendo with the requested information within the time-period indicated in the direct message. &nbsp;<br><br>7. As prizes, 12 chosen winners will receive all 5-Star-Dragons currently available in Dragalia Lost as of 19:59 on April 25, 2019 Pacific Time (2:59 April 26, 2019 UTC). The winners will be informed via direct message how they can choose and obtain the Dragon of their choice and about potential time restrictions that might apply in this regard.<br><br>8. In correlation with the number of retweets, an additional reward is distributed to all users of Dragalia Lost whose game account was created before the end of the Entry Period. The users will be distributed 100 Gold Crystals for reaching 3,000 retweets, 100 Gold Crystals and 100 Succulent Dragonfruit &nbsp;for reaching 5,000 retweets, 100 Gold Crystals, 100 Succulent Dragonfruit and 100 Gold Whetstones for reaching 8,000 retweets,or 100 Gold Crystals, 100 Succulent Dragonfruit, 100 Gold Whetstones and 100 Consecrated Water for reaching 10,000 retweets.<br><br>9. Participation by means other than those described in these Participation Terms is not permitted. Legal recourse is excluded.<br><br>10. Odds of winning a prize depend on number of eligible entries received. Prizes are non-transferable. Winnings will not be paid out in cash. Winners are not entitled to have the prize paid out in kind or to exchange the prize for a different item. Nintendo reserves the right to give the winner an alternative prize of equivalent or higher value if an advertised prize is not available for any reason. All prizes are awarded &quot;AS IS&quot; and WITHOUT WARRANTY OF ANY KIND, express or implied, except those that cannot be excluded by law. All federal, state, provincial and local taxes associated with the receipt or use of any prize are the sole responsibility of the winner.<br><br>11. Participants who cheat, manipulate, or exploit bugs in any way in relation to their participation will be excluded from the Contest by Nintendo.<br><br>12. Nintendo reserves the right to discontinue, interrupt, suspend, postpone, or modify in a manner that is reasonable for the participants part or all of the Contest without prior notice if unforeseen circumstances beyond Nintendo&#39;s control occur that prevent the planned execution of the Contest. Liability to participants, winners, or third parties in this regard is excluded.<br><br>13. If we fail to comply with these Participation Terms, Nintendo is liable for damages arising as a foreseeable result of our negligence or breach of the Participation Terms. Nintendo is not responsible for any loss or damage that is not foreseeable. Loss or damage are foreseeable if they were an obvious consequence of Nintendo&rsquo;s breach or if they were contemplated by the participant and Nintendo at the time the participant agreed to these Participation Terms. As participation in the Contest shall occur on a non-commercial basis only, Nintendo is also not responsible for any loss of profit, loss of business, business interruption, loss of data or loss of business opportunity.<br><br>Nintendo does not in any way exclude or limit Nintendo&rsquo;s liability for: intent or gross negligence; death or personal injury; fraud or fraudulent misrepresentation; and product liability.<br><br>14. These Participation Terms are governed by the laws of Japan, to the exclusion of the UN Sales Convention on Contracts for the International Sale of Goods. For the avoidance of doubts, this does not affect the applicability of mandatory statutory laws of the participant&rsquo;s country of residence such as consumer protection laws. To the extent required by law, US residents may request a copy of the winners list or these Participation Terms by sending a written request with a self-addressed, business-size return envelope to: Attn: Dragalia Lost Contest on Twitter, Nintendo of America Inc., 4600 150th Ave NE, Redmond, WA 98052, USA.<br><br>15. The participants consent to the Participation Terms by participating in the Contest. The organizer and sponsor of the Contest is Nintendo Co., Ltd., 11-1 Hokotate-cho, Kamitoba, Minami-ku, Kyoto, 601-8501, Japan; email: support@dragalialost.com.</div><div><br></div><div><br>DATA PRIVACY POLICY FOR NINTENDO DRAGALIA LOST CONTEST ON TWITTER</div><div><br></div><div>This Data Privacy Policy applies to participation in the Dragalia Lost Contest (the &ldquo;Contest&rdquo;) of Nintendo Co., Ltd., 11-1 Hokotate-cho, Kamitoba, Minami-ku, Kyoto, 601-8501, Japan, email: support@dragalialost.com (&quot;Nintendo,&quot; &quot;we,&quot; or &quot;us&quot;) held on the official Dragalia Lost Twitter Account and to the collection and processing of personal data of the Contest participants by Nintendo as the organizer of such Contest.</div><div><br></div><div>With regard to participants located in the United States, information collected from the participants will be subject to Nintendo privacy policy located at https://www.nintendo.com/privacy-policy. &nbsp;</div><div><br></div><div>With regard to participants located in Canada, information collected from the participants will be subject to Nintendo privacy policy located at https://www.nintendo.com/en_CA/.</div><div><br></div><div>With regard to participants located in a country of the European Union, Nintendo is the controller as defined by the General Data Protection Regulation (Regulation (EU) 2016/679; &quot;GDPR&quot;) of the personal data that Nintendo, as the organizer of the Contest, collects from participants located in a country of the European Union and that Nintendo processes. Please note that Twitter processes its users&#39; data in accordance with its data privacy policy and uses it for its own business purposes. Nintendo has no influence and no control over data processing by Twitter.</div><div><br></div><div>1. What personal data we collect and process and for what processing purposes<br><br>a. For you to participate in the Contest, it is necessary for us to collect your user name on Twitter that you use for your Contest retweet. If you win, we need your Dragalia Lost ID. This data is collected and processed to organize and hold the Contest and to provide the prizes.</div><div><br></div><div>If you are located in a country of the European Union, the legal basis for processing under this Clause 1.a) is the holding and execution of the Contest (Art. 6 (1) (b) GDPR).</div><div><br></div><div>b. If you send an email or another message to Nintendo, Nintendo uses these messages to process your questions and respond to your concerns.</div><div><br></div><div>If you are located in a country of the European Union, the legal basis for this processing is the provision of the services you requested (Art. 6 (1) (b) GDPR).</div><div><br></div><div>2. Disclosure of your personal data to third parties</div><div><br></div><div>In accordance with the applicable data privacy regulations, Nintendo may disclose your personal data to external processors who act on behalf of Nintendo and render services in relation to the Contest.</div><div><br></div><div>If you are located in a country of the European Union and if the registered office of these processors is located outside the European Union or the European Economic Area, then either it is located in third countries for which an adequacy decision of the European Commission exists or an adequate level of protection is guaranteed by the standard data protection clauses issued by the European Commission that were agreed on by Nintendo and the external processor.</div><div><br></div><div>3. Duration of storage<br>Nintendo stores your personal data only as long as needed to achieve the goals of the Contest, or &ndash; if statutory retention periods longer than this exist &ndash; for the duration of retention stipulated by law. After this, your personal data is deleted.</div><div><br></div><div>4. Your rights under GDPR<br>If you are located in a country of the European Union, you may have the following rights under GDPR:</div><div><br></div><div>&bull; Right to access: You have the right to request information at any time about whether Nintendo is processing your personal data and, if so, what this personal data is. To exercise this right, you can contact us at any time using the contact information provided in Clause 5 of this Data Privacy Policy.<br><br>&bull; Right to rectification of your personal data: If Nintendo processes your personal data, Nintendo will endeavor to use suitable measures to ensure that your personal data is correct and up-to-date for the purposes for which it was collected. If your personal data is incorrect or incomplete, you can request rectification of this personal data. To exercise this right, you can contact us at any time using the contact information provided in Clause 5 of this Data Privacy Policy.<br><br>&bull; Right to deletion or restriction of processing: You may have the right to request the deletion of your personal data or to restrict processing of your personal data. To exercise this right, you can contact us at any time using the contact information provided in Clause 5 of this Data Privacy Policy.<br><br>&bull; Right to data portability: You may have the right to receive the personal data related to you that you have provided to Nintendo in a structured, commonly used, and machine-readable format or to transmit this personal data to another controller. To exercise this right, you can contact us at any time using the contact information provided in Clause 5 of this Data Privacy Policy.<br><br>&bull; Right to lodge a complaint with a supervisory authority: You have the right to lodge a complaint with a supervisory authority within the European Union.</div><div><br></div><div>5. Nintendo&rsquo;s European representative and contact and Nintendo&rsquo;s data protection officer<br><br>a. If you have any questions about this Privacy Policy and Nintendo&rsquo;s data processing activities or &ndash; in case you are located in a country of the European Union &ndash; if you want to exercise any of your rights under GDPR, please contact: &nbsp;Nintendo&rsquo;s European representative Nintendo of Europe GmbH, Attn.: Legal Department, Herriotstrasse 4, 60528 Frankfurt am Main, Germany, or via email at privacyinquiry.ncl@nintendo.de.<br><br>b. Nintendo&rsquo;s Data Protection Officer:<br>Nintendo Co., Ltd., Attn.: Data Protection Officer, 11-1 Hokotate-cho, Kamitoba, Minami-ku, Kyoto, 601-8501, Japan, dataprotectionofficer@nintendo.co.jp</div>,start_time:1556247600,update_time1557198239