article_id:445,category_name:News,title_name:What's Ahead for Dragalia Lost, Part 4,image_path:,message:<div>Hello, everyone!</div><div><br></div><div>Matsuura here, director of Dragalia Lost.</div><div><br></div><div>Before we dive into part four of What&#39;s Ahead for Dragalia Lost, I&#39;d like to say thank you to everyone who&#39;s been playing the game! Today I&#39;ll be sharing information on some in-game events as well as some information about future updates.</div><div><br></div><div><br></div><div><strong>■Event Information</strong></div><div><br></div><div>Are you all enjoying the Fire Emblem: Lost Heroes event? It&#39;s live right now!</div><div>Defensive battles were implemented for this event, so we want to get feedback from everyone playing so we can touch up this event type in some way for the future.</div><div><br></div><div>The update that went live a short while back added and fixed a variety of elements. We&#39;re continuing to make adjustments in all areas of the game, from fundamental elements like the way summoning works, to elements related to how the game&#39;s action flows--like being able to damage enemies that have fallen over.</div><div><br></div><div>If you haven&#39;t read through the update details yet, be sure to check them out! And of course, we&#39;ll continue to improve and add various features to make a better experience for you all.</div><div><br></div><div><a href="https://dragalialost.com/en/news/detail/434">Version Update</a></div><div><br></div><div>A summon showcase featuring a new adventurer will be available <span class="local_date" data-local_date="1557813600"></span>.</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/dfb75967f42e6e6b6d1bbb2e30f95f83.png"></div><div><br></div><div>The 3★ adventurer Zardin has donned some new attire and is here as a 5★ adventurer! We tinkered with his skill effects a little, too, so I hope you enjoy playing with him.</div><div><br></div><div>Aside from the characters that appear in the main campaign, the supporting cast of summonable characters have a lot of hidden facets and, let&#39;s say...foibles? Quirks? Well, suffice it to say there are a lot of interesting characters hanging around! And we want a wide variety of them to appear anew in the future.</div><div><br></div><div>Additionally, starting the same day, <span class="local_date" data-local_date="1557813600"></span>, the Resplendent Refrain raid event will be returning.</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/86a7a59da45d7760dfe77febff813977.png"></div><div><br></div><div>We want those of you who started playing recently to be able to enjoy past events, so we&#39;ll be reviving past events in the future. We&#39;ll also revive facility events, so don&#39;t worry too much if you missed a facility!</div><div><br></div><div>But that&#39;s not the last thing happening on that same day... On <span class="local_date" data-local_date="1557813600"></span>, we will add Prelude difficulty to High Brunhilda&#39;s Trial!</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/cfb90037496c1d0cbd726974b45a5758.png"></div><div><br></div><div>Some new void enemies will be added <span class="local_date" data-local_date="1558332000"></span>. You have three new void enemies to look forward to. These are Amber Golem (light), Gust Shroom (wind), and Violet Ghost (shadow).</div><div><br></div><div>Next, a new raid event, Echoes of Antiquity, will start at the end of May. It&#39;s been some time since there was a raid boss, and this time you&#39;ll be fighting Qitian Dasheng (wind). The event&#39;s reward adventurer will be Xuan Zang (flame), so I hope you&rsquo;re looking forward to it!</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/0c365d0cde1254f6bd830f8a2c2fa2b5.png"></div><div><br></div><div>From here on, I&#39;ll be talking about the slightly more distant future, starting with the water-attuned Void Poseidon we&#39;re planning to add mid-June.</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/c52fa74c033f52cb09e11fefc6a81d62.png"></div><div><br></div><div>He&rsquo;s a formidable foe who wields both the freeze affliction and a new enemy ability. You&rsquo;ll be able to create weapons for High Mercury, so I hope you&rsquo;re looking forward to it.</div><div><br></div><div>Next, I&rsquo;d like to introduce a new type of content: The Mercurial Gauntlet.</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/115cecefb42e37756f6deda273578a6f.png"></div><div><br></div><div>This will be a recurring event. It will pit you against Fafnir Roy III--a pretty easy-going dragon, so don&#39;t expect to need too many in-depth tactics. All you need to worry about is attacking, and winning before you&#39;re defeated yourself!</div><div><br></div><div>If you&#39;re victorious, you&rsquo;ll be able to challenge the next level. You&#39;ll get rewards monthly based on your progress. It&#39;s a simple way to test your team&#39;s strength, so if you have a little trouble keeping up with the action of the more intense battles, you&#39;ll hopefully enjoy this content.</div><div><br></div><div>We plan on implementing this mid-June, so try to prepare a team of each element before then.</div><div><br></div><div><br></div><div><strong>■Update Information</strong></div><div><br></div><div>There are five points I&#39;d like to share regarding the next update.</div><div><br></div><div>1. Clear-time display</div><div><br></div><div>The quest results screen will display your clear time. We hope that players will use this to compare their clear times when they beat powerful enemies like those in Advanced Dragon Trials. In terms of gameplay, we&#39;re also hoping to use this feature in endeavor conditions.</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/922f1f4c117d77aab12e8902d5f5ec3f.png"></div><div><br></div><div>2. Matching with nearby players</div><div><br></div><div>When playing co-op, it will be possible to match with nearby players using GPS functionality. This will let you enjoy co-op without entering an ID, making it a bit easier to play with those around you.</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/48753e4d724b062c8239ea245b8af55b.png"></div><div><br></div><div>3. Crafting-feature improvements</div><div><br></div><div>In crafting, we&#39;ll implement a feature that lets you directly craft weapons of 2nd tier or higher. Up until now, crafting has required a lot of operational steps, but this will make it possible to do all that crafting at once as long as you have the necessary materials.</div><div><br></div><div>At the time of implementation, you will not be able to use weapons you already have as materials, nor will it be possible to enhance weapons directly.</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/a8d21371a7f0e3d309665116bd71e38b.png"></div><div><br></div><div>4. Dragon&#39;s Roost gift-giving feature improvements</div><div><br></div><div>We&#39;ll be improving the gift-giving feature in the Dragon&#39;s Roost by making it possible to select multiple gifts at once (not counting four-leaf clovers).</div><div><br></div><div>5. Adventurer AI adjustments</div><div><br></div><div>In a recent update we made it so that the AI attacks more actively, such as by using Force Strike. In the next update, the AI will move in response to enemy markers.</div><div><br></div><div>These five updates are all planned for the end of May, so you&#39;ll have to wait just a little longer. We&#39;re also planning on adding additional adventurer upgrade elements at the end of June, so I hope you look forward to that!</div><div><br></div><div>So, what did you think about What&#39;s Ahead for Dragalia Lost, Part 4?</div><div><br></div><div>We strive to provide a fun gameplay experience you&#39;ll be excited to play every day.</div><div><br></div><div>As always, thanks for playing Dragalia Lost!</div><div><br></div><div>Hiroki Matsuura</div><div>Director, Dragalia Lost</div><div><br></div><div>Notes:</div><div>・Summon showcase, event, and update content may change without notice.</div><div>・Any adventurers and game screenshots shown are still in development.</div>,start_time:1557208800,update_time1557293273