article_id:565,category_name:News,title_name:Greetings From the Director of Dragalia Lost,image_path:,message:<div>We would like to announce that Cygames has invited Yuji Okada from BlazeGames to take the reins of director for Dragalia Lost from Hiroki Matsuura.</div><div><br></div><div>They had these messages to share:</div><div>------------------------</div><div>Hello, everyone! This is Matsuura, director of Dragalia Lost.</div><div><br></div><div>As of now, I&#39;ll be handing the title of director over to Mr. Okada.</div><div><br></div><div>I&#39;ve been responsible for Dragalia Lost from planning up through development, and then through its first 10 months after release. It&#39;s thanks to all of you who play the game that we&#39;ve come as far as we have. I am deeply grateful to all of you for playing.</div><div><br></div><div>It is a bit sad to be leaving the project, but Mr. Okada has a wealth of experience developing and managing games&mdash;including social games. He assisted in the final stages of development for Dragalia Lost, so I have no worries about leaving this game in his hands.</div><div><br></div><div>I believe that Mr. Okada&#39;s fresh perspective will allow him to expand the game, both in terms of story as well as game systems. I&#39;m as excited as anyone to see where he takes it!</div><div><br></div><div>Dragalia Lost is only going to keep getting bigger, so I hope you&#39;ll continue to support the game.</div><div><br></div><div>Hiroki Matsuura</div><div>------------------------</div><div>Hello! I&#39;m Yuji Okada from BlazeGames, and Cygames has invited me to take over as director for Dragalia Lost. I&#39;ve been involved with the game since before its release, but now I&#39;ll be taking the reins from Mr. Matsuura.</div><div><br></div><div>I want to continue creating for and managing it in a way that brings even more joy to you, the players, so I hope for your continued support.</div><div><br></div><div>My first What&#39;s Ahead for Dragalia Lost will be posted for you all to read soon, so be sure to check it out!</div><div><br></div><div>Yuji Okada</div><div>------------------------</div>,start_time:1562220000,update_time1562209650