article_id:616,category_name:Events,title_name:Astral Raids Are Coming Soon!,image_path:https://dragalialost.akamaized.net/attached/information/images/011f0d1be28deb9ad8be621a29e7529a.png,message:<div>Astral Raids will arrive in Event Quests starting <span class="local_date" data-local_date="1564207200"></span>!</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/011f0d1be28deb9ad8be621a29e7529a.png"></div><div>The Astral.</div><div>It is the culmination of countless memories amassed from the corners of the world.</div><div>It is the recollection of past ruin on the constant brink of reemergence.</div><div>It is the calamities that descended the world in bygone days.</div><div>It is a call to cleanse a world scourged by the flames of catastrophe!</div><div><br></div><div>See below for more information on Astral Raids.</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/a83939cc3dd1b922718ba8b30aff73ed.png"></div><div>■Featured Boss</div><div>Valfarre</div><div><br></div><div>■Astral Raids Overview</div><div>・Astral Raids are event quests where you can fight against past raid bosses, but they are only available on the weekends.</div><div>・To challenge Astral Raids quests, you will need to use Astral Pieces.</div><div><br></div><div>■Astral Pieces</div><div>・Astral Pieces can be obtained by clearing main campaign quests and event quests.</div><div>・You will not receive Astral Pieces for clearing The Mercurial Gauntlet quests.</div><div>・You will not receive Astral Pieces for clearing quests while astral raids are active.</div><div>・The maximum number of Astral Pieces you can hold is 300.</div><div>・If you obtain Astral Pieces after reaching the limit, those Astral Pieces will be lost.</div><div><br></div><div>Notes:</div><div>1. Players must have completed up to Chapter 2 / 2-1 (Normal) of the main campaign to participate in Astral Raids.</div><div>2. Players must have completed up to Chapter 2 / 2-1 (Normal) of the main campaign in order to play co-op.</div><div><br></div><div>Thank you for playing Dragalia Lost.</div>,start_time:1563775200,update_time1569486800