article_id:851,category_name:News,title_name:Regarding an Issue Where the Dragon Cerberus's Skill Infernal Damnation Stacks,image_path:,message:<div>We have confirmed an issue where the debuff effects applied to the enemy stack and exceed the intended value when multiple players use the dragon Cerberus&#39;s skill Infernal Damnation at the same time in co-op.</div><div>We plan to fix this issue in a future update.</div><div><br></div><div>This issue has greatly impacted the difficulty for completing quests, namely High Midgardsormr&#39;s Trial, and the resulting clear times. We have determined that this issue has had a widespread effect on the results of the time attack rankings period for High Midgardsormr&#39;s Trial between <span class="local_date" data-local_date="1570773600"></span> and <span class="local_date" data-local_date="1571983199"></span>, and will consequently be handling the time attack rankings rewards for High Midgardsormr&#39;s Trial as described below.</div><div><br></div><div>■Rewards for High Midgardsormr&#39;s Trial Time Attack Rankings</div><div>1. Epithet</div><div>We will distribute the epithet based on the Overall Placement.</div><div>2. Items</div><div>All players who cleared High Midgardsormr&#39;s Trial: Expert between <span class="local_date" data-local_date="1570773600"></span> and <span class="local_date" data-local_date="1571983199"></span> will receive the Top 25 placement reward, which is described below.</div><div><br></div><div>・Wyrmite x1,200</div><div>・Champion&#39;s Testament x3</div><div>・Sunlight Stone x1</div><div>・Damascus Ingot x2</div><div>・Golden Key x2</div><div>・Eldwater x100,000</div><div><br></div><div>Ordinarily, clear times where issues occurred would be excluded from the rankings, but we have decided to take this action because we were unable to fix this issue during the time attack rankings period and it was extremely difficult to clearly determine whether this issue occurred during the clears in the rankings.</div><div>Note: Time attack rankings rewards will be distributed for High Brunhilda&#39;s Trial, High Mercury&#39;s Trial, High Jupiter&#39;s Trial, and High Zodiark&#39;s Trial as intended based on overall placement.</div><div><br></div><div>Additionally, to thank you for your patience, we will be giving the following gift to all players who cleared High Midgardsormr&#39;s Trial: Expert between <span class="local_date" data-local_date="1570773600"></span> and <span class="local_date" data-local_date="1571983199"></span>.</div><div><br></div><div>・Wyrmite x1,200</div><div><br></div><div>Thank you for playing Dragalia Lost.</div>,start_time:1572242400,update_time1572231834