article_id:853,category_name:Events,title_name:Story Event, Stirring Shadows, Is Now Live!,image_path:https://dragalialost.akamaized.net/attached/information/images/0b5ed54ea39c7dcfb17733024ae3d4ab.png,message:<div>A new story event, Stirring Shadows, went live at <span class="local_date" data-local_date="1572501600"></span>. And so we&#39;d like to say...</div><div><br></div><div>The Stirring Shadows story includes content that expands on the story told in The Accursed Archives facility event.</div><div><span style="color: rgb(226, 80, 65);">To get the most out of Stirring Shadows, we strongly encourage you to play The Accursed Archives facility event, which will be active at the same time, first.</span></div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/0b5ed54ea39c7dcfb17733024ae3d4ab.png"></div><div>When a little girl mysteriously vanishes, the search leads her would-be saviors to The Immortal Village, a place where eternity ensnares all who reside there. Encounters with the strange dragon and priestess who rule over the village cast the pursuit deeper into chaos and confusion. In a village imprisoned by worship and obsession, who really holds the truth?</div><div><br></div><div>■Event Overview</div><div>In the Stirring Shadows story event, you can use event items acquired by clearing quests from the main campaign and various event quests to unlock special stories.</div><div><br></div><div>■Acquiring Event Items</div><div>For the duration of the event, you can acquire the event items, occult vestments, by clearing quests from the main campaign and various event quests.</div><div><br></div><div>■Event Duration</div><div><span class="local_date" data-local_date="1572501600"></span> to <span class="local_date" data-local_date="1573624799"></span></div><div><br></div><div>■Reward Availability Period</div><div><span class="local_date" data-local_date="1572501600"></span> to <span class="local_date" data-local_date="1574229599"></span></div><div><br></div><div>■How to Play</div><div>1. Collect occult vestments!</div><div>You can obtain the event item, occult vestments, from main campaign quests and various event quests during the event.</div><div>Note: You will not receive occult vestments from clearing The Mercurial Gauntlet quests.</div><div>The number of occult vestments you can obtain differs between quests. The more stamina a quest expends, the more occult vestments you will get.</div><div><br></div><div>2. Unlock event stories!</div><div>Use the occult vestments you collected to unlock event stories.&nbsp;</div><div><br></div><div>3. Get event-specific Treasure Trade rewards!</div><div>You can trade the occult vestments event items for various items.</div><div>The Treasure Trade on the event page also contains special stickers, twinkling sand, champion&#39;s testaments, damascus ingot, and other items that unlock when you complete event stories.</div><div>Collect lots of occult vestments during the event!</div><div><br></div><div>4. Clear limited-time endeavors to earn rewards!</div><div>You can earn rewards like wyrmite, eldwater, and epithets by clearing Stirring Shadows endeavors.</div><div><br></div><div>Notes:</div><div>1. Details for the Stirring Shadows event are available by tapping Help on the event page.</div><div>2. Players must have completed up to Chapter 2 / 2-1 (Normal) of the main campaign to participate.</div><div>3. Players must have completed up to Chapter 2 / 2-1 (Normal) of the main campaign in order to play co-op.</div><div>4. To check the additional limited-time daily endeavors, tap Endeavors on the home page, then check the Daily tab.</div><div>5. You will not be able to use the occult vestments event item in future events.</div><div><br></div><div>Thank you for playing Dragalia Lost.</div>,start_time:1572501600,update_time1572325712