article_id:854,category_name:Events,title_name:Stories Added to the Stirring Shadows Story Event!,image_path:https://dragalialost.akamaized.net/attached/information/images/0b5ed54ea39c7dcfb17733024ae3d4ab.png,message:<div>Chapters three and four were added to the Stirring Shadows story event at <span class="local_date" data-local_date="1572847200"></span>!</div><div>As you unlock stories, the number of exchangeable items also increases.</div><div><br></div><div>The Stirring Shadows story includes content that expands on the story told in The Accursed Archives facility event.</div><div><span style="color: rgb(226, 80, 65);">To get the most out of Stirring Shadows, we strongly encourage you to play The Accursed Archives facility event, which will be active at the same time, first.</span></div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/0b5ed54ea39c7dcfb17733024ae3d4ab.png"></div><div>■Event Overview</div><div>In the Stirring Shadows story event you can use event items acquired by clearing quests from the main campaign and various events to unlock special stories.</div><div><br></div><div>■Acquiring Event Items</div><div>For the duration of the event, you can acquire the event items, occult vestments, by clearing quests from the main campaign and various event quests.</div><div><br></div><div>Notes:</div><div>1. Details for the Stirring Shadows event are available by tapping Help on the event page.</div><div>2. Players must have completed up to Chapter 2 / 2-1 (Normal) of the main campaign to participate.</div><div>3. Players must have completed up to Chapter 2 / 2-1 (Normal) of the main campaign in order to play co-op.</div><div>4. To check the additional limited-time daily endeavors, tap Endeavors on the home page, then check the Daily tab.</div><div>5. You will not be able to use the occult vestments event item in future events.</div><div><br></div><div>Thank you for playing Dragalia Lost.</div>,start_time:1572847200,update_time1572256677