article_id:92,category_name:Events,title_name:Announcing the Facility Event A Wish to the Winds! [Update],image_path:,message:<div>The facility event A Wish to the Winds will be starting <span class="local_date" data-local_date="1542261600"></span>!</div><div><br></div><div>In A Wish to the Winds, players can acquire a Wind Shrine, an event-exclusive facility. If you take part in the event, you&#39;ll have the chance to build one in your Halidom!</div><div><br></div><div>The Wind Shrine powers up the stats of wind-element adventurers, which you&#39;ll want to use in this event. It also boosts the damage adventurers deal to enemies in A Wish to the Winds quests.</div><div><br></div><div>Try to advance the event story and level up your Wind Shrine!</div><div><br></div><div>Adventurers can equip event-specific wyrmprints to receive more windwhistle grass from these quests, which is used to upgrade the Wind Shrine. Wyrmprints are good for more than just that, though, so try to get ahold of them to get the most out of this event!</div><div><br></div><div>Note: Special effects conferred by event-specific wyrmprints do not apply if you begin a quest during the event period but complete the quest after the event period has ended.</div><div><br></div><div>Check below for details related to the A Wish to the Winds facility event.</div><div><br></div><div>■Event duration:</div><div><span class="local_date" data-local_date="1542261600"></span> to <span class="local_date" data-local_date="1543211999"></span></div><div><br></div><div>■Reward period:</div><div><span class="local_date" data-local_date="1542261600"></span> to <span class="local_date" data-local_date="1543816799"></span></div><div><br></div><div>■Wind Shrine, the event-exclusive facility:</div><div>Building a Wind Shrine in your Halidom increases the stats of wind-element characters.</div><div>It also confers a special effect that lets you deal more damage to enemies in these event quests.</div><div>The strength of this effect increases as you level up the Wind Shrine.</div><div>This effect only applies during the duration of this event.</div><div>You&#39;ll need the material windwhistle grass to level up your Wind Shrine, which you can find in these event quests.</div><div><br></div><div>■Upgrade item, windwhistle grass:</div><div>You can get this from event quests from the A Wish to the Winds facility event.</div><div><br></div><div>■Boss battles:</div><div>These are quests where players face off against bosses who appear in the event story.</div><div>Rewards vary depending on the difficulty selected.</div><div><br></div><div>■Extra boss battles:</div><div>While the difficulty level is higher than normal boss battles, the rewards are generous.</div><div>These will unlock at a fixed percentage when you clear the expert version of a boss battle.</div><div>The quest will disappear once you clear it.</div><div>Once the conditions for the quest are met, you can unlock it repeatedly.</div><div>This quest can be played in co-op.<br>(The original post incorrectly stated that this quest is single player only.)</div><div><br></div><div>■Daily battles:</div><div>These are daily quests specific to this event that can only be cleared once a day.</div><div>They become unlocked after the first time you clear the boss battle.</div><div>These quests offer various kinds of rewards.</div><div>You can retry as many times within a day until you are able to clear it.</div><div>This quest is single player only.</div><div><br></div><div>■Challenge battles:</div><div>These are high-difficulty fights limited to solo play.</div><div>They&#39;re unlocked after beating the boss battle on expert rank.</div><div>The quest pits you against waves of enemies. Even if you don&#39;t defeat them all, you&#39;ll still receive rewards based on how many waves you cleared.</div><div><br></div><div>■Divine gale rewards:</div><div>These are event points exclusive to A Wish to the Winds.</div><div>They can be earned by clearing event quests.</div><div>Collect divine gale rewards and you can acquire prizes.</div><div><br></div><div>■Treasure Trade rewards:</div><div>You can trade friendship bracelets, which are acquired during quests, and wind chimes at the Treasure Trade for various rewards.</div><div><br></div><div>■Endeavors:</div><div>These endeavors can only be attempted for the duration of the event.</div><div>They are separated into Daily and Limited variations.</div><div>By accomplishing these endeavors, you can receive various rewards.</div><div><br></div><div>■Notes:</div><div>1. Details for the event endeavors are available by tapping Help on the event page.</div><div>2. You must clear Ch. 2 / 1-1 (Normal), The Sylvan Archer, to participate in event quests.</div><div>3. If the event ends while you are in a battle, the battle will continue until the results are determined. You will be able to gain rewards according to the results of the battle.</div><div>4. The event schedule and content for A Wish to the Winds may change without warning.</div><div><br></div><div>Thank you for playing Dragalia Lost!</div>,start_time:1542261600,update_time1543223345