article_id:967,category_name:News,title_name:The Agito Uprising Is Coming! Fight Deadly Foes From a Mysterious Organization in These High-Difficulty Quests!,image_path:https://dragalialost.akamaized.net/attached/information/images/a907cabe0ecf1634750751475d1cd52a.png,message:<div>The Agito Uprising, high-difficulty quests where you&#39;ll face powerful foes from a new organization, arrive <span class="local_date" data-local_date="1577340000"></span>! Clear them to earn materials required to craft 6★ rarity weapons!</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/e5e84f122c8547511e964715b5c70b74.png"></div><div><br></div><div>The Agito are fangs.</div><div>The Agito are an awakening.</div><div>The Agito are an uprising.</div><div><br></div><div>When a masked being referred to as an Agito appears, violent winds of plague blow across the land, and a hungry wolf bares his fangs. That wolf has a name, and that name is Volk.</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/a907cabe0ecf1634750751475d1cd52a.png"></div><div>Volk&#39;s Wrath (Wind), Required Might: 22,000</div><div><br></div><div>■New Agito Series Weapons</div><div>Powerful new 6★ Agito weapons will be added under Crafting at <span class="local_date" data-local_date="1577340000"></span>.</div><div>You can use materials obtained by defeating Volk to craft flame-attuned weapons with skills that switch effects each time you use them.</div><div><br></div><div>You must have first obtained specific weapons before you can craft weapons using materials obtained from Volk.</div><div>The required weapons are the tier II flame-attuned 5★ weapons that can be crafted using materials obtained from the Volcanic Chimera in Void Battles.</div><div><br></div><div>The weapon that is required differs based on the weapon type for the weapon you wish to craft. You can check the requirements by selecting Materials for the Volk weapons on the Craft tab under Crafting.</div><div><br></div><div>・Agito weapons cannot be dismantled.</div><div>・Difficulty levels for Volk&#39;s Wrath and tier II and higher enhancements for Agito weapons will be added in the future.</div><div><br></div><div>Note:</div><div>Players must have completed Chapter 10 / 6-3 (Normal) of the main campaign and any of the Standard difficulty Advanced Dragon Trials to participate.</div><div><br></div><div>Thank you for playing Dragalia Lost.</div><div><br></div>,start_time:1577253600,update_time1577082475