b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":105,"category_name":"News","pr_category_id":"1","title_name":"The Platinum Showcase is now available!","message":"<div>The Platinum Showcase has been available from <span class=\\"local_date\\" data-local_date=\\"1542866400\\"><\/span>.<\/div><div><br><\/div><div>The Platinum Showcase is a limited summon showcase that works similar to a Tenfold Summon, in that one summon will get you 10 results. The difference between a regular Tenfold Summon and the Platinum Showcase is that a 5\\u2605 adventurer, wyrmprint, or dragon is guaranteed to appear. Whether you get an adventurer, a wyrmprint, or a dragon depends on when you do your summon.<\/div><div><br><\/div><div>There are defined periods for the 5\\u2605 Adventurer Guaranteed, the 5\\u2605 Wyrmprint Guaranteed, and the 5\\u2605 Dragon Guaranteed summons. During each period, players are limited to doing the Platinum Showcase summon only once, and these summons can only be performed with diamantium (purchase required).<\/div><div><br><\/div><div>Platinum Showcase durations:<\/div><div>\\u30fb5\\u2605 Adventurer Guaranteed<\/div><div><span class=\\"local_date\\" data-local_date=\\"1542866400\\"><\/span> to <span class=\\"local_date\\" data-local_date=\\"1543125540\\"><\/span><\/div><div>\\u30fb5\\u2605 Wyrmprint Guaranteed<\/div><div><span class=\\"local_date\\" data-local_date=\\"1543125600\\"><\/span> to <span class=\\"local_date\\" data-local_date=\\"1543384740\\"><\/span><\/div><div>\\u30fb5\\u2605 Dragon Guaranteed<\/div><div><span class=\\"local_date\\" data-local_date=\\"1543384800\\"><\/span> to <span class=\\"local_date\\" data-local_date=\\"1543643940\\"><\/span><\/div><div><br><\/div><div>Notes:<\/div><div>1. After the event ends, adventurers, dragons, and wyrmprints will continue to appear in future summon showcases, but the \\u2605 number and appearance rates may differ from those shown now.<\/div><div>2. To check Platinum Showcase appearance rates, tap Summon on the in-game footer menu, then select Appearance Rates.<\/div><div>3. If a summon results in an adventurer you already have, you will receive Eldwater instead of the adventurer. The amount of Eldwater you receive will vary depending on the adventurer&#39;s \\u2605 number.<\/div><div>4. Platinum Showcase summons will reset once each for the 5\\u2605Adventurer Guaranteed period, the 5\\u2605 Wyrmprint Guaranteed period, and the 5\\u2605 Dragon Guaranteed period on the first day the period becomes available at 07:00. For example, if you used a Platinum Showcase summon on 11\/22\/2018 at 15:00 for the 5\\u2605 Adventurer Guaranteed period, you cannot perform a summon again for the Platinum Showcase until the reset occurs and a new period begins. When it updates to the Platinum Showcase summon period for 5\\u2605 Wyrmprint Guaranteed, you can then perform a Platinum Showcase summon for that period.<\/div><div>5. The regular summon showcase will be available for the duration of the Platinum Showcase, as well. You can move between showcases by using the left\/right icons on the Summon screen.<\/div><div>6. If a 5\\u2605 fails to appear when using a Tenfold Summon for the regular summon showcase, the increased appearance rate modifier will not be reset, even when performing a Platinum Showcase summon.<\/div><div>7. For information other than what is posted in this update, tap Summon in the footer menu, then Showcase Info, then Details, and then scroll down to Notes.<\/div><div><br><\/div><div>Thank you for playing the Dragalia Lost game.<\/div>","start_time":1542866400,"prev_article_id":"106","next_article_id":"10003","image_path":"","update_time":1543644543}}}'