b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":1375,"category_name":"News","pr_category_id":"1","title_name":"Dragalia Lost Director Yuji Okada Responds to Player Feedback (from May 31, 2020)","message":"<div>On May 31, 2020, Dragalia Lost director Yuji Okada replied to feedback players sent via the in-game Leave Feedback feature.<\/div><div><br><\/div><div>This notification contains the contents of an interview with director Okada that was conducted by Yumi Uchiyama and Ayaka Asai, voice actors for the Japanese-language version of Dragalia Lost.<\/div><div><br><\/div><div>Notes:<\/div><div>\\u30fbTap Feedback on the game&#39;s title screen to open the Leave Feedback screen.<\/div><div>\\u30fbThe content of the interview has been edited for this notification, so wording may differ from the original conversation.<\/div><div>\\u30fbThe content of the responses is from the time of the interview, so content that is in-development may differ by the time of release in-game.<\/div><div><br><\/div><hr><div>\\u25a0Responses to Feedback<\/div><div>Uchiyama &amp; Asai: We&#39;ve received feedback that players do not have enough rainbow orbs and would like a Master difficulty for the Elemental Ruins.<\/div><div>Okada: Insufficient rainbow orbs was the feedback we received the most this time. With the increase in materials required to upgrade adventurers and the maximum level for facilities being raised, rainbow orbs have become much more necessary. We will be making rainbow orbs available periodically during events, so I hope players will thoroughly play them.<\/div><div><br><\/div><div>In regard to Master difficulty for the Elemental Ruins, that is not something in the immediate plans, but I do want to consider it. Also, the orbs required to unlock nodes on the mana spiral are currently available by playing the main campaign on Very Hard difficulty, and going forward I hope to have increased drop events for these quests.<\/div><div><br><\/div><div><br><\/div><div>Uchiyama &amp; Asai: There was feedback that players would like silver emblems to be easier to collect during raid events.<\/div><div>Okada: As things are, players are encouraged to play the Beginner difficulty raid, but the event format and difficulty has changed significantly since the release of the game, and we will continue to make gradual adjustments to change the content to better suit its current state.<\/div><div>Uchiyama &amp; Asai: We&#39;re looking forward to seeing what adjustments are made to better suit the current state of the game.<\/div><div><br><\/div><div><br><\/div><div>Uchiyama &amp; Asai: There is feedback that players cannot complete the normal endeavors for the main campaign.<\/div><div>Okada: One piece of feedback we received quite frequently was that it&#39;s hard to tell which weapons to craft. Starting in chapter 12 of the main campaign there are endeavors that the game will prompt you to complete. If you follow the endeavors, you will be able to craft the weapons, but if you don&#39;t complete the endeavor and obtain the rewards, you will not be able to unlock the story. I think that some parts of that are a bit confusing so please pay close attention as you progress. We do plan to make improvements here as well.<\/div><div>Uchiyama &amp; Asai: I see. So it&#39;s important to remember to progress all the way to accepting the rewards. We&#39;re also glad to hear you&#39;re planning to make improvements.<\/div><div><br><\/div><div><br><\/div><div>Uchiyama &amp; Asai: Players also want more quests where they can use the auto-play and speed features. For example, players wished the features were a little more supported for the defensive battles and coliseum quests in the Fire Emblem Heroes events. What do you think about this feedback?<\/div><div>Okada: I am sorry about the defensive battles. Due to development circumstances, we did not have time to support the auto-play feature, but we want to work defensive battles into future events as well, so we are hoping to add the auto-play feature at some point. However, there are quests that the operations team want players to actually play rather than using the auto-play feature, so we want to strike that balance.<\/div><div>Uchiyama &amp; Asai: It&#39;s true that coming together as a team and using stickers while fighting is fun too.<\/div><div>Okada: Exactly. I also think that there are those who might want to play using auto-play and then take control at important parts, so we hope to continue making adjustments.<\/div><div><br><\/div><div><br><\/div><div>Uchiyama &amp; Asai: Apparently, many players voiced the opinion that the difficulty level was just right for Ciella&#39;s Wrath.<\/div><div>Okada: Ciella is the water-attuned boss that we added to The Agito Uprising at the end of April. Each time we add bosses of this high difficulty level, we keep an eye on clear rates, clear times, the might of those who clear the quest, and all of the player feedback, and then we use that information to consider how to make adjustments for the next one. I think the fact that Ciella&#39;s Wrath received mostly good feedback is a result of looking at previously released quests like Advanced Dragon Trials, Volk&#39;s Wrath, and Kai Yan&#39;s Wrath, and then making adjustments based on that.<\/div><div><br><\/div><div>Some players are clearing the quest in solo play rather than co-op play, but there was also a lot of feedback that the difficulty level was just right because, while it is challenging, players are also able to clear it. For that reason, we hope to continue making adjustments as we keep an eye on players&#39; play status.<\/div><div><br><\/div><div>In regard to The Agito Uprising, we also recently added another difficulty level, Volk&#39;s Wrath: Master. In this way we hope to keep making it possible for various players to enjoy the game. It might be a little difficult, but I hope you work hard to clear it.<\/div><div><br><\/div><div><br><\/div><div>Uchiyama &amp; Asai: We have a question from us this time as well. When building a team, there are so many different wyrmprints to choose from. What criteria should players use to select wyrmprints?<\/div><div>Okada: The first thing many players who are clearing the high-difficulty content look for is a wyrmprint that increases skill damage. For example, you can greatly increase the power of your skills if the wyrmprint ability says that it increases skill damage for swords by 40% and you equip a sword adventurer with that wyrmprint. There are a variety of wyrmprints that boost skill damage, but they&#39;re all quite strong, so I think starting by equipping those is a good idea. As an example for the second wyrmprint, if the adventurer is strong against poisoned enemies and you equip a wyrmprint with Poisoned Punisher, then that will further increase your strength when the enemy is poisoned.<\/div><div>Uchiyama &amp; Asai: Will that take effect even against enemies that have resistances?<\/div><div>Okada: It won&#39;t take effect against enemies with resistances, but burn, paralysis, and poison can be applied to quite a few enemies, so you can get stronger by equipping wyrmprints like that.<\/div><div>Uchiyama &amp; Asai: So you&#39;re saying it&#39;s important to really get to know each wyrmprint on an individual basis. [Laughs] I hope that&#39;s helpful information for everyone else.<\/div><div><br><\/div><hr><div>Director Okada will continue to reply to the feedback players send via Leave Feedback again in the future. We&#39;re looking forward to hearing your comments.<\/div><div><br><\/div><div>Thank you for playing Dragalia Lost.<\/div>","start_time":1591768800,"prev_article_id":"1357","next_article_id":"1373","image_path":"","update_time":1591674588}}}'