b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":1398,"category_name":"Events","pr_category_id":"4","title_name":"Ayaha & Otoha\'s Wrath Has Arrived in The Agito Uprising!","message":"<div>Ayaha &amp; Otoha&#39;s Wrath was added to The Agito Uprising (high-difficulty quests where you&#39;ll face powerful foes from a new organization) at <span class=\\"local_date\\" data-local_date=\\"1593151200\\"><\/span>! Clear them to earn materials required to craft 6\\u2605 weapons!<\/div><div><br><\/div><div>The twin-girl Agito laugh innocently.<\/div><div>The black-haired girl flashes a sneer at the unsightliness before her<\/div><div>while the white-haired girl looks down on her insipid foes.<\/div><div><br><\/div><div>Their two bodies house a single heart... A heart that has room for little more than shameless cruelty. These two Agito proclaim freedom as they crave and devour entertainment. The merciless twin girls have names, and those names are Ayaha and Otoha.<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/5d1e44ee8ef999c6df562d60d8808418.png\\"><\/div><div>Ayaha &amp; Otoha&#39;s Wrath (Flame), Required Might: 22,000<\/div><div><br><\/div><div>\\u25a0New Agito Series Weapons<\/div><div>Powerful new 6\\u2605 Agito weapons were added under Crafting at <span class=\\"local_date\\" data-local_date=\\"1593151200\\"><\/span>. You can use materials obtained by defeating Ayaha &amp; Otoha to craft water-attuned weapons with skills that switch effects each time you use them.<\/div><div><br><\/div><div>You must have first obtained specific weapons before you can craft weapons using materials obtained from Ayaha &amp; Otoha. The required weapons are the tier II water-attuned 5\\u2605 weapons that can be crafted using materials obtained from the tidal chimera in Void Battles.<\/div><div><br><\/div><div>The weapon that is required differs based on the weapon type for the weapon you wish to craft. You can check the requirements by selecting Materials for the Ayaha &amp; Otoha weapons on the Craft tab under Crafting.<\/div><div><br><\/div><div>\\u30fbAgito weapons cannot be dismantled.<\/div><div>\\u30fbDifficulty levels for Ayaha &amp; Otoha&#39;s Wrath and tier II and higher enhancements for Agito weapons will be added in the future.<\/div><div><br><\/div><div>\\u25a0Treasure Trade for The Agito Uprising<\/div><div>The Water Tree facility will be added to the Treasure Trade for The Agito Uprising.<\/div><div>Obtain the Water Tree to boost the HP and strength of water-attuned adventurers.<\/div><div>\\u30fbThe exchange limit does not reset.<\/div><div><br><\/div><div>Note:<\/div><div>Players must have completed Chapter 10 \/ 6-3 (Normal) of the main campaign and any of the Standard difficulty Advanced Dragon Trials to participate.<\/div><div><br><\/div><div>Thank you for playing Dragalia Lost.<\/div><div><br><\/div>","start_time":1593151200,"prev_article_id":"1412","next_article_id":"1413","image_path":"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/5d1e44ee8ef999c6df562d60d8808418.png","update_time":1592356761}}}'