b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":146,"category_name":"Updates","pr_category_id":"2","title_name":"Update Notification[Addendum]","message":"<div>The update to version 1.3.0 was made available at <span class=\\"local_date\\" data-local_date=\\"1544760000\\"><\/span>. An automatic update is scheduled to occur at approximately <span class=\\"local_date\\" data-local_date=\\"1545015600\\"><\/span>.<\/div><div><br><\/div><div>To show our gratitude to everyone who performed this update, we will be sending out a Tenfold Summon Voucher. This announcement will be modified after these vouchers have been distributed.<\/div><div><br><\/div><div>In version 1.3.0, we have made various bug fixes, added an Advanced Dragon Trial, made it so that the adventurer you are playing will use skills when the Auto function is enabled, and made various other feature additions and changes!<\/div><div><br><\/div><div>Details for the update are as follows.<\/div><div><br><\/div><div><strong>\\u25a0 Details:<\/strong><\/div><div><strong>\\u30fb Added High Brunhilda to Advanced Dragon Trials<\/strong><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/62885bb44bebef1f890454ed67403d3b.png\\"><\/div><div>The high-difficulty event quest, High Brunhilda, will be added to Advanced Dragon Trials.<\/div><div>Test your skills against the Mistress of Crimson, the Inferno Clad, in her true form!<\/div><div><br><\/div><div>High Brunhilda will be added on <span class=\\"local_date\\" data-local_date=\\"1545026400\\"><\/span>.<\/div><div><br><\/div><div><strong>\\u30fb Chapter 7 of the main story, Trek to the Aquapolis, has been added!<\/strong><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/20ec673d6c0fb94569da890655a2cddd.png\\"><\/div><div>The Prince and company set out for Saint Lotier, a city of water with an...unexpected ruler.<\/div><div>Family bonds will be tested as shadowy figures reveal themselves...<\/div><div><br><\/div><div>Chapter 7, Trek to the Aquapolis, will be added on <span class=\\"local_date\\" data-local_date=\\"1545890400\\"><\/span>.<\/div><div><br><\/div><div><strong>\\u30fb Year-end bonus!<\/strong><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/269c49014be04f640e67a299be7d3185.png\\"><\/div><div>There will be a year-end bonus, split into two halves with the following availability periods.<\/div><div><br><\/div><div>First half: From <span class=\\"local_date\\" data-local_date=\\"1545026400\\"><\/span> to <span class=\\"local_date\\" data-local_date=\\"1545631199\\"><\/span><\/div><div>Second half: From <span class=\\"local_date\\" data-local_date=\\"1545631200\\"><\/span> to <span class=\\"local_date\\" data-local_date=\\"1546322399\\"><\/span><\/div><div><br><\/div><div>You can get wyrmite as a gift for logging in during the availability periods!<\/div><div>By logging in for a maximum of 15 days during the first and second halves, you can earn up to <span style=\\"color: rgb(41, 105, 176);\\">1,500 wyrmite<\/span>.<\/div><div><br><\/div><div><strong>\\u30fb Resetting the Social Reward for playing co-op!<\/strong><\/div><div>We are resetting the number of times you can earn the Social Reward by playing co-op with a new player for the first time.<\/div><div>After clearing a quest you can earn <span style=\\"color: rgb(41, 105, 176);\\">50 wyrmite per player (up to a maximum of 50 players)<\/span>, so be sure to play co-op!<\/div><div><br><\/div><div>The Social Reward counter will be reset on <span class=\\"local_date\\" data-local_date=\\"1545026400\\"><\/span>.<\/div><div><br><\/div><div>\\u25a0Additional features and improvements:<\/div><div>The features and changes below have been added to the game.<\/div><div>\\u30fb Adventurers will now use their skills when playing with Auto enabled.<\/div><div>\\u30fb Changed the UI on the summon page for when you have a summon voucher.<\/div><div>\\u30fb Changed the UI for switching adventurers on the Edit Teams screen.<\/div><div>\\u30fb Added a feature to the Shop to enable purchasing as a batch.<\/div><div>\\u30fb Adjusted shapeshifting such that using a skill while transformed no longer decreases shapeshift time.<br>\\u30fbThe status of the auto-play option will remain unchanged even after playing a co-op quest.<br>Note: It will still be reset when re-launching the game. [Addendum <span class=\\"local_date\\" data-local_date=\\"1546236000\\"><\/span> ]<\/div><div><br><span style=\\"color: rgb(41, 105, 176);\\"><strong>Addendum <span class=\\"local_date\\" data-local_date=\\"1545018900\\"><\/span><\/strong><\/span><br>The following adjustments were applied during the data update performed at <span class=\\"local_date\\" data-local_date=\\"1545018000\\"><\/span>.<br>\\u30fb Made the following adjustments to the attacks of lance-wielding adventurers.<br>\\u3000\\u30fb Made it harder for combo attacks to be interrupted and easier to land consecutive hits.<br>\\u3000\\u30fb Adjusted the hitbox and range for force strikes to make them easier to land.<br>\\u30fb Made the following adjustments to the attacks of bow-wielding adventurers.<br>\\u3000\\u30fb Adjusted the speed and range of arrows to make it easier to land combo attacks.<br>\\u3000\\u30fb Adjusted the speed of force strikes.<br>\\u3000\\u30fbMade it so that arrows are fired when using dash attacks.<br><br><\/div><div>\\u25a0Issues fixed:<\/div><div>The following issues have been fixed.<\/div><div>\\u30fb Sometimes &quot;&quot;Support Code: 3002&quot;&quot; displays during co-op and forces users to leave the room.<\/div><div>\\u30fb Users are able to stay in a room for a long time after selecting Yes when asked whether to battle again in co-op.<\/div><div>\\u30fb Some enemies continuously use certain attacks when the host is defeated in co-op.<\/div><div>\\u30fb When users break a boss enemy who was afflicted with Freeze, the boss enemy starts to move.<\/div><div>\\u30fb For traditional Chinese only, &quot;\\u5167\\u5bb9\\u6709\\u8aa4&quot; displays when linking an account.<\/div><div><br><\/div><div>\\u25a0Notes:<\/div><div>1. It may take time for the update information to be reflected in the store. Players may not be able to perform the update due to their device&#39;s data cache being full. &nbsp;If you are unable to perform the update, restart your device and then attempt the download from the store.<\/div><div>2. Login bonuses and other goodies sent to your goodie box can only be accepted for a certain amount of time.<\/div><div>3. The schedule and content described in this notification may change without warning.<\/div><div><br><span style=\\"color: rgb(41, 105, 176);\\"><strong>[Addendum <span class=\\"local_date\\" data-local_date=\\"1545016200\\"><\/span>]<\/strong><\/span><br>Players who have started the game before <span class=\\"local_date\\" data-local_date=\\"1545015600\\"><\/span> and have updated Dragalia Lost to version 1.3.0 will receive a Tenfold Summon Voucher as a thank-you gift!<br><br>This gift will be sent to the goodie box of players who log in before <span class=\\"local_date\\" data-local_date=\\"1545620340\\"><\/span>. It can be accepted for seven days after reception.<br><br><\/div><div>Thank you for playing the Dragalia Lost game.<\/div>","start_time":1544760000,"prev_article_id":"122","next_article_id":"172","image_path":"","update_time":1546236062}}}'