b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":1803,"category_name":"News","pr_category_id":"1","title_name":"Dragalia Lost 2nd Anniversary Survey Digest","message":"<div>Hello! Yuji Okada here, director of Dragalia Lost.<\/div><div><br><\/div><div>I want to start by thanking those who took the time to participate in the 2nd anniversary survey. We were fortunate to receive a veritable avalanche of responses, and I&#39;m pleased to say that about 60% of the respondents reported having started their journey with Dragalia Lost all the way back at the game&#39;s launch. The remaining 40% of players were evenly split between having played for half a year, a year, and a year and a half. This relatively varied spread means that we heard from all kinds of players with all kinds of experiences.<\/div><div><br><\/div><div>Of course, we did not only receive responses from Japan. Through this survey we were able to gather feedback from every region in which the game has been released. It was humbling to reflect on the fact that players the world over are enjoying the game every day.<\/div><div><br><\/div><div>Much like the feedback submitted through the in-game feedback function, we plan to work toward improving the game based on what we heard from players in the survey. With that in mind, I&#39;d like to share some of the main points that came up in the survey results, first by taking a look at a selection of survey questions and then providing my thoughts on your feedback.<\/div><div><br><\/div><hr><div><br><\/div><div>\\u25a0With the release of version 2.0, extensive enhancements and adjustments were made to adventurers, dragons, and the difficulty of certain quests. What do you think about these changes?<\/div><div><br><\/div><div>These adjustments were made in the interest of restoring game balance between the elements, and in that respect I believe that they were largely successful and well-received, as many players praised the ability to use a more diverse team of adventurers when taking on various quests.<\/div><div><br><\/div><div>With that said, there still exist adventurers who excel so much in their particular roles that they are used almost exclusively over other adventurers for certain quests in co-op play where speed and efficiency are key factors in who players decide, or expect, to play with. This may prevent players who do not have these adventurers from having an enjoyable questing experience. To ensure that all players are able to enjoy co-op, we plan to implement changes so that a greater variety of adventurers can excel in their roles.<\/div><div><br><\/div><div>On that note, some players were curious about how frequently we plan to add mana spirals to adventurers in the future. Given that Version 2.0 recently implemented extensive balance adjustments, we expect to slightly reduce the rate at which we add mana spirals going forward, but the introduction of more challenging quests and difficulties means that mana spirals will continue to have their place.<\/div><div><br><\/div><div>Some players expressed a desire for more variety in the way that dragons are used. It is true that their abilities tend to favor an offensive play style revolving around dealing damage with abilities while shapeshifted. Although new dragons are not released as often as new adventurers are, we will keep this overall trend in mind and strive to introduce more variety in the future.<\/div><div><br><\/div><div>In Version 2.0, the difficulty of certain quests was reduced and the attacks of certain enemies were made easier to recognize. According to your responses, these adjustments were largely seen in a positive light.<\/div><div><br><\/div><div>Similarly, players appreciated the separation of certain quests and the accompanying rewards into versions for both solo and co-op play. It is our hope that players who felt intimidated by the learning curve of high-difficulty content in co-op, or those who did not have the time to dedicate to it, were able to continue progressing through the game at a comfortable pace with the solo-play versions.<\/div><div><br><\/div><div>With the large-scale adjustments made to game balance since the game&#39;s release, many players noticed that the suggested might for certain quests no longer matches the actual might required to clear them. We plan to address this discrepancy in the future.<\/div><div><br><\/div><div>\\u25a0With the release of version 2.0, the weapon and wyrmprint systems have been streamlined. What do you think about these changes?<\/div><div><br><\/div><div>Regarding the adjustments made to the weapon system, many players felt that the new system was easier to understand and manage. Players who had struggled with the complexity of the previous system reported that the new system made them want to get back into crafting weapons. That was exactly our intention with this overhaul, and I am pleased to see that it worked.<\/div><div><br><\/div><div>Many players have noticed that the rupie cost to craft certain weapons has increased significantly. This is due to the introduction of the advantages provided by the weapon bonus system and a streamlining of the Agito weapon crafting costs to bring them in line with other series. To offset some of these costs, we will continue to implement regularly occurring events from which players can receive rupies and increase the amount of rupies that events reward. We&#39;d also like to aid players in obtaining materials by implementing regularly occurring events that feature specific quests with increased drops.<\/div><div><br><\/div><div>Regarding the adjustments made to the wyrmprint system, we were successful in providing players with expanded customization options, but some players felt that these new elements only served to increase the complexity of deciding which wyrmprints to use in which situations and the time required to equip them. We&#39;d like to make the system easier to use without sacrificing the deep customization that it currently offers, so we plan to improve its usability so that players will be able to more quickly and easily find the particular wyrmprints that they need.<\/div><div><br><\/div><div>\\u25a0What do you think of the new mode, the Alberian Battle Royale?<br><br>This mode is the first of its kind in the Dragalia Lost game, and to be frank, we received both positive and negative feedback from players regarding its implementation.<br><br>In terms of gameplay, players enjoyed competing with each other in real time using a variety of clever strategies, including taking their opponents by surprise in the tall grass. Some players even began to recognize each other and create impromptu rivalries over the course of multiple encounters, ratcheting up the tension and excitement each time they clashed.<br><br>On the other hand, some players expressed disappointment that the top-tier rewards were too similar to the lower-tier ones, while those who enjoy single-player experiences were dismayed at the prospect of being forced to compete with other players for rewards. Finally, we received reports that lag would sometimes prevent players from connecting with their attacks, which can be particularly frustrating when you&#39;re going for the knockout blow.<br><br>While we strive to maintain balance in all of our game modes, it is particularly important to satisfy an expectation of fair play in the Alberian Battle Royale since it pits players against each other. We want there to be something for everyone, so we plan to add more mechanics, rewards, and other elements that will make the mode even more enjoyable while maintaining the existing sense of friendly rivalry that allows for even casual players to experience the thrill of competition.<br><br>\\u25a0What do you think about the Forgotten Truths event (raid boss battle, story, etc.)?<br><br>The Dragalia Lost team poured a lot of effort into the 2nd anniversary event, so we are very happy to see that many players enjoyed the story, battles, animations, music, and other elements that came along with it.<br><br>The quest with fixed stats that allowed players to enjoy the event&#39;s climactic battle, regardless of their team&#39;s might, was received positively, and we are considering implementing more of this type of quest in the future.<br><br>The plot of this particular event was deeply connected to the game&#39;s lore and overall story, and the sheer scope of the events that transpired meant that we could not cover perhaps as much as some players wanted. While I empathize with players who wanted to learn as much as they could about the story, please understand that we always carefully consider just how much of it to cover in any one event. Spend too little time and players may be left wanting more, but spend too much time and players may become bored. I think we just about hit the nail on the head with the length of this one.<br><br>Since it seems that players very much enjoyed content related to the central events of the plot during both the 1st and 2nd anniversaries, we plan to create similar content for the upcoming 2.5-year anniversary as well.<br><br>\\u25a0What do you think about the main campaign through the latest chapter, chapter 15?<br><br>Interest in the developments occurring in the main campaign story seems to pick up dramatically starting in chapter 10. The story has taken on a more serious tone, but we are happy that players have been able to experience the individual quirks of the cast and enjoy what makes them special along the way, and we intend to continue down that path. Some players may feel that the plot is dragging on a bit, but we hope that everyone is looking forward to what&#39;s ahead for the prince and his friends.<br><br>Some players reported that they don&#39;t play the campaign at all, at least beyond the quests required to unlock certain features, so we hope to make it more appealing to a broader range of players than it is now.<br><br>Chapter 17 will be released in December and follows the trials and tribulations that our heroes face in North Grastaea. This will include meeting some new faces, so be sure to get caught up on Chapter 16 in the meantime!<br><br>\\u25a0What do you expect from the Dragalia Lost game in the future? Do you have any questions or feedback for the Dragalia Lost team?<br><br>Many players expressed an interest in future events and stories. Each month we release new events with new stories to enjoy, and we plan to continue expanding the size and scope of Dragalia Lost&#39;s world through these regular updates.<br><br>Players were split on wanting the game to be easier or harder. Although satisfying both types of players at the same time is an exceedingly difficult proposition, we feel that everyone should be able to enjoy the game as they like. We would like to make it so the most difficult quests in the game and quests that offer materials to craft increasingly stronger weapons are not part of a single progression path. Should players want to improve their weapons, they can focus on quests that offer materials, and should they want to challenge their skills, they can focus on quests that offer high-difficulty content. In the short term, we plan to expand the latter category with Legend-difficulty quests.<br><br>Players appreciated the variety of content updates around the 2nd anniversary. Although some of the additions and adjustments still need a bit of polish here and there, we are dedicated to continually improving the enjoyment and accessibility of the game.<br><br>Many players expressed a desire for the implementation of the long-awaited encyclopedia feature and a revival of the Wagabond Pupper event. Please stay tuned for updates on these!<br><br>\\u25a0In Closing<br><br>Allow me to extend my thanks once again for taking the time and effort to share your feedback with the development team. The number of responses received was excellent considering the high amount of free-response questions, which are traditionally more lengthy and time-consuming to complete than ones with multiple choices.<\/div><div><br><\/div><hr><div>As a token of our appreciation for participating in the survey, we will be sending 1,200 wyrmite to all players.<\/div><div><br>The 2nd anniversary and major 2.0 update that accompanied it were an excellent opportunity for the development team to reconnect with the pulse of the players and realign our goals with their desires. We certainly received a wealth of valuable feedback this time, and we will continue to employ surveys like these to gather your thoughts on the game and shape it going forward. With that in mind, please continue to share any feedback that you may have whenever possible. We are listening, and we are grateful.<br><br>Thank you for playing Dragalia Lost!<\/div>","start_time":1608098400,"prev_article_id":"1831","next_article_id":"1842","image_path":"","update_time":1608082160}}}'