b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":209,"category_name":"Events","pr_category_id":"4","title_name":"Dream Big Under the Big Top Facility Event, Now Open!","message":"<div>The facility event Dream Big Under the Big Top started at <span class=\\"local_date\\" data-local_date=\\"1547532000\\"><\/span>!<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/d9dc3f36f9d68bd299955550bc01ac3a.png\\"><\/div><div>Ladies and gentlemen! Prepare for a magical circus unlike any you&#39;ve seen before!<\/div><div><br><\/div><div>Your hosts on this dreamlike adventure? An elegant dagger wielder and a lovely dragon tamer!<\/div><div><br><\/div><div>With both the kingdom and the empire involved, you won&#39;t believe the show they&#39;ve prepared for you!<\/div><div><br><\/div><div>Please enjoy the Dream Big Under the Big Top facility event!<\/div><div><br><\/div><div>\\u25a0 Event overview:<\/div><div>In Dream Big Under the Big Top, players can acquire a Circus Tent, an event-specific facility. If you take part in the event, you&#39;ll have the chance to build one in your Halidom!<\/div><div><br><\/div><div>The Circus Tent powers up the stats of light-element adventurers, which you&#39;ll want to use in this event. It also boosts the damage adventurers deal to enemies in Dream Big Under the Big Top quests.<\/div><div><br><\/div><div>Try to advance the event story and level up your Circus Tent!<\/div><div><br><\/div><div>Adventurers can equip event-specific wyrmprints, which can be acquired from Treasure Trade or as event-specific rewards, to receive extra tent canvas from these quests, which is used to upgrade the Circus Tent. Wyrmprints are good for more than just that, though, so try to get a hold of them to get the most out of this event!<\/div><div><br><\/div><div>Note: Special effects conferred by event-specific wyrmprints do not apply if you begin a quest during the event period but complete the quest after the event period has ended.<\/div><div><br><\/div><div>Check below for details related to the Dream Big Under the Big Top facility event.<\/div><div><br><\/div><div>\\u25a0Event duration:<\/div><div><span class=\\"local_date\\" data-local_date=\\"1547532000\\"><\/span> to <span class=\\"local_date\\" data-local_date=\\"1548395999\\"><\/span><\/div><div><br><\/div><div>\\u25a0Reward period:<\/div><div><span class=\\"local_date\\" data-local_date=\\"1547532000\\"><\/span> to <span class=\\"local_date\\" data-local_date=\\"1549000799\\"><\/span><\/div><div><br><\/div><div>\\u25a0Circus Tent, the event-specific facility:<\/div><div>Building a Circus Tent in your Halidom increases the stats of light-attuned characters.<\/div><div>It also confers a special effect that lets you deal more damage to enemies in these event quests.<\/div><div>The strength of this effect increases as you level up the Circus Tent.<\/div><div>This effect only applies for the duration of this event.<\/div><div>You&#39;ll need tent canvas to level up your Circus Tent, which you can find in these event quests.<\/div><div><br><\/div><div>\\u25a0Upgrade item, tent canvas:<\/div><div>You can get these from event quests related to the Dream Big Under the Big Top facility event.<\/div><div><br><\/div><div>\\u25a0Boss battles:<\/div><div>These are quests where players face off against bosses who appear in the event story.<\/div><div>Rewards vary depending on the difficulty selected.<\/div><div><br><\/div><div>\\u25a0Extra boss battles:<\/div><div>While the difficulty level is higher than the expert version of the boss battle, the rewards are generous and the battles do not cost stamina.<\/div><div>These will unlock at a fixed percentage when you clear the expert version of a boss battle.<\/div><div>The quest will disappear once you clear it.<\/div><div>Once the conditions for the quest are met, you can unlock it repeatedly.<\/div><div>This quest can be played in co-op.<\/div><div><br><\/div><div>\\u25a0Daily battles:<\/div><div>These are daily quests specific to this event that can be cleared once a day.<\/div><div>They become unlocked after the first time you clear the beginner version of the boss battle.<\/div><div>These quests offer various kinds of rewards.<\/div><div>You can retry as many times as you&#39;d like within a day until you are able to clear it.<\/div><div>This quest is solo player only.<\/div><div><br><\/div><div>\\u25a0Challenge battles:<\/div><div>These are high-difficulty fights limited to solo play.<\/div><div>They&#39;re unlocked after beating the boss battle on expert.<\/div><div>The quest pits you against waves of enemies. Even if you don&#39;t defeat them all, you&#39;ll still receive rewards based on how many waves you cleared.<\/div><div>Note: Starting with this event, challenge battles will be displayed as Challenge Battle: Expert.<\/div><div><br><\/div><div>Additionally, in this event, a master difficulty version of the challenge battle will unlock the first time you clear it on expert.<\/div><div>\\u30fb There is a small chance that rare items such as Twinkling Sand or 5\\u2605 weapons drop in the master difficulty version of the challenge battle.<\/div><div><br><\/div><div>Try to clear this event&#39;s most difficult quests and earn limited-time epithets!<\/div><div><br><\/div><div>\\u25a0Renown rewards:<\/div><div>These are event points exclusive to Dream Big Under the Big Top.<\/div><div>They can be earned by clearing event quests.<\/div><div>Collect renown rewards and you can acquire prizes.<\/div><div><br><\/div><div>\\u25a0Treasure Trade rewards:<\/div><div>You can trade Big Top Balloons and Colorful Bouquets, which are acquired during quests, at the Treasure Trade for various rewards.<\/div><div><br><\/div><div>\\u25a0Endeavors:<\/div><div>These endeavors can only be attempted for the duration of the event.<\/div><div>They are separated into Daily and Limited variations.<\/div><div>By accomplishing these endeavors, you can receive various rewards.<\/div><div><br><\/div><div>\\u25a0Notes:<\/div><div>1. Details for the event are available by tapping Help on the event page.<\/div><div>2. You must clear Ch. 2 \/ 2-1 (Normal), The Sylvan Archer, to participate in event quests.<\/div><div>3. If the event ends while you are in a battle, the battle will continue until the results are determined. You will be able to gain rewards according to the results of the battle.<\/div><div>4. The event schedule and content for Dream Big Under the Big Top may change without warning.<\/div><div><br><\/div><div>Thank you for playing Dragalia Lost!<\/div>","start_time":1547532000,"prev_article_id":"201","next_article_id":"221","image_path":"","update_time":1548396472}}}'