b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":2250,"category_name":"News","pr_category_id":"1","title_name":"This Month in Dragalia Lost","message":"<div>Hello, everyone! Yuji Okada here, director of Dragalia Lost.<\/div><div><br><\/div><div>First off, as always, thank you for playing Dragalia Lost. I&#39;m again excited to bring you the latest news on what&#39;s happening in and around the game this month.<\/div><div><br><\/div><div>\\u25a0The Children of Yggdrasil Invasion Event Is Here!<\/div><div>This is the first of a new type of event in which you&#39;re up against the clock to defeat waves upon waves of enemies before they overwhelm you. The more enemies you defeat, the more points you earn. When playing in co-op, don&#39;t worry too much about might and just focus on having fun blasting through tons of enemies!<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/356d675f0feb478f2197bc4b9c445a1b.png\\"><\/div><div>It&#39;s been some time since the story explored sylvan culture and traditions, and Sarisse is back in the spotlight to drive events forward. She finds herself taking up a manacaster over the course of this event, and she&#39;s featured in the latest Gala Dragalia as Sharpshooter Sarisse alongside Gala Mascula, who has a role of his own to play in chapter 19 of the main campaign.<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/360ad54caabe28f71daa3f2dba578ea5.png\\"><\/div><div><br><\/div><div>\\u25a0Plans for This Month<\/div><div>\\u30fbThe angel Raphael and sylvan Isaac (who appears in The Children of Yggdrasil event going on now) will be featured in a Prize Showcase starting on <span class=\\"local_date\\" data-local_date=\\"1622700000\\"><\/span>. For further details, like their stats and skills, please see the corresponding in-game notification.<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/e73d1d4b959d6aaf7f57bd09490ef160.png\\"><\/div><div><br><\/div><div>\\u30fbNew bosses will continue to appear in Trials of the Mighty. Until now, players have faced a single boss in combat, but in the upcoming Shadow Legion&#39;s Trial, players will have to defeat multiple enemies in large-scale battles akin to The Imperial Onslaught. Materials for unlocking the 5\\u2605 adventurer Summer Verica&#39;s mana spiral will be available from the daily bonus for this quest. Agni&#39;s Trial and Jeanne d&#39;Arc&#39;s Trial are also coming, and the daily bonuses for these quests offer materials for unlocking 5\\u2605 adventurers Gala Laxi&#39;s and Gala Luca&#39;s mana spirals respectively.<\/div><div><br><\/div><div>\\u30fbAn onslaught event will be held in mid June with Tobias appearing in a pretty fancy getup. It seems he&#39;s acting on someone&#39;s special orders, but you&#39;ll have to play the event to discover the details.<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/ce1e4c8b2204a801bf743476fd96b3cb.png\\"><\/div><div><br><\/div><div>\\u30fbPart one of chapter 20 of the main campaign will be added in late June, and with it, a new area called the Sacred Tree.<\/div><div><br><\/div><div>\\u30fbA Time Attack Challenges event pitting you against flame-attuned enemies will be held.<\/div><div><br><\/div><div>\\u30fbA new boss, Asura, will appear in Rise of the Sinister Dominion early next month.<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/f58d5bba1fbf62e10df88ba73da8d87c.png\\"><\/div><div><br><\/div><div>\\u25a0Future Updates<br>\\u30fbOver time we have found that players who want to repeat quests that award materials to level their facilities during facility events are forced to interrupt this loop when an extra boss battle appears. By removing extra boss battles from future facility events (both new ones and those that are added to the Event Compendium) and adjusting the distribution of rewards, we hope to smooth out this gameplay loop.<br><br>\\u30fbWe will make the daily bonus from various quests more convenient to earn by creating one central location from which players can clear all these quests with just one tap, using skip tickets. This change will not affect Trials of the Mighty.<br><br>\\u30fbThanks to your continued passion and support for Dragalia Lost, the game will reach its 1,000-day anniversary on June 21. We will be holding various events to celebrate this momentous milestone and thank our players, so stay tuned for more details.<br><br>\\u25a0In Conclusion<br>Thank you for reading this month&#39;s update. We&#39;re giving all players the following gift this month.<br><br>\\u30fbChampion&#39;s Testament &times; 2<br>\\u30fbEldwater &times; 25,000<br><br>The next installment of This Month in Dragalia Lost will be posted around <span class=\\"local_date\\" data-local_date=\\"1625119200\\"><\/span>. Until then, thanks for reading and for continuing to play Dragalia Lost!<br><br>Yuji Okada<br>Director, Dragalia Lost<br><br>Notes:<br>\\u30fbThe gift can be claimed from your goodie box for up to seven days after reception. If the gift isn&#39;t retrieved within seven days, it will be lost.<br>\\u30fbSummon showcase, event, and update content may change without notice.<br>\\u30fbAny adventurers and game screenshots shown are still in development.<\/div>","start_time":1622527200,"prev_article_id":"2227","next_article_id":"2246","image_path":"","update_time":1622450211}}}'