b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":2306,"category_name":"Events","pr_category_id":"4","title_name":"Legend Difficulty Was Added to Tartarus\'s Wrath!","message":"<div>A new Legend difficulty was added to Tartarus&#39;s Wrath in The Agito Uprising (high-difficulty quests where you&#39;ll face powerful foes) on <span class=\\"local_date\\" data-local_date=\\"1627624800\\"><\/span>.<\/div><div><br><\/div><div>Tartarus&#39;s Wrath: Legend may only be undertaken by a team of light-attuned adventurers and dragons. Clear this quest to earn materials required to further refine light-attuned 6\\u2605 weapons. Once an Agito weapon is refined to its second stage, its appearance will change!<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/4860d9861579e837692727a0cd7889db.png\\"><\/div><div>&quot;I will destroy this world of many sins,&quot; the Agito said.<\/div><div>&quot;In order avenge my fallen king,&quot; the Agito said.<\/div><div>&quot;Everything I do is for my king, for His Majesty, King Alberius.&quot;<\/div><div><br><\/div><div>The vengeful determination in the Agito&#39;s gloomy eyes tells of his uprising against all who took his master from him and lived. The dragon who descended half-clad in steel has a name, and that name is Tartarus.<\/div><div><br><\/div><div>\\u25a0New Agito Series Weapons<\/div><div>The ability to refine the powerful light-attuned 6\\u2605 Agito weapons to their second stage was unlocked on <span class=\\"local_date\\" data-local_date=\\"1627624800\\"><\/span>. By refining these weapons to their second stage, you can change their appearance.<\/div><div><br><\/div><div>You must have first obtained specific weapons before you can craft weapons using materials obtained from Tartarus. The required weapons are the light-attuned 5\\u2605 weapons that can be crafted using materials obtained from the Luminous Chimera in Void Battles.<\/div><div><br><\/div><div>The weapon that is required differs based on the weapon type for the weapon you wish to craft. You can check the requirements by selecting Materials for the light-attuned weapons in the Agito Weapons section of the Weapons\/Crafting menu.<\/div><div><br><\/div><div>\\u25a0Facility<\/div><div>The maximum level of the Light Tree facility has been increased to 30.<\/div><div><br><\/div><div>\\u25a0Changes to Survival Bonuses and the Number of Revives<\/div><div>Survival bonuses and the number of revives were changed on <span class=\\"local_date\\" data-local_date=\\"1627624800\\"><\/span>. The number of revives in Tartarus&#39;s Wrath: Master has been changed to one, and survival bonuses have been added. The number of revives in Tartarus&#39;s Wrath: Expert has been increased to two, and the survival bonus content has been changed. The number of revives in Tartarus&#39;s Wrath: Standard has been increased to three, and the survival bonus content has been changed.<\/div><div><br><\/div><div>Notes:<\/div><div>1. Players must have completed Chapter 10 \/ 6-3 (Normal) of the main campaign and any of the Standard-difficulty Advanced Dragon Trials in solo or co-op play to play The Agito Uprising.<\/div><div>2. Players must have completed Tartarus&#39;s Wrath: Master in solo or co-op play to play Tartarus&#39;s Wrath: Legend in solo play.<\/div><div>3. Players must have completed Tartarus&#39;s Wrath: Master in solo or co-op play to play Tartarus&#39;s Wrath: Legend in co-op play.<\/div><div><br><\/div><div>Thank you for playing Dragalia Lost.<\/div>","start_time":1627624800,"prev_article_id":"2358","next_article_id":"30110","image_path":"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/4860d9861579e837692727a0cd7889db.png","update_time":1625128492}}}'