b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":2394,"category_name":"News","pr_category_id":"1","title_name":"Dragalia Lost Director Yuji Okada Responds to Player Feedback (from July 25, 2021)","message":"<div>On July 25, 2021, Dragalia Lost director Yuji Okada replied to feedback players sent via the in-game Leave Feedback feature.<\/div><div><br><\/div><div>This notification contains the contents of an interview with director Okada that was conducted by Yumi Uchiyama and Ayaka Asai, voice actors for the Japanese-language version of Dragalia Lost.<\/div><div><br><\/div><div>Notes:<\/div><div>\\u30fbThe feedback featured in this notification was chosen from that received between June 1 and June 30.<\/div><div>\\u30fbTap Feedback on the game&#39;s title screen to open the Leave Feedback screen.<\/div><div>\\u30fbThe content of the interview has been edited for this notification, so wording may differ from the original conversation.<\/div><div>\\u30fbThe content of the responses is from the time of the interview, so content that is in development may differ by the time of its release in-game.<\/div><div><br><\/div><hr><div>\\u25a0Responses to Feedback from Players<\/div><div>Uchiyama &amp; Asai: Some players have written in to express concern that more and more 5\\u2605 adventurers (and by extension, fewer and fewer 3\\u2605 and 4\\u2605 adventurers) have been receiving mana spirals lately. While mana spirals are a way to bring underperforming adventurers of every rarity back into the fold, they are also a way for lower-rarity adventurers to shine in an environment packed with their higher-rarity counterparts. Seeing as how 3\\u2605 adventurers have fans of their own, would you consider adding more mana spirals for them?<\/div><div><br><\/div><div>Okada: We will take this feedback into account when deciding which adventurers receive mana spirals in the future.<\/div><div><br><\/div><div><br><\/div><div>Uchiyama &amp; Asai: Curse of Nihility is a game mechanic that removes certain buffs and nullifies their effects, but it can be difficult to keep track of exactly which buffs are subject to it and which are not. Some players have suggested adding a list of affected buffs to the in-game help section for easy perusal and confirmation. This would be especially helpful in co-op where your teammates may not realize that their ordinarily powerful adventurer or dragon will struggle under the effects of Curse of Nihility.<\/div><div><br><\/div><div>Okada: It is indeed true that when used by bosses in Rise of the Sinister Dominion and other quests, Curse of Nihility only affects certain buffs, and there is currently no quick and easy way for players to tell which of their buffs are subject to it and which are not. With that in mind, we plan to make this information more accessible in the future via the in-game help section.<\/div><div><br><\/div><div><br><\/div><div>Uchiyama &amp; Asai: Players expected the Blessed Bloodline onslaught event to touch on some topics related to the main campaign, so they were excited to dig into the event story when it was first released. However, since both onslaught events and defensive events have yet to appear in the Event Compendium, they were concerned by the fact that they cannot go back and re-read certain events related to the main campaign at their leisure. On that note, they are eager to see the Dawn of Dragalia raid event added for posterity.<\/div><div><br><\/div><div>Okada: The Event Compendium hosts a variety of different events. Since facility events provide event-exclusive facilities that directly influence the stats of certain types of adventurers, we prioritize adding them first so that players are free to develop the strength of their roster without worrying about event durations. However, that does not mean that we are not interested in adding onslaught, defensive, coliseum, and other types of events&mdash;just the opposite, in fact. It may take some time, but rest assured that the Event Compendium will continue to grow.<\/div><div><br><\/div><div><br><\/div><div>Uchiyama &amp; Asai: A player attempting Hard and Very Hard quests in chapter 19 of the main campaign wrote in to praise the look and feel of the Faerie Kingdom maps. They found the colorful and intricate decorations particularly attractive and ended up spending as much time taking screenshots as fighting fiends. The Faerie Kingdom map felt like it was truly inhabited by faeries, while the Grams city map had an altogether different feel but was equally endearing. Why not add a photo mode or similar feature so that players can take screenshots of their favorite adventurers in these whimsical locations?<\/div><div><br><\/div><div>Okada: Chapter 20, The Sacred Tree, also features quests with locations like these, and we&#39;re proud to consider the visual appeal of the game&#39;s maps as one of its strong points. While there are some hurdles to giving the player greater control over the camera during quests, I hope that you will be excited to learn that the map in the Wagabond Pupper event will be temporarily changing to feature a seasonal theme. Look forward to catching some rays on the beach with the doggo while snapping some memorable screenshots.<\/div><div><br><\/div><div><br><\/div><div>Uchiyama &amp; Asai: It seems the Dragalia Lost Song Collection (available physically in Japan and digitally elsewhere via streaming services) has begun to find its way into the eager hands of fans. Those who managed to obtain the physical edition are particularly happy with the art book&#39;s heretofore-unseen illustrations, with one Lathna fan writing in to praise her cute design. Players are already looking forward to future releases.<\/div><div><br><\/div><div>Okada: Let me extend my heartfelt gratitude to everyone who purchased the Dragalia Lost Song Collection. While I&#39;m sure that many of you bought it for the music, I&#39;m glad to hear that the art book also has its fans, and I hope that anyone interested in seeing rough sketches of their favorite adventurers will give it a look.<\/div><div><br><\/div><div><br><\/div><div>Uchiyama &amp; Asai: In a previous episode, Jun Fukuyama (the Japanese voice actor who plays Ieyasu) requested that the game provide more help (such as boosting the team&#39;s stats) for players coming up against a roadblock during solo play. Also, in response to a player&#39;s suggestion to add more stickers, he offered up two of his own: &quot;Go easy on me!&quot; and &quot;My bad!&quot;<\/div><div><br><\/div><div>Okada: We will take this feedback into account. By the way, I heard that the particular roadblock that Mr. Fukuyama was struggling with was the Legend difficulty of the Agito Uprising. This just so happens to be some of the toughest content available for players to tackle in the game right now, so there&#39;s no shame in struggling with it. I suggest that he makes use of the Suggested Teams feature to see how players before him have overcome this challenge and applies those insights to his own team.<\/div><div><br><\/div><hr><div>Director Okada will continue to reply to the feedback players send via Leave Feedback again in the future. We&#39;re looking forward to hearing your comments. (The feedback featured in the next notification will be chosen from feedback received between July 1 and July 31.)<\/div><div><br><\/div><div>Thank you for playing Dragalia Lost.<\/div>","start_time":1628229600,"prev_article_id":"2354","next_article_id":"2391","image_path":"","update_time":1628126271}}}'