b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":2440,"category_name":"News","pr_category_id":"1","title_name":"Dragalia Lost Director Yuji Okada Responds to Player Feedback (from August 29, 2021)","message":"<div>On August 29, 2021, Dragalia Lost director Yuji Okada replied to feedback players sent via the in-game Leave Feedback feature.<\/div><div><br><\/div><div>This notification contains the contents of an interview with director Okada that was conducted by Yumi Uchiyama and Ayaka Asai, voice actors for the Japanese-language version of Dragalia Lost.<\/div><div><br><\/div><div>Notes:<\/div><div>\\u30fbThe feedback featured in this notification was chosen from that received between July 1 and July 31.<\/div><div>\\u30fbTap Feedback on the game&#39;s title screen to open the Leave Feedback screen.<\/div><div>\\u30fbThe content of the interview has been edited for this notification, so wording may differ from the original conversation.<\/div><div>\\u30fbThe content of the responses is from the time of the interview, so content that is in development may differ by the time of its release in-game.<\/div><div><br><\/div><hr><div>\\u25a0Responses to Feedback from Players<\/div><div>Uchiyama &amp; Asai: We&#39;ve received a request to add the eligible convictions and devotions for each battle in Trials of the Mighty to the schedule that appears in-game. Right now only the bosses are shown, and players have to go out of their way to reference the monthly schedule announcement in the Notices section for this information.<\/div><div><br><\/div><div>Okada: At the moment, both the duration of each battle and the boss that appears are clearly presented in the in-game schedule, but there is indeed no way to check whose convictions and devotions you can earn there, so we will consider ways of improving how this information is presented.<\/div><div><br><\/div><div><br><\/div><div>Uchiyama &amp; Asai: As of this month&#39;s update, all adventurers with the dragondrive mechanic now activate dragondrive when controlled by the game&#39;s AI, and Gala Notte now uses her unique shapeshift (metamorphosis) automatically when controlled by the game&#39;s AI. However, a player wrote in describing a situation in which this automatic shapeshift prevents their Gala Notte from dispelling the enemy&#39;s buffs when necessary, resulting in their team no longer being able to complete the quest. It seems that the choice to enable or disable this quality-of-life change may be better left to each individual player.<\/div><div><br><\/div><div>Okada: I think that this is a positive change overall since it allows these adventurers to shine in their more powerful forms more often when auto-play is enabled, but I can also see how giving control to the AI can result in the problematic situation of not having a specific skill (like one that dispels) at the ready when the team needs it. With that in mind, we will consider adding an option for players to enable or disable this feature as they deem necessary.<\/div><div><br><\/div><div><br><\/div><div>Uchiyama &amp; Asai: A player wrote in to request additional affinity bonuses for wyrmprints, particularly those that provide resistance to the sleep, poison, and blindness afflictions. This would help remedy the disparity in performance that exists in The Agito Uprising between adventurers who can resist only one of the boss&#39;s afflictions and adventurers who can resist both.<\/div><div><br><\/div><div>Okada: While it&#39;s true that some adventurers (particularly Gala adventurers) can resist more than one affliction and thus may be better suited than others for going up against certain bosses, the version 2.11.0 update features new affinity bonuses that will help every adventurer bolster their resistance to a wider variety of afflictions. These new affinity bonuses will be added to both new and existing wyrmprints, so take a look at your collection and see if you can find the right combination for the job!<\/div><div><br><\/div><div><br><\/div><div>Uchiyama &amp; Asai: A player who began playing during the Princess Connect! Re: Dive - A Voracious Visitor event wrote in to say that they joined the game relatively late and therefore missed out on the many anniversary and Gala Dragalia illustrations that were posted to Twitter before they began playing. Would it be possible to collect these old illustrations in one place for posterity, as is the case with the Dragalia Life comics?<\/div><div>&nbsp;<\/div><div>Okada: We&#39;ve amassed quite the collection of amazing art from events, anniversaries, countdowns, and more since the game&#39;s release, so we will consider a way to make it more easily accessible to players who want to see it after the fact.<\/div><div><br><\/div><div><br><\/div><div>Asai: If I may, I&#39;d like to ask a question about the third anniversary. With the big day drawing closer and closer, is there anything that you&#39;re able to share with us about what we can expect for this year&#39;s celebration?<\/div><div><br><\/div><div>Okada: The anniversary celebrations seem to get bigger and bigger every year, and the third will be no different. In addition to various celebratory events, we plan to commemorate the third anniversary with a large-scale story event. Last year, Zethia traveled back in time to battle Morsayati, but this year the story will take place during the current timeline and even be tied to the main campaign. There will be tons of story text to pore over, so I hope you&#39;re ready to read! We&#39;ll cover this and more in an episode of Dragalia Digest in September.<\/div><div><br><\/div><hr><div>Director Okada will continue to reply to the feedback players send via Leave Feedback again in the future. We&#39;re looking forward to hearing your comments. (The feedback featured in the next notification will be chosen from feedback received between August 1 and August 31.)<\/div><div><br><\/div><div>Thank you for playing Dragalia Lost.<\/div>","start_time":1630648800,"prev_article_id":"2456","next_article_id":"2442","image_path":"","update_time":1630460142}}}'