b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":2546,"category_name":"Events","pr_category_id":"4","title_name":"Surtr\'s Devouring Flame Is Coming to Rise of the Sinister Dominion!","message":"<div>Surtr&#39;s Devouring Flame will be added to Rise of the Sinister Dominion on <span class=\\"local_date\\" data-local_date=\\"1635487200\\"><\/span>. Should players manage the titanic task of repelling the demonic menace descending upon North Grastaea, they will be rewarded with the ability to equip new wyrmprints to their weapons!<\/div><div><br><\/div><div>He is the embodiment of rent heavens. A calamity of ruin to the world. He engulfs the earth in flame, spreading death with dogged intent. He holds within his form a warped urge to seek destruction. His words are madness. Babble. Twisted, piercing shrieks. He is the disaster that renders all to calx and dross. He is Surtr! And he will not yield his course until all is returned to ash.<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/80d60577c55e43ab4baa857af14a0674.png\\"><\/div><div><br><\/div><div>Required might for Surtr&#39;s Devouring Flame: Standard (Flame): 22,000<\/div><div>Required might for Surtr&#39;s Devouring Flame: Expert (Flame): 34,000<\/div><div>Required might for Surtr&#39;s Devouring Flame: Master (Flame\/Light): 36,000<\/div><div><br><\/div><div>\\u25a0How to Unlock<\/div><div>Players must complete Chapter 16 \/ 4-6 (Normal) of the main campaign in order to play.<\/div><div><br><\/div><div>\\u25a0New Weapon Slots<\/div><div>Players can use the materials obtained from clearing the quest Surtr&#39;s Devouring Flame to unlock sixth and seventh wyrmprint slots for their water-attuned Agito weapons. Only wyrmprints obtained from Rise of the Sinister Dominion quests (including Surtr&#39;s Devouring Flame) may be equipped in a weapon&#39;s sixth or seventh slot.<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/0ce513848146737c314bfcf226e8f45a.png\\"><\/div><div><br><\/div><div>\\u25a0New Wyrmprints<\/div><div>Players can obtain special wyrmprints from clearing Rise of the Sinister Dominion quests.<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/b6deb1759cd077036e7e903d20c880db.png\\"><\/div><div><br><\/div><div>These special wyrmprints differ from existing wyrmprints in two ways: they may only be equipped in a weapon&#39;s sixth or seventh slot, and upgrading them requires materials that are earned when a duplicate special wyrmprint drops.<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/d6e6ca4c3891ed4a04bec7d242fb2381.png\\"><\/div><div><br><\/div><div>\\u25a0Team Change Mechanic<\/div><div>The quest Surtr&#39;s Devouring Flame: Master features a mechanic that causes the boss to change their elemental attunement mid-battle. When this occurs, players must adapt to this new threat by changing their team, and therefore must prepare two teams of predetermined elemental attunements before embarking on the quest. Be sure that both of your teams are equally ready to take on this challenge!<\/div><div><br><\/div><div>Note: Quests with the Team Change mechanic do not reward Adventurer EXP.<\/div><div><br><\/div><div>Thank you for playing Dragalia Lost.<\/div>","start_time":1635141600,"prev_article_id":"2542","next_article_id":"2555","image_path":"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/80d60577c55e43ab4baa857af14a0674.png","update_time":1634023699}}}'