b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":320,"category_name":"News","pr_category_id":"1","title_name":"Version Update [Addendum]","message":"<div>Update 1.6.0 is now available for download. You may install it right now; otherwise, an automatic update will occur at approximately <span class=\\"local_date\\" data-local_date=\\"1553655600\\"><\/span>.<\/div><div>Note: When you update to version 1.6.0, you will no longer be matched with players using older versions of the game.<\/div><div>With this update, we&rsquo;ve fixed various issues and added and changed some features.<\/div><div>To commemorate the update, we&rsquo;ll be sending all players a Tenfold Summon Voucher. This notice will be modified after they&rsquo;ve been distributed.<\/div><div><br><\/div><div><strong>\\u25a0What&rsquo;s New?<\/strong><\/div><div><br><\/div><div>\\u30fbEquipping two wyrmprints<\/div><div><br><\/div><div>Upon completing Chapter 4 of the main campaign, you will be able to equip a second wyrmprint. When you do, the HP, strength, and abilities of that wyrmprint will be added to the adventurer&#39;s stats.<\/div><div>Note: You cannot equip an adventurer with two of the same wyrmprint.<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/a95968d603a936a782d5c266a3423a0b.png\\"><\/div><div>If the two wyrmprints have abilities of the same effect, the effects will stack. However, there is a limit to the effects obtainable via stacking abilities. You cannot exceed the limit for ability effects, even if the conditions for triggering the abilities differ. This limit does not apply to adventurer, weapon, or dragon abilities.<br><br>If the two wyrmprints have abilities which apply the same buff under the same conditions, those abilities will be considered a single ability. For such abilities, the color of the text and the numerical value indicating the effect&#39;s potency will change. The text color will also change when the limit has been reached.<\/div><div><br><\/div><div><br><\/div><div>\\u30fbAdded co-op room conditions<\/div><div><br><\/div><div>When playing co-op, you&#39;ll be able to create rooms with certain conditions for entry by setting conditions before looking for players. You&#39;ll be able to set element, weapon type, and might as conditions. When creating rooms for raid battles, you will be able to set team element and team might as conditions.<br><br>Note: There is a limit to the might or team might the player creating the room can set, which is based on the might of that player.<br><br>Players will be found from those who selected Find a Room. Whether a player meets the conditions to enter a room will be determined based on the leader of the selected team.<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/af042a8559748ca0e2c92f4ada6cc587.png\\"><\/div><div>Note: Any adventurers and game screenshots shown are still in development.<\/div><div><br><\/div><div><br><\/div><div>\\u30fbFeature change for insufficient materials<\/div><div><br><\/div><div>When you don&#39;t have enough materials for unbinding mana circles, leveling up facilities in the Halidom, or crafting weapons, you&#39;ll be able to remain on those screens and trade without having to go to Treasure Trade in the Shop. If there is a material that can be traded, a trade icon will display on the top right of the icon.<br><br>Note: You will not be able to trade for event materials from facility events or other events.<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/90fd23398b3e573609eaebb0fa864f5f.png\\"><\/div><div>Note: Any adventurers and game screenshots shown are still in development.<\/div><div><br><\/div><div><br><\/div><div>\\u30fbAdded button to change the game speed<\/div><div><br><\/div><div>You can now change the speed of the game (1.2x, 1.5x, and 2.0x) when playing a quest solo. Your game-speed selection will carry over into other quests. The button to change game speed unlocks from Chapter 1 \/ 4-2.<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/c93e208abac8aa6c35e3a6f05e1cd0a9.png\\"><\/div><div><br><\/div><div><br><\/div><div>\\u30fbDamage source display<\/div><div><br><\/div><div>When you receive persistent damage, such as that from afflictions, an icon will now display beside the numerical value to denote the source.<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/ac5ab73f658acdf36cbb2b0a9d0ed21a.png\\"><\/div><div><br><\/div><div><br><\/div><div>\\u30fbDisplay changes for switching teams<\/div><div><br><\/div><div>The team leader&#39;s element will now display on the UI for switching between teams.<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/d98105ff68551a5510fd24bd2c00fbaa.png\\"><\/div><div><br><\/div><div>You can change teams by tapping the team-page icon in co-op rooms as well.<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/9fcc399956485cf28e01ce86e87c4356.png\\"><\/div><div><br><\/div><div><br><\/div><div><strong>\\u25a0Other Changes<\/strong><\/div><div><br><\/div><div>\\u30fbAdded information about bonding with dragons to The Dragon&#39;s Roost under Help.<br>\\u30fbThe on\/off setting for Auto will now always be carried over.<br>\\u30fbIn High Midgardsormr&#39;s Trial, it is no longer possible to avoid the Tattered Sky attack by using a support skill or shapeshifting.<br>\\u30fbIn High Brunhilda&#39;s Trial, it is no longer possible to avoid the Searing Pillar attack by using a support skill or shapeshifting.<br>\\u30fbIn Void Zephyr Strike, it is no longer possible to avoid the Howling Vortex attack by using a support skill or shapeshifting.<br>\\u30fbAdjusted some ability names in conjunction with the changes to wyrmprint functionality.<br>\\u30fbAdjusted the UI on several other screens.<\/div><div><br><\/div><div>[Addendum <span class=\\"local_date\\" data-local_date=\\"1553666400\\"><\/span>]<\/div><div>The following changes were made in a data update at <span class=\\"local_date\\" data-local_date=\\"1553664600\\"><\/span>.<\/div><div><br><\/div><div>\\u30fbChanged the skill name for Ultramarine Knife from Aqua Spiral to Ultramarine Spin.<\/div><div>\\u30fbAdjusted descriptions of abilities that apply buffs to clarify that a buff is applied.<\/div><div><br><\/div><div><strong>\\u25a0Issues Fixed<\/strong><\/div><div><br><\/div><div>The following issues have been fixed in this version:<\/div><div>\\u30fbAfter being disconnected from co-op play and switching to solo play, users sometimes received errors about idling in co-op.<br>\\u30fbSome game elements ceased to work after being disconnected from co-op play.<br>\\u30fbWhen playing co-op, sometimes the enemy&#39;s affliction resistance differed between hosts and guests.<br>\\u30fbWith skills or force strikes enhanced due to skills, if a player used a continue while the skills or force strikes were enhanced, the enhanced state was constantly maintained.<br>\\u30fbWith skills enhanced due to skills, the total damage might not have been displayed.<br>\\u30fbWith skills where there is a time gap before damage is applied, the damage for later attacks that hit was sometimes not added to the total damage.<br>\\u30fbFor bow adventurers, when a skill hit immediately after activating a force strike, sometimes multiple total damage values displayed one after another.<br>\\u30fbDoublebuff abilities sometimes were not triggered due to Last Defense abilities.<br>\\u30fbSometimes the Enemy Wall did not display in the path in Avenue to Fortune: Master.<br>\\u30fbWhen a skill that had a damage shield effect was used, trap damage was not nullified.<br>\\u30fbThe effects of the Fafnir Statue (Flame) and Fafnir Statue (Wind) facilities placed in the Halidom were not applied to the stats displayed on the weapon change screen.<\/div><div><br><\/div><div>[Addendum <span class=\\"local_date\\" data-local_date=\\"1553666400\\"><\/span>]<\/div><div>The following issues were fixed in a data update at <span class=\\"local_date\\" data-local_date=\\"1553664600\\"><\/span>.<\/div><div><br><\/div><div>\\u30fbSometimes the attacks of certain dragons were not registered as hits when attacking near a wall.<\/div><div>\\u30fbWhen Hildegarde (Valentine&#39;s Version) was included in a team under AI control, she would not use Holy Protection unless she took damage.<\/div><div>\\u30fbThe effect for Heinwald&#39;s Abyssal Connection skill did not display correctly.<\/div><div>\\u30fbThe effect for when Blazing Ghost&#39;s Ranged Resistance activates did not display correctly.<\/div><div>\\u30fbThe skill description for Nefaria&#39;s Night of Antiquity skill under Showcase Info for the 5\\u2605 Summon Voucher did not match the description that displays on Nefaria&#39;s skill details page.<\/div><div><br><\/div><div>Note:<br>It may take time for the store to reflect the updated information. Players may not be able to perform updates due to their device&rsquo;s data cache being full. &nbsp;If you are unable to perform the update, restart your device, and then try downloading it from the store.<\/div><div><br><\/div><div>[Addendum <span class=\\"local_date\\" data-local_date=\\"1553655600\\"><\/span>]<\/div><div>As a token of our appreciation, the following item will be sent to players who started playing before <span class=\\"local_date\\" data-local_date=\\"1553655600\\"><\/span>.<\/div><div><br><\/div><div>\\u30fbTenfold Summon Voucher<\/div><div><br><\/div><div>For players who log in before <span class=\\"local_date\\" data-local_date=\\"1554260399\\"><\/span>, this gift can be claimed from your goodie box for up to seven days after logging in.<\/div><div><br><\/div><div>Thank you for playing Dragalia Lost.<\/div>","start_time":1553570100,"prev_article_id":"318","next_article_id":"312","image_path":"","update_time":1553853545}}}'