b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":3256,"category_name":"News","pr_category_id":"1","title_name":"Part Two of Chapter 26: Dragalia Lost Added to the Main Campaign!","message":"<div>Part two of Chapter 26: Dragalia Lost was added to the main campaign on <span class=\\"local_date\\" data-local_date=\\"1658728800\\"><\/span>!<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/f206037c8878dc7b380e062a20ae457a.png\\"><\/div><div><br><\/div><div>All is lost, yet all begins ever anew.<br><br>The game&#39;s story has reached its conclusion with the addition of part two of chapter 26 of the main campaign. We hope you&#39;re looking forward to finishing the final chapter!<br><br>\\u25a0Regarding the Boss at the End of the Chapter<br>Damage dealt to the boss in a single attack that exceeds a certain amount will be reduced through the use of the boss&#39;s special ability. The boss may also take reduced damage after entering a special state that cannot be removed by effects that dispel buffs, or entering a state that reduces damage from all but certain attacks.<br><br>\\u25a0Regarding Quest Cutscenes<br>If the &quot;Automatically Skip Repeat Scenes&quot; option is enabled in the game&#39;s settings, event cutscenes for the main campaign Chapter 26 quests &quot;The Consummate Creator&quot; and &quot;Fight for Humanity&quot; will be skipped from your second playthrough onward. If you would like to view these cutscenes again in subsequent playthroughs, please disable the &quot;Automatically Skip Repeat Scenes&quot; option beforehand.<br><br>\\u25a0Notes<br>1. Part two of Chapter 26 of the main campaign will unlock when you clear Ch. 26 \/ 3-3 &quot;The Rejected.&quot;<br>2. The release of part two does not include additional dragons who can be unbound using draconic essences, but you can use the draconic essence icon displayed on the area map for each chapter in the main campaign to check the dragon whose draconic essence you can obtain, how many draconic essences you currently have, how many more you can obtain, and the quests from which you can obtain draconic essences.<br>3. Main campaign Ch. 26 \/ 5-5 &quot;Fight for Humanity&quot; is only available on Normal difficulty.<br><br>Thank you for playing Dragalia Lost.<\/div>","start_time":1658728800,"prev_article_id":"3255","next_article_id":"2991","image_path":"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/f206037c8878dc7b380e062a20ae457a.png","update_time":1658471595}}}'