b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":410,"category_name":"News","pr_category_id":"1","title_name":"New Information About the Fire Emblem: Lost Heroes Event!","message":"<div>Here&#39;s some new information regarding the Fire Emblem: Lost Heroes event, detailing a new event format called defensive battles, and introducing Alfonse, a 5\\u2605 adventurer who appears in the event.<\/div><div><br><\/div><div>\\u25a0New Event Format<\/div><div>Defensive battles are here! Work together in co-op to cover ground and protect the castle gate.<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/9ac12c687db6c22f01e2c27a16aed0f4.png\\"><\/div><div><br><\/div><div>\\u25a05\\u2605 Adventurer, Alfonse<\/div><div>Alfonse, the first prince of Fire Emblem Heroes&#39; Askran Kingdom, has arrived in the world of Dragalia Lost!<\/div><div>Alfonse, who has the power to open gates to other worlds, will temporarily join your roster as you participate in the event. Gain friendship with him to recruit him for good!<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/5c69b39e5b5ece48ae8ebc6e18e248f6.png\\"><\/div><div><br><\/div><div>\\u30fbWhen you complete quests with Alfonse in your team as a temporary adventurer, you will increase your friendship.<\/div><div>\\u30fbIf you maximize your friendship with him during the event, he will permanently join your roster.<\/div><div>\\u30fbIf he permanently joins your roster, you will be able to include him in your team after the event ends.<\/div><div>\\u30fbIf he permanently joins your roster, his level, stats, equipment, and position in your team and collection will be maintained.<\/div><div><br><\/div><div>Note: Even if he isn&#39;t permanently added to your collection, any items used to upgrade his level and unlock his mana circle will not be returned.<\/div><div><br><\/div><div>\\u25a0Event Duration<\/div><div>After the maintenance starting at <span class=\\"local_date\\" data-local_date=\\"1556247600\\"><\/span> to <span class=\\"local_date\\" data-local_date=\\"1557813599\\"><\/span><\/div><div><br><\/div><div>We hope you&#39;re looking forward to the start of the event!<\/div><div><br><\/div><div>Thank you for playing Dragalia Lost.<\/div>","start_time":1555642800,"prev_article_id":"403","next_article_id":"389","image_path":"","update_time":1555557996}}}'