article_id:1318,category_name:公告,title_name:廣播庭園「意見箱」來信回覆（5/3播出內容）,image_path:,message:<div>各位玩家您好</div><div><br></div><div>在5月3日於日本文化放送播出的廣播節目「內山夕實‧朝井彩加的Dragalia Lost 廣播庭園」中，岡田執行總監對透過遊戲內「意見箱」來信的玩家進行回覆。</div><div><br></div><div>本公告將為各位介紹節目中的訪問內容，以及岡田執行總監對玩家來信的回覆。</div><div><br></div><div>※「意見箱」請從遊戲標題畫面進入。</div><div>※本公告是根據節目播出內容來進行調整，部分呈現內容與實際播出內容有所差異。</div><div>※回答內容為節目播出當時的開發內容，與實際遊戲內容可能有所差異。</div><div><br></div><hr><div>■關於「意見箱」的來信回覆</div><div>──首先，想請問只要是「Dragalia Lost ～失落的龍絆～」的玩家，都可以透過「意見箱」來信嗎？</div><div>岡田：沒錯，所有玩家都可以從遊戲標題畫面右下方的按鈕來信。今天我想從玩家們的眾多來信中針對部分問題進行回覆。</div><div><br></div><div>──那麼，就來看看是什麼問題吧。有許多玩家來信提到製作‧分解武器的步驟過於繁瑣，今後是否會進行調整呢？</div><div>岡田：是的。雖然目前尚在開發中，但我們已在規劃從根本調整武器的製作‧升級‧分解系統。目前武器的種類繁多，剛加入遊戲的玩家可能會不知道該如何著手進行製作。雖然目前還無法詳細說明，但我們期望能讓玩家清楚地判斷自己應該製作哪一把武器、並提升武器的改造性。大規模更新的開發所需時間較長，請玩家們耐心等候。我們也會讓玩家已製作的武器和獲得的素材不會變得毫無價值。</div><div><br></div><div>──話說武器可以進行分解也可以出售，您比較推薦哪一種方式呢？</div><div>岡田：因人而異。如果擁有較多盧比的話可以分解武器獲得素材。反之則是建議出售武器交換成盧比。</div><div><br></div><div>──也就是依玩家狀況而異吧。感謝您的回答。</div><div><br></div><div>──接下來的問題是，請問有在考慮增加隊伍的編制數量嗎？</div><div>岡田：這部分我們也將從根本進行調整。以能夠提供玩家更深入的編制內容為目標開發中。未來有增加欄位，也可以進行更細微的設定的構想。</div><div><br></div><div>就像最近追加的新要素「連鎖EX能力」 ，營運團隊希望能帶給玩家編制的樂趣，然而目前的欄位數和管理方式卻有不便之處，因此將針對這部分進行開發與調整。</div><div><br></div><div>──個人希望可以讓角色綁定龍輝護符和武器呢。</div><div>岡田：這樣啊，這個意見讓我轉達給營運團隊吧（笑）</div><div><br></div><div>──謝謝您！</div><div><br></div><div>──接下來是有關難易度的問題。有玩家提到希望能夠調降難易度，反之也有玩家希望提高難易度，關於這個問題請問您有什麼看法呢？</div><div>岡田：我們確實收到了許多關於難易度的意見，有人覺得目前的內容過於簡單想要挑戰更強的敵人，也有人認為難易度偏高希望可以追加一些容易上手的任務。我們已在規劃能夠滿足不同需求玩家的內容。</div><div><br></div><div>──因為每位玩家開始遊戲的時期不同，對新加入的玩家來說確實門檻較高呢。</div><div>岡田：對從營運初期就加入遊戲的玩家，以及投入許多心血的玩家來說，現在的遊戲內容的確有無法滿足他們的地方。營運團隊已在準備增加現有任務的難易度，此外，雖然會花上較多時間，但我們也預計增加其他內容，提供各種難易度的要素給各位玩家。</div><div><br></div><div>──接下來是關於遊戲容量的意見。玩家想詢問是否能夠再縮減遊戲容量呢。</div><div>岡田：關於遊戲容量我們也收到了很多相關意見，其實我們至今已經多次針對容量進行調整，但由於活動內容不斷增加，遊戲容量也隨之變得龐大。我們仍會持續進行縮減的調整。</div><div><br></div><div>──也有像是瑪納之環變成2D畫面這樣的意見呢。</div><div>岡田：剛開始進入瑪納之環的頁面時還好，但多次進入和切換時就會出現卡頓現象，在較舊型的裝置上也會發生遲緩。2D畫面就是為了改善這些現象，讓玩家能夠更順暢進行遊戲。</div><div><br></div><div>──接下來還收到了關於教官獎勵的各式意見呢。</div><div>岡田：我們收到了很多教官獎勵的意見，像是無法順利進行配對，完成每週課題很花時間等等。在版本更新中，我們已將教官獎勵加入製作房間時的條件，今後也將視情況調整。</div><div><br></div><div>只是，遊戲數據顯示目前仍有許多玩家尚未完成「真‧龍族的試煉」，因此我們認為有必要協助且引導玩家完成這些任務，並知道當下的目標。</div><div><br></div><div><br></div><div>──機會難得，接下來想要介紹來自廣播節目聽眾和我們的問題。我們希望可以提升設施的Lv上限。</div><div><br></div><div>岡田：這的確是個熱門話題，我們已在4月的版本更新中將盧比礦山和各屬性設施的Lv上限提升至Lv.40。今後也將視整體狀況解鎖Lv上限。</div><div><br></div><div>──希望可以透過交換方式獲得稀有度高的寶珠。</div><div>岡田：這個意見讓我帶回去和營運團隊討論（笑）。這一點我們也會視狀況納入考慮。</div><div><br></div><div>──還有一個問題，編制隊伍時4名角色的排序是否有需要特別注意的地方呢？</div><div>岡田：角色的排序目前雖然影響不大，但是在今後的版本更新中，排在第1位的隊長角色將可以裝備其他角色的技能，今後編制在隊伍的第1位角色將會很重要。</div><div><br></div><div>──關於遊戲的主線劇情，可以稍微透露一些精彩之處嗎？</div><div>岡田：預定將於6月公開的劇情第14章將會是重要的轉折，敬請期待。之前在【本月的「Dragalia Lost ～失落的龍絆～」】也有提過，第14章將會有1名新的角色加入夥伴。</div><div><br></div><hr><div>今後，岡田執行總監將持續透過節目單元回答來自玩家的問題和意見，歡迎各位玩家透過「意見箱」踴躍來信。</div><div><br></div><div>今後也請您繼續支持【Dragalia Lost ～失落的龍絆～】<br>Dragalia Lost ～失落的龍絆～ 營運團隊　敬上</div>,start_time:1589436000,update_time1589417983