article_id:2027,category_name:公告,title_name:廣播庭園「意見箱」來信回覆（2/21播出內容）,image_path:,message:<div>各位玩家您好</div><div><br></div><div>在2月21日於日本文化放送播出的廣播節目「內山夕實‧朝井彩加的Dragalia Lost 廣播庭園」中，岡田執行總監對透過遊戲內「意見箱」來信的玩家進行回覆。</div><div>※本次回覆於1/1～1/31期間收到的玩家來信。</div><div><br></div><div>本公告將為各位介紹節目中的訪問內容，以及岡田執行總監對玩家來信的回覆。</div><div><br></div><div>※「意見箱」請從遊戲標題畫面進入。</div><div>※本公告是根據節目播出內容來進行調整，部分呈現內容與實際播出內容有所差異。</div><div>※回答內容為節目播出當時的開發內容，與實際遊戲內容可能有所差異。</div><div><br></div><hr><div>■未能於2月5日播出的YouTube Live「龍絆廣播老師請解惑！出差版」中介紹的來信回覆</div><div>──「總覺得各活動的劇情內容是為了說明主線劇情中未能提及的部分，或是在補完『Dragalia Lost ～失落的龍絆～』的世界觀細節，是我想太多了嗎？」</div><div><br></div><div>岡田：龐大的「Dragalia Lost ～失落的龍絆～」的整體世界觀，例如日初之國等只有在活動中提到的地區和種族，光透過主線劇情實在難以完全說明。</div><div>像是北格拉斯迪亞大陸的北方還有軍隊，在設計相關活動時營運團隊會考量到該內容是否觸及主線劇情的核心，以及這些設定是否能於主線劇情中獲得應用、讓活動角色得以在主線劇情登場等細節。</div><div>不過，若是在活動中過度解釋世界觀的細節，將會使主線劇情的定義變得模糊，我們正在調整這部分的平衡。</div><div>但是由於遊戲一週年和二週年所舉辦的團體活動「克羅諾斯～輪迴命運的時針～」和「失落的歷史～被遺落的真相～」內容深觸主線劇情的核心，因此這兩個活動也於舊趣活動中登場讓玩家可以隨時遊玩。</div><div><br></div><div>──「小狗狗什麼時候才會實裝？」</div><div><br></div><div>岡田：去年4月1日限定公開的任務「聖城汪汪同樂天！」中登場的狗狗，玩家可於該任務中帶狗狗散步，並調整鏡頭視角從各種角度觀賞狗狗與角色。</div><div>這些功能今後也有可能以其他形式於遊戲中登場。</div><div><br></div><div><br></div><div>■關於「意見箱」的來信回覆</div><div>【關於失落的歷史〜摩特米塞亞大討滅戰〜】</div><div>──「營運團隊辛苦了，新實裝的『失落的歷史〜摩特米塞亞大討滅戰〜』中可獲得道具進行大幅的育成強化，但任務的難易度感覺卻與『咢牙叛逆戰 絕級』相差不遠。對無法完成『失落的歷史〜摩特米塞亞大討滅戰〜』獲得這次追加的強化所需道具的休閒玩家而言實在很苦惱。希望也能透過其他任務獲得相關道具。」</div><div><br></div><div>岡田：此任務的必須戰力為40000，適合戰力已強化到一定程度的玩家。關於本次任務中所追加的道具，我們將會評估讓玩家也可於其他任務中獲得。</div><div><br></div><div>【關於阿爾貝利亞競技大亂鬥】</div><div>──「在『阿爾貝利亞競技大亂鬥』中，當持有專用技能的「晴明」角色造型的玩家和其他2名持有其他一般角色造型的玩家三方對立時，可能會出現攜手合作針對「晴明」的狀況。其中一名角色特別強大時造成的戰況起伏會讓人出乎意料。若今後持續增加持有強大專用技能的角色，將有可能限制選擇一般造型時的自由度，導致武器種類之間的平衡失去意義。想要了解專用技能是否為期間限定等今後的方向性。</div><div><br></div><div>岡田：當3人分別出現要優先打倒誰的想法時，只要其中2人達成共識就會出現這樣的局面。</div><div>今後將不會頻繁地追加像本次的「晴明」這樣持有專用技能的角色，也會進行調整讓專用技能不會過於強大。</div><div>此外，營運團隊也將會持續關注各武器種類的勝率，每個月根據狀況進行調整。</div><div>雖然今後將會有各種專用技能登場，但我們會重視遊戲平衡，讓玩家更能享受其中的樂趣。</div><div><br></div><div>【關於相關活動】</div><div>──「我是『Dragalia Lost ～失落的龍絆～』的玩家！我有一些關於「遺跡的試煉」、「龍族的試煉」和「狄亞內魯帝國迎擊戰」等的角色育成掉落2倍活動增加成3倍、追加能獲得「奧利哈鋼」的交換所和活動的建議。對剛開始遊戲的玩家而言這些都是很容易短缺的道具，就算是在特定期間或是期間限定舉辦也沒有關係，希望營運團隊可以納入考量。」</div><div><br></div><div>岡田：感謝這位聽眾的寶貴意見。</div><div>關於掉落3倍活動，今後將會於特別的時機舉辦。</div><div>建議玩家也可以透過目前所舉辦的每日掉落2倍活動的任務獲得道具。</div><div>而「奧利哈鋼」等部分原本就很稀少且獲得難易度高的道具，我們將會考慮調整獲得方式，讓玩家可以透過交換所或活動獎勵取得。</div><div><br></div><hr><div>今後，岡田執行總監將持續透過節目單元回答來自玩家的問題和意見，歡迎各位玩家透過「意見箱」踴躍來信。</div><div>※下一次將回覆於2/1～2/28期間收到的玩家來信。</div><div><br></div><div>今後也請您繼續支持【Dragalia Lost ～失落的龍絆～】</div><div>Dragalia Lost ～失落的龍絆～ 營運團隊　敬上</div>,start_time:1614837600,update_time1614823402