article_id:1438,category_name:公告,title_name:廣播庭園「意見箱」來信回覆（6/28播出內容）,image_path:,message:<div>各位玩家您好</div><div><br></div><div>在6月28日於日本文化放送播出的廣播節目「內山夕實‧朝井彩加的Dragalia Lost 廣播庭園」中，岡田執行總監對透過遊戲內「意見箱」來信的玩家進行回覆。</div><div><br></div><div>本公告將為各位介紹節目中的訪問內容，以及岡田執行總監對玩家來信的回覆。</div><div><br></div><div>※「意見箱」請從遊戲標題畫面進入。</div><div>※本公告是根據節目播出內容來進行調整，部分呈現內容與實際播出內容有所差異。</div><div>※回答內容為節目播出當時的開發內容，與實際遊戲內容可能有所差異。</div><div><br></div><hr><div>■關於「意見箱」的來信回覆</div><div>──首先是關於上一次團體活動中育成「悟空」時所使用的「信念」的意見。「使用在活動中獲得的素材進行瑪納之環解鎖的新系統很不錯，希望今後也能繼續沿用！」</div><div>岡田：新的育成系統「信念」受到許多玩家的好評，在今後的活動中也有計畫繼續使用。受到玩家好評的原因，主要是育成道具「信念」可以在活動期間內獲得，因此可以不用在活動角色「悟空」身上使用遊戲內既有的育成道具。還有藉由育成能讓「悟空」在活動期間內確實地變強。「悟空」擁有的活動特殊能力，使其在挑戰「ULTIMATE」等難易度較高的任務時被廣泛使用。確實地育成「悟空」並使用「悟空」打倒BOSS，相信這讓玩家們對活動的滿足感也提高了。</div><div><br></div><div>──關於「共享技能」則是收到了玩家表示「雖然能夠拓展戰略的幅度，但因為任何角色都能使用回復技能，而使回復角色的活躍機會相對減少。」的意見。</div><div>岡田：關於「共享技能」，營運團隊也確實和玩家有過相同的想法 ，但是現階段從遊戲資料來看，回復角色的使用率並沒有明顯減少的趨勢。而且回復角色在高難易度的任務中仍有一定的需求，因此目前回復角色仍有一定的登場機會。</div><div><br></div><div>──也有玩家提到「雖然在迴避動作中加上無敵時間是好事，但只要連續滑動就能持續保持在無敵狀態，希望可以進行調整讓迴避動作無法連續使用。」</div><div>岡田：這部分營運團隊也有進行討論，為了讓更多的玩家容易挑戰各種任務，而決定使用現在的機制。今後我們也將準備以此機制為前提的高難易度任務，由於光靠迴避是無法破關的，增加迴避的手段能擴大玩家進行遊戲時的玩法。</div><div>與過去相同，當敵人發動紅色行動標記的攻擊的同時使用技能，技能發動期間將可迴避攻擊，紫色標記的攻擊則是必須藉由移動到標記範圍外來迴避攻擊（※部分情況例外），相較之下迴避的方式變得更多。不過，將整體任務的難易度降低，對過去已透過這些方式進行攻略的玩家來說可能會不夠過癮，今後追加的新內容將會對此有所調整，敬請期待。</div><div><br></div><div>──也有玩家提到希望可以提高「盧比」和「瑪納」的持有上限。</div><div>岡田：關於這個部分目前正在進行開發，時機到了預計會在版本更新公告通知各位玩家。</div><div><br></div><div>──同時，也有玩家表示希望能夠增加「武器」、「護符」以及「龍族」的「持有欄位」。</div><div>岡田：在日前的版本更新中，已經增加所有玩家的「武器」、「護符」和「龍族」的持有欄位。藉由本次調整，相信可以多少解決玩家在進行整理的困擾。</div><div><br></div><div>──還有玩家提出「召喚券1次只能使用1張太耗費時間，希望可以同時使用複數召喚券」的意見。</div><div>岡田：這項功能目前也正在進行開發，還請各位耐心等候。</div><div><br></div><div>──接下來，是來自我們的問題。在遊戲中「聖城」一直處於白天的狀態，希望可以加入到了實際時間晚上6點之後「聖城」也會進入夜晚狀態的小變化！如果到了晚上設施能夠發光，或是有燈飾的話，說不定能夠提高玩家在晚上上線的頻率呢！</div><div>岡田：感謝妳們的意見（笑）。</div><div><br></div><div>──最後，再介紹一封來自聽眾的來信。</div><div>「我最喜歡可愛又活潑的西莉絲。然而很可惜的在主線劇情中她的登場機率並不高，而且又是龍絆日限定的角色，有許多玩家都無法擁有這位角色。一想到有許多人不能在遊戲中使用西莉絲就覺得萬分可惜。為了讓更多人可以感受到西莉絲的魅力，希望營運團隊可以考慮增加她在主線劇情中的活躍度，並以劇情角色的方式發送給各位玩家。」</div><div>岡田：「西莉絲」是位很重要的角色，感謝這位聽眾提出的寶貴意見。</div><div><br></div><hr><div>今後，岡田執行總監將持續透過節目單元回答來自玩家的問題和意見，歡迎各位玩家透過「意見箱」踴躍來信。</div><div><br></div><div>今後也請您繼續支持【Dragalia Lost ～失落的龍絆～】</div><div>Dragalia Lost ～失落的龍絆～ 營運團隊　敬上</div>,start_time:1594188000,update_time1594171064