article_id:1499,category_name:公告,title_name:廣播庭園「意見箱」來信回覆（8/2播出內容）,image_path:,message:<div>各位玩家您好</div><div><br></div><div>在8月2日於日本文化放送播出的廣播節目「內山夕實‧朝井彩加的Dragalia Lost 廣播庭園」中，岡田執行總監對透過遊戲內「意見箱」來信的玩家進行回覆。</div><div>※本次回覆於6/12～7/5期間收到的玩家來信。</div><div><br></div><div>本公告將為各位介紹節目中的訪問內容，以及岡田執行總監對玩家來信的回覆。</div><div><br></div><div>※「意見箱」請從遊戲標題畫面進入。</div><div>※本公告是根據節目播出內容來進行調整，部分呈現內容與實際播出內容有所差異。</div><div>※回答內容為節目播出當時的開發內容，與實際遊戲內容可能有所差異。</div><hr><div>■關於「意見箱」的來信回覆</div><div>──有玩家來信提到「我解鎖了耶魯菲莉絲（萬聖節Ver.）的瑪納之環第6層，但技能量條卻很難蓄集，感覺傷害量也沒有太大的改變，讓人很失望。」</div><div>岡田：營運團隊收到了許多玩家的反應，表示解鎖「耶魯菲莉絲（萬聖節Ver.）」瑪納之環第6層之後，原本該角色的戰鬥特色和樂趣都有所減弱，因此在日前的【本月的「Dragalia Lost ～失落的龍絆～」】公告中，我們已向玩家宣布將會對「耶魯菲莉絲（萬聖節Ver.）」再度進行調整，使其技能量條能更加容易蓄集，並保持過去的操作感。但是調整後的「耶魯菲莉絲（萬聖節Ver.）」是根據賦予自身的新增益效果來使技能量條變得容易蓄集，該如何維持這增益效果將是關鍵。</div><div><br></div><div>──看來營運團隊收到了許多關於「耶魯菲莉絲（萬聖節Ver.）」的意見呢。</div><div>岡田：我們收到了不少關於遊戲平衡和數值的相關意見，其中包含了許多跟「耶魯菲莉絲（萬聖節Ver.）」瑪納之環第6層有關的建議。</div><div>在正常情況下，營運團隊基本上不會進行修正，但本次真的收到了許多玩家的意見，於是破例進行調整。非常感謝玩家們提供寶貴的意見，雖然無法全數採用，但都將成為今後進行遊戲平衡等調整時的參考。</div><div><br></div><div>※「耶魯菲莉絲（萬聖節Ver.）」再次調整詳情，請參考<a href="https://dragalialost.com/cht/news/detail/1498">此公告</a>。</div><div><br></div><div>──還有玩家來信表示「迎擊戰的龍化限定任務雖然很有趣，但只限定單人模式且必須多次反覆攻略，在無法使用Skip券和自動再戰的情況下實在很辛苦。希望也可以追加團隊遊戲模式。</div><div>岡田：關於從6月開始舉辦的新活動「迎擊戰」，營運團隊也收到了許多相關的意見。</div><div>我們根據玩家的建議，對7月「防衛戰」活動的獎勵進行了調整，而且玩家也能以團隊遊戲模式進行「防衛戰任務」。</div><div>今後我們也將以提供玩家更好的遊戲環境為目標，持續改善並追加「迎擊戰」與「防衛戰」的相關功能與內容。</div><div>調整內容詳情將於日後另行公告，還請玩家們稍候。</div><div><br></div><div>──還收到了「希望可以每2個月重置1次法夫納幣的交換限制。新角色持續登場，可解放瑪納之環第6層的角色也越來越多，英雄之證完全不夠用。」這樣的意見呢。</div><div>岡田：營運團隊也正在考慮追加和更新法夫納幣交換所的交換列表。</div><div><br></div><div>──「可解放瑪納之環第6層的角色日漸增加，在遊戲中很難分辨究竟哪些角色可以解放第6層。希望可以在排序篩選時追加可解放第6層角色的選項。」也收到了這樣的意見呢。</div><div>岡田：關於這部分，我們正在調整開發的時機。</div><div>雖然瑪納之環全部解鎖的角色與未全部解鎖的角色，瑪納之環的數字顏色會有所不同，但這確實有點難以分辨，我們正在討論該如何改善這個部分。</div><div><br></div><div>──此外，也有「在日前的版本更新中所增加的編制隊伍欄位，確實讓編制上變得更加便利。但由於欄位增加，若想移動已經設定好的隊伍就得從頭開始設定，相當辛苦。若可以追加複製隊伍或調整排序的功能就好了。」這樣的聲音。</div><div>岡田：我們正在進行調整，讓編制隊伍時能夠使用複製和排序功能，還請玩家們稍候。</div><div><br></div><div>──然後，這次我們也想要提問。「Dragalia Lost ～失落的龍絆～」即將於9月迎接2週年，想請問營運團隊有什麼計畫嗎？</div><div>岡田：為了迎接即將到來的2週年，營運團隊正在籌備大型更新以及相關活動等內容，隨著2週年的接近，日後我們也將帶來更多相關情報。今年的週年慶內容將會比去年更加豐富，敬請期待。</div><hr><div>今後，岡田執行總監將持續透過節目單元回答來自玩家的問題和意見，歡迎各位玩家透過「意見箱」踴躍來信。</div><div>※下一次將回覆於7/6～7/31期間收到的玩家來信。</div><div><br></div><div>今後也請您繼續支持【Dragalia Lost ～失落的龍絆～】</div><div>Dragalia Lost ～失落的龍絆～ 營運團隊　敬上</div>,start_time:1596780000,update_time1596708074