article_id:1743,category_name:公告,title_name:廣播庭園「意見箱」來信回覆（10/25播出內容）,image_path:,message:<div>各位玩家您好</div><div><br></div><div>在10月25日於日本文化放送播出的廣播節目「內山夕實‧朝井彩加的Dragalia Lost 廣播庭園」中，岡田執行總監對透過遊戲內「意見箱」來信的玩家進行回覆。</div><div>※本次回覆於9/1～9/30期間收到的玩家來信。</div><div><br></div><div>本公告將為各位介紹節目中的訪問內容，以及岡田執行總監對玩家來信的回覆。</div><div><br></div><div>※「意見箱」請從遊戲標題畫面進入。</div><div>※本公告是根據節目播出內容來進行調整，部分呈現內容與實際播出內容有所差異。</div><div>※回答內容為節目播出當時的開發內容，與實際遊戲內容可能有所差異。</div><div><br></div><hr><div>■關於「意見箱」的來信回覆</div><div><br></div><div>【關於龍輝護符】</div><div>──「這次更新中變更了武器系統，雖然一開始有點摸不著頭緒，但是習慣之後覺得強化變得更加容易了。對剛開始遊戲的人來說也較為易懂。但是，1把武器可以裝備5張龍輝護符，導致每次更換武器都要重新裝備龍輝護符，實在有點麻煩。希望可以追加記憶武器裝備的龍輝護符的功能，或是可以登錄龍輝護符組合的功能。此外，龍輝護符實在很難找，希望可以有在排序中篩選連組，或是以關鍵字搜尋等的功能」這次收到了這樣的意見呢。</div><div><br></div><div>岡田：關於龍輝護符的裝備，玩家來信的意見我們也有進行考量，但是開發的調整進度趕不上在10月的版本更新中導入。</div><div>近期的更新中預計會追加登錄龍輝護符組合的功能。</div><div>此外，也將會對排序項目進行調整。</div><div>除了連組的排序部分之外，由於目前的排序項目和實際龍輝護符的效果有所差異，我們也預計進行調整，使龍輝護符更為容易搜尋。</div><div><br></div><div>【關於阿爾貝利亞競技大亂鬥】</div><div>──有玩家來信提到「阿爾貝利亞競技大亂鬥很有趣！但是我有幾個建議。首先是希望可以調整根據排名可獲得的競技點數幅度，還有追加可以和同盟及戰友進行配對的系統。此外，若能讓稀有敵人登場或許也很有趣。期待今後不斷更新的阿爾貝利亞競技大亂鬥」的建議。</div><div><br></div><div>岡田：感謝眾多玩家每天對「阿爾貝利亞競技大亂鬥」的熱情參與和支持。</div><div>由於這是PvP（玩家對戰）項目，營運團隊將會參考目前各位玩家的戰鬥紀錄，檢討相關平衡性的調整。今後將會逐步進行更新，例如可以變更可龍化的龍族等內容。</div><div>雖然目前只能龍化成★4龍族「耶夢加得」，但今後除了有攻擊技能的龍族之外，也會有擁有回復技能的龍族等不同類型的龍族，相信戰鬥方式也將會有所改變。</div><div>此外，我們也預計調整獎勵等內容，並增加角色造型。</div><div><br></div><div>【關於盧比】</div><div>──「恭喜失落龍絆二週年，也感謝營運團隊在大型版本更新中進行了眾多改善。不過，製作武器時所需的盧比數量也變多了。在高難易度內容所需要的能量和共鬥之翼減少的情況下，雖然可以接受這種程度的增漲，但由於漲幅過大所以無論挑戰哪個項目都需要使用黃金法夫納，導致無法使用其他龍族有點可惜」也有這樣的意見呢。</div><div><br></div><div>岡田：關於這部分也有在公告進行說明。部分武器所需要的盧比數量比過去高，未能於事前告知玩家我們深感抱歉。</div><div>本次的系統變更內容眾多，遊戲的難易度產生了變化，因此隨之調整了盧比的所需數量。</div><div>由於目前的遊戲平衡將會比過去更需要盧比，今後營運團隊將會透過提高活動舉辦頻率以及贈送等方式，增加玩家獲得盧比的管道。</div><div><br></div><div>【關於難易度「絕級」】</div><div>──這次也收到了「雖然對各種任務進行平衡調整後緩和了遊戲難度，但也希望營運團隊可以好好規劃難易度較高且具有挑戰性的任務。像是「真‧龍族的試煉」的「真‧耶夢加得」中部分攻擊似乎開始顯示行動標記，希望在新的高難易度任務中不要這樣做。「絕級」請貫徹高難易度的宗旨，不要套用可以自動模式完成任務的模式」的意見。</div><div><br></div><div>岡田：關於「咢牙叛逆戰」的難易度「絕級」，雖然在習慣操作前會陷入苦戰，但營運團隊預計將單人模式設計成只要備妥戰力就能破關。</div><div>團隊遊戲的難易度則預計會相當困難。</div><div>大致上會像是首次挑戰「真‧龍族的試煉 超級」時的那種感覺，歡迎對自身實力有信心的玩家進行挑戰。</div><div>此外，現階段並沒有緩和難易度「絕級」難度的計畫。</div><div>完成絕級雖然不會讓戰力大幅提升，但正如10月的【本月的『Dragalia Lost ～失落的龍絆～』】所提到的，透過「絕級」獲得的素材可用來強化咢牙系列武器外觀，並賦予變化。</div><div>此外，也可以獲得「別稱」，能在團隊遊戲房間等處展示給其他玩家知道。</div><div><br></div><div>【關於團隊遊戲】</div><div>──「取消教官獎勵系統後，希望可以有其他的團隊遊戲支援方式。現階段的部分任務要配對較不易，希望營運團隊可以進行改善，讓更多人參與團隊遊戲。」</div><div><br></div><div>岡田：雖然還無法告知詳情，但是我們有在考慮對團隊遊戲的房間顯示和募集方法等內容進行變更，以符合目前募集上的需求。還請各位玩家耐心等候。</div><div><br></div><hr><div>今後，岡田執行總監將持續透過節目單元回答來自玩家的問題和意見，歡迎各位玩家透過「意見箱」踴躍來信。</div><div>※下一次將回覆於10/1～10/31期間收到的玩家來信。</div><div><br></div><div>今後也請您繼續支持【Dragalia Lost ～失落的龍絆～】</div><div>Dragalia Lost ～失落的龍絆～ 營運團隊　敬上</div>,start_time:1604037600,update_time1604022462