article_id:1803,category_name:公告,title_name:關於「Dragalia Lost ～失落的龍絆～」二週年問卷調查,image_path:,message:<div>各位玩家您好</div><div><br></div><div>我是「Dragalia Lost ～失落的龍絆～」的執行總監岡田。</div><div>感謝各位玩家踴躍參與本次「Dragalia Lost ～失落的龍絆～」問卷調查活動。</div><div><br></div><div>本次問卷調查我們收到了眾多玩家的作答，獲得了來自不同方面的觀點和意見。</div><div>其中大約有6成是從遊戲上線初期就開始支持我們的玩家。</div><div>而其餘4成作答中，遊玩經歷1年半、1年、半年的玩家人數占比幾乎相同。</div><div><br></div><div>另外，這次也得到了許多來自海外的玩家意見。</div><div>藉由本次機會營運團隊再次感受到了世界各地的玩家對「Dragalia Lost ～失落的龍絆～」的支持。</div><div><br></div><div>和意見箱一樣，我們會閱讀每一封來自玩家的寶貴建議。這些意見和建議都將作為今後遊戲營運時的參考。</div><div>以下為我們所統整的本次問卷答覆內容。</div><div><br></div><hr><div><br></div><div>■關於問題「我們已對眾多角色和龍族進行數值上的調整，並同時調整任務的部分難易度。請告訴我們關於本調整之寶貴意見。」</div><div><br></div><div>‧在版本2.0.0中，我們為了緩和屬性之間的強度差距進行了調整，對此收到了「能夠使用更多不同的角色組合挑戰各項任務」等意見，整體而言以好評居多。</div><div>然而，遊戲中仍存在著僅有滿足特定條件的角色才能大顯身手的情況，重視效率的團隊模式也有「未使用特定角色就無法挑戰任務」的傾向。</div><div>今後營運團隊也將以改善這些狀況為目標，提供角色們活躍的機會。</div><div><br></div><div>‧有玩家提到想知道「今後瑪納之環第6層的解鎖頻率」。</div><div>由於版本2.0.0的更新中對整體數值進行了調整，今後將會放緩瑪納之環第6層的解鎖速度。</div><div>對於這個部分，我們將會在推出新的任務和高難度BOSS時進行適當的調整。</div><div><br></div><div>‧我們也收到了｢希望可以提升龍族性能的多樣性｣的建議。</div><div>與角色相比，目前龍族的推出頻率確實較低，且能力和龍化技能大多偏向攻擊方面。</div><div>我們將會把提升多樣性這點列入今後的考量。</div><div><br></div><div>‧關於任務難易度的緩和以及敵人攻擊辨識上的調整，整體而言獲得了多數玩家的好評。</div><div><br></div><div>‧單人模式難易度和獎勵內容方面得到了玩家的正面評價。</div><div>這部分的調整讓戰力未能挑戰團隊模式的玩家，或是沒有時間挑戰的玩家也能夠輕易進行育成。</div><div>　</div><div>‧也有許多玩家提到「『真‧龍族的試煉』等任務難易度降低後，遊戲中所顯示的推薦戰力和實際可過關的戰力有所差距」的意見。</div><div>由於遊戲的戰力平衡已與上線初期有所不同，確實需要對相關部分進行調整。</div><div><br></div><div><br></div><div>■關於問題「請告訴我們關於『武器和護符系統調整』之寶貴意見。」</div><div><br></div><div>‧關於武器的部分，營運團隊收到了許多像是「系統變得更為簡單易懂」、「管理變得很輕鬆」等玩家回饋。</div><div>過去覺得武器系統難以理解的玩家也表示「在這次更新後終於能夠嘗試製作武器了」，讓我們感到十分欣慰。</div><div><br></div><div>‧由於武器種別加成和咢牙系列武器的調整，導致武器製造和強化時盧比的需求量大增。</div><div>關於這部分營運團隊將定期舉辦相關活動，並增加透過活動可獲得的盧比數量讓玩家更容易取得。</div><div>至於素材部分，則將定期舉辦特定任務的掉落量提升活動。</div><div><br></div><div>‧有玩家提到「護符的自由度雖然提升了，但能做的嘗試卻也更多，變得更加複雜」的意見。</div><div>版本2.0.0的更新中已對一些功能進行改善，今後也將會持續提升其便利性。</div><div><br></div><div>■關於問題「請告訴我們關於全新模式『阿爾貝利亞競技大亂鬥』之寶貴意見。」<br><br>‧「阿爾貝利亞競技大亂鬥」為失落龍絆的全新模式，在本次問卷調查中玩家對本模式的意見為贊否參半。<br><br>‧有玩家表示「能夠即時與其他玩家對戰、躲在草叢中突擊很有趣」，也有玩家分享了「偶然與認識的玩家配對到時玩得很開心」的意見。<br><br>‧另一方面，也有玩家回饋「即使取得較高排名獎勵也沒有比較多，讓人沒有動力」、「不喜歡與他人競爭」、「會因為連線延遲導致攻擊無法命中對手」等意見。<br><br>‧由於阿爾貝利亞競技大亂鬥為新的對戰模式，實裝初期我們是以調整平衡等方面為前提。<br>今後我們將會針對任務中的機關和獎勵進行調整，並追加更多有趣的要素。<br>期望能夠提供玩家一個能與朋友輕鬆對戰的模式。<br><br><br>■關於問題「您覺得本次團體戰活動『失落的歷史』的BOSS戰、劇情如何呢？」<br><br>‧營運團隊對於二週年時公開的「失落的歷史」活動付出了許多心力，在劇情、戰鬥、演出和BGM等方面獲得了眾多正面評價，我們深感欣慰。<br><br>‧能力值固定任務也獲得好評，今後我們也導入所有玩家都能體驗劇情的相關要素。<br><br>‧不過，也有玩家表示「像這樣逼近劇情核心的龐大展開，劇情的份量更多一點是否比較好？」的意見。劇情份量的掌控一直都是讓我們傷透腦筋的課題，但過多的內容會使閱讀變得吃力，因此本次的長度應該算是恰當。<br><br>‧繼一週年時所舉辦的活動，目前的回饋反映出與主線劇情有所關聯的活動得到的評價是正面的。在2.5周年時也預計將會準備相關的活動。<br><br><br>■關於問題「請告訴我們關於目前更新至第15章的『主線劇情』之寶貴意見。」<br><br>‧許多玩家都表示對主線劇情第10章以後的展開深感興趣。<br>雖然劇情發展較為嚴肅，但今後的劇情內容將更能襯托出角色和龍族們的個性與魅力，對於覺得「劇情太拖泥帶水了」的玩家，請期待今後的劇情發展。<br><br>‧我們也有看到部分玩家表示「沒有在進行主線劇情」，今後我們將進行改善，讓玩家們能夠體驗主線劇情。<br><br>‧主線劇情第17章預計將於12月公開，故事的舞台將移至北格拉斯迪亞大陸。<br>預計將會有許多新角色登場，敬請期待。<br><br><br>■關於問題「請告訴我們您對『失落龍絆』今後的期望，或是想對營運團隊提出的建議和意見。」<br><br>‧許多玩家都表示很期待活動和劇情。目前每個月都有推出新劇情的活動，期待能夠透過有趣的活動擴大「失落龍絆」的世界觀。<br><br>‧在遊戲操作方面，有玩家希望可以「提高難度」，也有玩家表示「希望可以降低難度」。<br>雖然難易度的控制一直都是個難題，但我們將會盡力保持雙方的平衡。<br>不過，我們也在考量將能獲得製造武器所需挑戰的任務，以及有挑戰性的高難易度任務獨立出來。<br>像新的難易度「絕級」等就被歸類於富有挑戰性的內容。<br><br>‧關於更新內容部分，玩家也給予了偏向正面的回饋。<br>遊戲中仍有必須進行調整的部分，今後「失落龍絆」也將持續改善相關內容，提供玩家更好的遊戲環境。<br><br>‧有很多玩家表示很期待圖鑑功能和「聖城汪汪同樂天！」活動的復刻，對此還請玩家們稍作等候。</div><div><br></div><hr><div><br>最後，再次感謝各位玩家熱情參與這次的問卷調查。<br>雖然是開放式的問卷，仍收到了許多玩家的作答。</div><div>為感謝玩家們熱情參與本次問卷調查，營運團隊將發送龍輝晶石1200個給各位玩家。<br>配合遊戲二週年的到來，版本也隨之更新到了「2.○.○」。<br>於這個時間點實施問卷調查活動，是希望能將玩家們所提供的建議和意見作為今後營運方針的參考。<br>而實際收到的回饋數量也遠遠超出我們的預期，對未來的營運方針有非常大的幫助。<br><br>今後「Dragalia Lost ～失落的龍絆～」也將沿用這種方式聽取各位的寶貴意見，繼續提供玩家更好的遊戲內容。<br><br>今後也請您繼續支持【Dragalia Lost ～失落的龍絆～】<br>Dragalia Lost ～失落的龍絆～ 營運團隊　敬上</div>,start_time:1608098400,update_time1608082160