b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":1099,"category_name":"Events","pr_category_id":"4","title_name":"One Day Only! Wagabond Pupper, Now Live!","message":"<div>Wagabond Pupper is live for one day only, from <span class=\\"local_date\\" data-local_date=\\"1585720800\\"><\/span> to <span class=\\"local_date\\" data-local_date=\\"1585807199\\"><\/span>!<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/12d18ea3289d7ab5b15a67469232045f.png\\"><\/div><div>A puppy wandered into the Halidom and everyone who saw it immediately fell head over heels for the adorable doggo! The friendly and boundlessly curious puppy loved to go on walks, fearing nothing and taking keen interest in anything it could sniff out. It was almost as if the puppy had the bravery and courageous spirit of an adventurer!<\/div><div><br><\/div><div>\\u25a0How to Play<\/div><div>Play with the puppy and become friends!<\/div><div><br><\/div><div>1. Collect Pup Grub!<\/div><div>You can get one Pup Grub each time you clear a quest in the main campaign or an event quest.<\/div><div>Note: You can only get Pup Grub as a first clear reward the first time you clear the Walkies quest in Wagabond Pupper.<\/div><div><br><\/div><div>2. Interact with the puppy in the Dragon&#39;s Roost!<\/div><div>Head to the Dragon&#39;s Roost where you can pet the puppy! Pet the puppy to become friends! You can also increase your bond with the puppy by feeding it Pup Grub in the Dragon&#39;s Roost!<\/div><div><br><\/div><div>When your bond with the puppy reaches certain points, it will learn Fetch, or the types of balls you can use will increase!<\/div><div><br><\/div><div>3. Play with the puppy in the Walkies quest!<\/div><div>You can control the puppy and play with your favorite adventurers! Tap the camera icon to pause and enter photo mode. In photo mode, you can move the camera and zoom in and out to look at the puppy and adventurers from different angles and perspectives! Find a scene you like and take a screenshot to capture the moment!<\/div><div><br><\/div><div>Don&#39;t forget to step into the circle of light within the quest to clear it!<\/div><div><br><\/div><div>\\u25a0Sticker<\/div><div>You can complete an endeavor during the event to get a puppy sticker as a reward! Feed the puppy Pup Grub via Gifts in the Dragon&#39;s Roost to complete the endeavor.<\/div><div><br><\/div><div>\\u25a0Event Duration<\/div><div><span class=\\"local_date\\" data-local_date=\\"1585720800\\"><\/span> to <span class=\\"local_date\\" data-local_date=\\"1585807199\\"><\/span><\/div><div><br><\/div><div>Notes:<\/div><div>1. Players must have completed up to Chapter 2 \/ 2-1 (Normal) of the main campaign in order to participate in the Wagabond Pupper event.<\/div><div>2. To play the Walkies quest, tap Quests on the Home screen, then select Wagabond Pupper.<\/div><div>3. Events that increase the amount of drop rewards do not apply to Pup Grub.<\/div><div>4. You cannot use Pup Grub on dragons.<\/div><div>5. You can check the endeavors added for a limited time by tapping Endeavors on the Home page, then selecting the Limited tab.<\/div><div><br><\/div><div>Thank you for playing Dragalia Lost.<\/div><div><br><\/div>","start_time":1585720800,"prev_article_id":"1184","next_article_id":"1224","image_path":"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/12d18ea3289d7ab5b15a67469232045f.png","update_time":1585705163}}}'