b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":111,"category_name":"Updates","pr_category_id":"2","title_name":"Update Notification [Addendum]","message":"<div>The update to version 1.2.0 was made available at <span class=\\"local_date\\" data-local_date=\\"1543201200\\"><\/span>.&nbsp;<\/div><div><br><\/div><div><span style=\\"color: rgb(41, 105, 176);\\"><strong>[Update <span class=\\"local_date\\" data-local_date=\\"1543304100\\"><\/span>]<\/strong><\/span><br>We found out that High Midgardsormr&#39;s &quot;Storm Chaser&quot; skill was dealing more hits than it should in version 1.2.0.<br>We are working to have this issue fixed in the next update.<br><br>Due to this issue, the scheduled automatic update to version 1.2.0 on <span class=\\"local_date\\" data-local_date=\\"1543374000\\"><\/span> will be cancelled. Another automatic update will be applied on <span class=\\"local_date\\" data-local_date=\\"1543546800\\"><\/span>.<br><br>The Tenfold Summon Voucher gift will also be rescheduled accordingly. It will &nbsp;be sent to everyone after <span class=\\"local_date\\" data-local_date=\\"1543546800\\"><\/span>.<br>This announcement will be updated after the vouchers have been distributed.<br><br>Thank you for playing Dragalia Lost.<\/div><div><br><\/div><div><br><\/div><div>Version 1.2.0 brings additional features focused on the new event, as well as various improvements and fixes. Check below for details.<\/div><div><br><\/div><div>\\u25a0Additional features and improvements:<\/div><div>The features and changes below have been added to the game.<\/div><div>\\u30fb Improved usability for unbinding and upgrading weapons.<\/div><div>\\u30fb The camera will no longer zoom in when you tap a completed facility.<\/div><div>\\u30fb During co-op play, you will no longer be disconnected if you receive low-battery notifications during play, as long as the notification is dismissed quickly enough.<\/div><div>\\u30fb Improved scrolling through sticker pages.<\/div><div>\\u30fb Wyrmprint details will now display from Stage 1.<\/div><div>\\u30fb When an enemy&#39;s Overdrive activates, they will now display &quot;Recovered from Afflictions&quot; to make it clear that their afflictions have ended.<\/div><div><br><\/div><div>Note: The following change will be applied after <span style=\\"color: rgb(41, 105, 176);\\"><strong><span class=\\"local_date\\" data-local_date=\\"1543557600\\"><\/span><\/strong><strong>.<\/strong><\/span><br>\\u30fb Adjusted the search conditions to improve matching when using Find a Room to play co-op.<br>\\u30fb Added &quot;Skill Shift&quot; and &quot;Energy\/Energized&quot; sections in the Help menu.<br><br><\/div><div>\\u25a0Issues fixed:<\/div><div>The following issues have been fixed.<\/div><div>\\u30fb Playing for a long time caused processing slowdowns on some devices.<\/div><div>\\u30fb The final attack stage of the Blackwing weapon&#39;s Black Dance skill was not defined.<\/div><div>\\u30fb The ability to enter otherwise inaccessible areas in certain locations has been fixed.<\/div><div>\\u30fb Skills that ignore damage under a fixed percentage of max HP sometimes did not ignore damage at the right percentage.<\/div><div>\\u30fb When participating in co-op as a guest using Find a Room, the screen would sometimes not respond when tapped, making it impossible to proceed.<\/div><div>\\u30fb It was sometimes possible to activate consecutive Force Strikes during jump attacks.<\/div><div>\\u30fb When a Helper uses a healing skill, the character you are controlling would sometimes recover more than the intended amount.<\/div><div>\\u30fb When two players send friend requests to one another and one accepts, the other player would receive the message &quot;Friend request was not sent&quot; when trying to accept.<\/div><div>\\u30fb When removing a friend after sorting your friend list by &quot;Last play,&quot; the display order would return to its initial setting.<\/div><div>\\u30fb It was not possible to use the left\/right buttons to switch chapters on the main story&#39;s chapter-select screen.<\/div><div>\\u30fb When a special symbol is included in a player name, some text would not display properly.<\/div><div>\\u30fb It was not possible to use traditional Chinese Mandarin Phonetic Symbols or traditional Chinese CJK characters when setting or changing your player name.<\/div><div><br><\/div><div>\\u25a0Notes:<\/div><div>It may take time for the update information to be reflected in the store.<\/div><div>Players may not be able to perform the update due to their device&#39;s data cache being full.<\/div><div>If you are unable to perform the update, restart your device and then attempt the download from the store.<\/div><div><br><\/div><div><span style=\\"color: rgb(41, 105, 176);\\"><strong>[Addendum <span class=\\"local_date\\" data-local_date=\\"1543547400\\"><\/span>]<\/strong><\/span><br>Players who have started the game before <span class=\\"local_date\\" data-local_date=\\"1543546800\\"><\/span> and have updated Dragalia Lost to version 1.2.1 will receive a Tenfold Summon Voucher as a thank-you gift!<br><br>This gift will be sent to the goodie box of players who log in before <span class=\\"local_date\\" data-local_date=\\"1544151540\\"><\/span>. It can be accepted for seven days after reception.<\/div><div><br><\/div><div>Thank you for playing Dragalia Lost.<\/div>","start_time":1543209600,"prev_article_id":"89","next_article_id":"116","image_path":"","update_time":1543559427}}}'