b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":1251,"category_name":"Updates","pr_category_id":"2","title_name":"Version Update[Update]","message":"<div>Version 1.19.0 will be available for download around <span class=\\"local_date\\" data-local_date=\\"1587956400\\"><\/span>.<\/div><div><br><\/div><div>You may install it when it becomes available; otherwise, an automatic update will occur at approximately <span class=\\"local_date\\" data-local_date=\\"1588042800\\"><\/span>.<\/div><div><br><\/div><div>When you update to version 1.19.0 and play co-op, you will no longer be matched with players using earlier versions of the game. Rooms created by players playing earlier versions will not display in the Room List, and you will not be able to join them using Find a Room or Join Nearby Players. Additionally, if you input an ID using Enter an ID, the room will display, but you will not be able to enter it. Lastly, rooms created by alliance members playing earlier versions will be visible in the alliance chat, but you will not be able to join the room. The &quot;All set, thanks!&quot; message will display in such cases.<\/div><div><br><\/div><div>To celebrate the update, we&#39;ll be sending all players a Tenfold Summon Voucher after the automatic update.<\/div><div><br><\/div><div>This notice will be modified after it has been distributed.<\/div><div><br><\/div><div>Note: The Tenfold Summon Voucher will not be distributed until after the automatic update, even if you complete the update to version 1.19.0 early.<\/div><div><br><\/div><div>\\u25a0Update Details<\/div><div>\\u30fbYou will be able to switch mana circles to display in 2D<\/div><div>Select Options from the Menu and then go to the System tab to switch mana circles to 2D display.<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/1c81025ec42d7078cf1b29847a01a60e.png\\"><\/div><div><br><\/div><div>\\u30fbNew retry feature<\/div><div>During a quest, you can tap the Retry button in the menu to restart the quest from the beginning. You can also choose to Retry from the continue screen.<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/1ff1832b2feb1754e2ff8b24c534e837.png\\"><\/div><div>In solo play, selecting Retry will restart the quest immediately. When playing co-op, a vote to determine whether or not to retry the quest will be held when one player on the team selects Retry. Each player can only initiate a vote once per quest, and the quest will only restart if all players vote to retry.<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/0a5bd704334aff35341a5c3c6243d9d3.png\\"><\/div><div>For more information, see Retrying a Quest during Solo Play and Retrying a Quest during Co-op Play in the Quests section under Help.<br>Note: Retrying a Quest during Solo Play and Retrying a Quest during Co-op Play will be added to Help around <span class=\\"local_date\\" data-local_date=\\"1587956400\\"><\/span>.<br>This feature will be added at <span class=\\"local_date\\" data-local_date=\\"1587956400\\"><\/span>.<\/div><div><br><\/div><div>\\u30fbNew co-op room conditions for mentoring<\/div><div>To make it easier to obtain the Mentor Bonus, we will add Find a Mentor and Find Players to Mentor as potential room conditions for quests that are eligible for Mentor Bonuses.<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/403d8ba16585f03b284df20e30ca2e5d.png\\"><\/div><div>We will also remove the Clear Quest Endeavors room condition, which is not used very frequently.<\/div><div><br><\/div><div>\\u30fbTeam history feature added to co-op<\/div><div>The feature that allows you to bring up a team you have used in the past will be added to co-op as well.<\/div><div>In a quest that you have already cleared, you will be able to bring up a team you set as your preferred team using Set as Preferred Team on the co-op results screen when you cleared the quest. In a quest you have not cleared before, you will be able to bring up the team you used most recently.<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/ff618e7c84c99d57c26f90dbef11c5d6.png\\"><\/div><div><br><\/div><div>\\u30fbSome Void Battles quests will be always available<\/div><div>You will be able to challenge certain quests in Void Battles at any time. The applicable quests are as follows.<\/div><div>\\u30fbShroom Strike quests (Scalding Shroom, Gust Shroom, Wandering Shroom)<\/div><div>\\u30fbGhost Strike quests (Blazing Ghost, Cerulean Ghost, Lambent Ghost, Violet Ghost)<\/div><div>\\u30fbHermit Strike quests (Frost Hermit, Twilight Hermit)<\/div><div>\\u30fbGolem Strike quests (Steel Golem, Amber Golem, Obsidian Golem)<\/div><div>\\u30fbCatoblepas Strike quests (Catoblepas Fotia, Catoblepas Anemos)<\/div><div>\\u30fbPhantom Strike quests (Infernal Phantom, Eolian Phantom)<\/div><div>\\u30fbManticore Strike quests (Smoldering Manticore, Greedy Manticore, Proud Manticore, Raging Manticore)<\/div><div>You will also be able to use skip tickets on these quests.<\/div><div>This feature will be added at <span class=\\"local_date\\" data-local_date=\\"1588053600\\"><\/span>.<\/div><div><br><\/div><div><span style=\\"color: rgb(44, 130, 201);\\"><strong>[Addendum <span class=\\"local_date\\" data-local_date=\\"1587951900\\"><\/span>]<\/strong><\/span><br>The quest clear record and quest endeavor completion status for Void Battles that will be available at all times will be reset at <span class=\\"local_date\\" data-local_date=\\"1588053600\\"><\/span>.<br>Note: The completion status for Normal and Limited endeavors under Endeavors will not reset.<\/div><div><br><\/div><div>\\u25a0Other Changes<\/div><div>\\u30fbIf you have not linked a Nintendo Account, a screen prompting you to do so will appear on the title screen.<\/div><div>\\u30fbThe maximum level for rupie mines and elemental altars in your castle grounds will be raised to 40.<\/div><div>This level increase for rupie mines and elemental altars will unlock at <span class=\\"local_date\\" data-local_date=\\"1588053600\\"><\/span>.<\/div><div>\\u30fbWe will add sections to Help and update the content of existing sections.<\/div><div>\\u30fbFor certain quests in which enemy size changes during battle, the target marker (the circular markers that display under targeted enemies) will now also change size to match the enemy.<\/div><div>\\u30fbWe will also adjust the UI on some screens.<\/div><div><br><\/div><div>\\u25a0Balance Adjustments<\/div><div>\\u30fbWe will make the following adjustments to situations where adventurers take damage from obstacles during quests and are pushed backward or have their movement disrupted by knockback.<\/div><div>For some obstacles, we will reduce the distance adventurers are pushed backward or the amount of time movement is disrupted by knockback.<\/div><div>The backwards push applied by some obstacles will be changed to knockback.<\/div><div>Some obstacles will no longer cause knockback.<\/div><div>\\u30fbFalling tree obstacles will no longer inflict the stun affliction.<\/div><div>The adjustments above will be applied at <span class=\\"local_date\\" data-local_date=\\"1588053600\\"><\/span>.<\/div><div>\\u30fbAI adventurers with skills that power up their force strikes were opening treasure chests with their powered-up force strikes, but we will adjust them so that they use normal attacks to open treasure chests.<\/div><div><br><\/div><div>\\u25a0Issues Fixed<\/div><div>The following issues have been fixed in this version.<\/div><div>\\u30fbWhen Naveed&#39;s Radiant Bauble skill was used multiple times, the numeric value for the Crystalline Blades Buffed icon displayed a maximum of 10.<\/div><div>\\u30fbFor &quot;HP X% = (Element) Res +Y%&quot; chain co-abilities, if the adventurer&#39;s HP fell below the threshold and then later met the conditions again, the effect icon did not display in the combat log.<\/div><div>\\u30fbThe effects of Chitose&#39;s Love&#39;s Shield II\/III ability occurred even when using dragon skills while shapeshifted.<\/div><div>\\u30fbWhen tapping How to Acquire in the item details for some materials that can be obtained from The Agito Uprising then tapping a quest, it was not possible to challenge the quest even if the unlock conditions had been met. The affected materials were as follows.<\/div><div>Destitute One&#39;s Mask Fragment<\/div><div>Plagued One&#39;s Mask Fragment<\/div><div>Almighty One&#39;s Mask Fragment<\/div><div>Uprooting One&#39;s Mask Fragment<\/div><div><br><\/div><div>Notes:<\/div><div>1. It may take time for the store to reflect the updated information. Players may not be able to perform updates due to their device&#39;s data cache being full. If you are unable to perform the update, restart your device, and then try downloading it from the store.<\/div><div>2. Any adventurers and game screenshots shown are still in development.<\/div><div><br><\/div><div><span style=\\"color: rgb(41, 105, 176);\\"><strong>[Addendum <span class=\\"local_date\\" data-local_date=\\"1588042800\\"><\/span>]<\/strong><\/span><\/div><div>As a token of our appreciation, the following item has been sent to players who started playing before <span class=\\"local_date\\" data-local_date=\\"1588042800\\"><\/span>.<\/div><div><br>\\u30fbTenfold Summon Voucher x1<\/div><div><br>This gift can be claimed from your goodie box for up to seven days after reception. If the gift isn&#39;t retrieved within seven days, it will be lost.<\/div><div><br><\/div><div>Thank you for playing Dragalia Lost.<\/div><div><br><\/div><div><br><\/div>","start_time":1587362400,"prev_article_id":"1204","next_article_id":"1295","image_path":"","update_time":1588042832}}}'