b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":1344,"category_name":"Important","pr_category_id":"5","title_name":"Important Notice Regarding Supported Devices","message":"<div>Hello, everyone. This is the Dragalia Lost team. We want to begin by thanking you for playing Dragalia Lost.<\/div><div><br><\/div><div>Please note that this is an important notice for players using the following devices.<\/div><div>\\u30fbiOS devices with 1GB of RAM or less<\/div><div>\\u30fbAndroid devices with 3GB or RAM or less<\/div><div><br><\/div><div>With Dragalia Lost, we endeavor to provide stable service to all players as we continue adding new features and expanding on existing ones. For this reason, we will be changing which devices the game supports. After the release of version 1.23.0, which is scheduled for <span class=\\"local_date\\" data-local_date=\\"1598497200\\"><\/span>, Dragalia Lost will no longer run properly, and in some cases will be unable to be installed, on devices that meet the descriptions above.<\/div><div><br><\/div><div>Note: The update schedule and content are subject to change.<\/div><div><br><\/div><div>\\u25a0Devices That Will No Longer Be Supported After the Release of Version 1.23.0<\/div><div>[iOS devices]<\/div><div>The following iOS devices with 1GB of RAM or less:<\/div><div>\\u30fbiPhone 5s<\/div><div>\\u30fbiPhone 6<\/div><div>\\u30fbiPhone 6 Plus<\/div><div>\\u30fbiPad (3rd generation)<\/div><div>\\u30fbiPad (4th generation)<\/div><div>\\u30fbiPad Air<\/div><div>\\u30fbiPad mini 2<\/div><div>\\u30fbiPad mini 3<\/div><div>\\u30fbiPod touch (6th generation)<\/div><div><br><\/div><div>[Android devices]<\/div><div>Android devices like the following with 3GB of RAM or less.<\/div><div>\\u30fbHUAWEI nova lite 3 POT-LX2J<\/div><div>\\u30fbSONY Xperia Z3 SO-01G<\/div><div>\\u30fbSONY Xperia Z3 SOL26<\/div><div>\\u30fbSAMSUNG GALAXY S5 SC-04F<\/div><div>Note: Even if you attempt to install or reinstall the game, Dragalia Lost may not run properly on the above devices, and in some cases will be unable to be installed.<\/div><div><br><\/div><div>\\u25a0Supported Devices After the Release of Version 1.23.0<br>The devices supported after the release of version 1.23.0 will be as follows.<br><br>[iOS devices]<br>iPhone, iPod touch, and iPad devices running iOS 9.0 or newer.<br>Devices with 2GB of RAM or more are recommended.<br>Notes:<br>\\u30fbThe game may not run properly depending on the performance, specifications, and application usage of your device even when the above specifications are fulfilled.<br>\\u30fbIt may take some time before Dragalia Lost is supported on the newest version of iOS.<br><br>[Android devices]<br>Devices running Android 5.0 or newer.<br>Devices with 4GB of RAM or more are recommended.<br>Notes:<br>\\u30fbThe game may not run properly depending on the performance, specifications, and application usage of your device even when the above specifications are fulfilled.<br>\\u30fbIt may take some time before Dragalia Lost is supported on the newest version of Android OS.<br><br>\\u25a0To Players Planning on Changing to a Supported Device<br>You can backup your save data by linking Dragalia Lost with your Nintendo Account in advance to continue playing with the same save data after changing devices.<br><br>\\u25a0Nintendo Account<br>This is a free-to-register account needed to back up save data for Nintendo smart device apps. If you do not have a Nintendo Account, you can create one by following the instructions in this link: <a href=\\"https:\/\/accounts.nintendo.com\\">https:\/\/accounts.nintendo.com<\/a><br><br>\\u25a0How to Link an Account In-Game<br>Follow the steps below to link your Dragalia Lost save data with a Nintendo Account.<br>1. Tap the menu button at the top-right corner of the screen.<br>2. Tap Other.<br>3. Tap Account Management.<br>4. Select Create\/Link a Nintendo Account to link an account.<br>Note: Be aware that deleting save data will delete all of your data, and it is not possible to restore that data.<\/div><div><br><\/div><div>\\u25a0Continuing to Use Save Data After Changing Devices<br>Follow the steps below to continue playing your Dragalia Lost save data that was backed up using a Nintendo Account.<br>1. Install the application.<br>2. Select Link Your Account on the Link Accounts screen that displays after you tap the title screen the first time you launch the game.<br><br>Notes:<br>\\u30fbYou can link only one Nintendo Account per save file.<br>\\u30fbYou cannot switch the Nintendo Account linked to Dragalia Lost to another Nintendo Account.<br>\\u30fbShould you link and play the game on a device with a different OS than your original device, any diamantium you have cannot be carried over to that device. However, the diamantium is not discarded, and if you play on the original OS, you will be able to use your held diamantium.<br>\\u30fbFor more information about linking an account, select More on the in-game footer menu, then tap Help\/Support and see Nintendo Account under FAQ.<br>\\u25a0Official Dragalia Lost FAQ<br><a href=\\"https:\/\/dragalialost.com\/en\/faq\/\\">https:\/\/dragalialost.com\/en\/faq\/<\/a><br><br>The devices supported by the Dragalia Lost game may change in future updates after the release of version 1.23.0.<br><br>Thank you for your cooperation and for playing Dragalia Lost.<\/div>","start_time":1590472800,"prev_article_id":"1064","next_article_id":"1572","image_path":"","update_time":1590463957}}}'