b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":1470,"category_name":"Events","pr_category_id":"4","title_name":"New Void Enemy and Void Battle Limited-Time Endeavors!","message":"<div>A new Void enemy will be added to Void Battles (event quests where you can battle powerful boss enemies) at <span class=\\"local_date\\" data-local_date=\\"1595397600\\"><\/span>.<\/div><div><br><\/div><div>You can craft new weapons using the materials obtained by defeating the newly added Void enemy.<\/div><div><br><\/div><div>Furthermore, Limited Void Battle Endeavors will be available between <span class=\\"local_date\\" data-local_date=\\"1595397600\\"><\/span> and <span class=\\"local_date\\" data-local_date=\\"1596088799\\"><\/span>.<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/1b72098ea77741a5a33471e2d425867b.png\\"><\/div><div>With a booming peal of thunder, a chimera wreathed in light plunges from the heavens. Its white light radiates like the sun, descending to trample the land. Just as a bolt of lightning tears the sky apart, the beast stained by black mana raises its sharpened claws to vanquish all.<\/div><div><br><\/div><div>\\u25a0New Void Enemy<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/51f4be71d61760fe9530315edf2556ae.png\\"><\/div><div>Luminous Chimera (Light), Required Might: 13,000<\/div><div>With its two powerful abilities, Overgrowth and Frenzy, this mighty foe grows more and more dangerous as the fight rages on! You&#39;ll also need to watch out for the paralysis and bog afflictions.<\/div><div><br><\/div><div>\\u25a0Crafting<\/div><div>Craftable Void weapons will be added.<\/div><div>\\u30fbWeapons that can be crafted using materials obtained from the Luminous Chimera have been added.<\/div><div>\\u30fbDaggers, bows, wands, and staffs have been added to weapon types you can craft using materials obtained from the Catoblepas Fotia.<\/div><div>\\u30fbDaggers, bows, wands, and staffs have been added to weapon types you can craft using materials obtained from the Catoblepas Anemos.<\/div><div>\\u30fbDaggers, bows, wands, and staffs have been added to weapon types you can craft using materials obtained from the Catoblepas Skia.<\/div><div><br><\/div><div>\\u25a0Void Battles Schedule<\/div><div>You can play Void Battles anytime, regardless of the day of the week. However, the Void enemies that appear will differ based on the day. Check out the Void Battles Schedule notification for information about when each Void enemy is scheduled to appear.<\/div><div><a href=\\"https:\/\/dragalialost.com\/en\/news\/detail\/19999\\">Void Battles Schedule<\/a><\/div><div><br><\/div><div>\\u25a0Limited Void Battle Endeavors<\/div><div>We&#39;re adding Limited-Time Void Battle Endeavors, separated into Daily and Limited variations. You can complete the endeavors to obtain various rewards.<\/div><div><br><\/div><div>\\u25a0Limited Void Battle Endeavors Duration<\/div><div><span class=\\"local_date\\" data-local_date=\\"1595397600\\"><\/span> to <span class=\\"local_date\\" data-local_date=\\"1596088799\\"><\/span><\/div><div><br><\/div><div>Notes:<\/div><div>1. For more information about Void Battles, tap Quests on the Home page, then go to the Void Battles page and select Help.<\/div><div>2. For more information about Void enemies, tap Quests on the Home page, then go to the Void Battles page and check Details on the various quest pages.<\/div><div>3. You can check the endeavors added for a limited time by tapping Endeavors on the Home page, then selecting the Daily or Limited tabs.<\/div><div>4. Players must have completed up to Chapter 7 \/ 5-6 (Normal) of the main campaign in order to participate in Void Battles.<\/div><div><br><\/div><div>Thank you for playing Dragalia Lost.<\/div><div><br><\/div>","start_time":1595397600,"prev_article_id":"1464","next_article_id":"1471","image_path":"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/1b72098ea77741a5a33471e2d425867b.png","update_time":1595294565}}}'