b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":1530,"category_name":"Events","pr_category_id":"4","title_name":"Tartarus\'s Wrath Is Coming to The Agito Uprising!","message":"<div>Tartarus&#39;s Wrath will be added to The Agito Uprising (high-difficulty quests where you&#39;ll face powerful foes from a new organization) at <span class=\\"local_date\\" data-local_date=\\"1598594400\\"><\/span>! New 6\\u2605 weapons, which can be crafted using materials earned by defeating Tartarus, will also be added.<\/div><div><br><\/div><div>&quot;I will destroy this world of many sins,&quot; the Agito said.<\/div><div>&quot;In order avenge my fallen king,&quot; the Agito said.<\/div><div>&quot;Everything I do is for my king, for His Majesty, King Alberius.&quot;<\/div><div><br><\/div><div>The vengeful determination in the Agito&#39;s gloomy eyes tells of his uprising against all who took his master from him and lived. The dragon who descended half-clad in steel has a name, and that name is Tartarus.<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/c041e5b9de604173232cace0825e3640.png\\"><\/div><div>Tartarus&#39;s Wrath (Shadow), Required Might: 22,000<\/div><div><br><\/div><div>\\u25a0New Agito Series Weapons<\/div><div>Powerful new 6\\u2605 Agito weapons will be added under Crafting at <span class=\\"local_date\\" data-local_date=\\"1598594400\\"><\/span>. You&#39;ll be able to use materials obtained by defeating Tartarus to craft light-attuned weapons with skills that switch effects each time you use them.<\/div><div><br><\/div><div>You must have first obtained specific weapons before you can craft weapons using materials obtained from Tartarus. The required weapons are the tier II light-attuned 5\\u2605 weapons that can be crafted using materials obtained from the Luminous Chimera in Void Battles.<\/div><div><br><\/div><div>The weapon that is required differs based on the weapon type for the weapon you wish to craft. You can check the requirements by selecting Materials for the Tartarus weapons on the Craft tab under Crafting.<\/div><div><br><\/div><div>\\u30fbAgito weapons cannot be dismantled.<\/div><div>\\u30fbDifficulty levels for Tartarus&#39;s Wrath and tier II and higher enhancements for Agito weapons will be added in the future.<\/div><div><br><\/div><div>Note:<\/div><div>Players must have completed Chapter 10 \/ 6-3 (Normal) of the main campaign and any of the Standard difficulty Advanced Dragon Trials to participate.<\/div><div><br><\/div><div>Thank you for playing Dragalia Lost.<\/div><div><br><\/div>","start_time":1597989600,"prev_article_id":"1513","next_article_id":"1519","image_path":"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/c041e5b9de604173232cace0825e3640.png","update_time":1597742988}}}'