b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":1603,"category_name":"News","pr_category_id":"1","title_name":"Regarding Changes to the Weapon and Crafting Systems[Update]","message":"<div><span style=\\"color: rgb(41, 105, 176);\\"><strong>[Addendum <span class=\\"local_date\\" data-local_date=\\"1600858200\\"><\/span>]<\/strong><\/span><\/div><div>We have corrected an issue in the notice updated at <span class=\\"local_date\\" data-local_date=\\"1600840800\\"><\/span>.<\/div><div><br><\/div><hr><div>The weapon and crafting systems will undergo major changes in the next update. This notification will explain how these new systems will work in detail.<\/div><div><br><\/div><div>For details regarding goodwill gestures offered to players affected by these changes, please see the related notification once it is posted. For details regarding goodwill gestures for in-game Shop offerings that will be affected by these changes, please see the following notification:<\/div><div><br><\/div><div><a href=\\"https:\/\/dragalialost.com\/en\/news\/detail\/1572\\">[Important] Regarding Goodwill Gesture Items for Purchasable Items Affected By System Changes<\/a><\/div><div><br><\/div><div>The next update will reduce the number of weapons that players have to manage and make the process of crafting weapons easier to understand.<\/div><div><br><\/div><div>In Version 1.23.1 and earlier, players chose a weapon to craft from the various groups available, unbound it fully, then enhanced it. In the next update and beyond, the Craft and Enhance tabs will be removed and replaced by the Weapons\/Crafting tab from which players will select and craft a weapon from various groups.<\/div><div><br><\/div><div>A new feature called the weapon bonus will be added that can be unlocked by upgrading your collection of weapons.<\/div><div><br><\/div><div>In the next update and beyond, abilities (including those attached to individual weapons in Version 1.23.1 and earlier) will be consolidated into generalized weapon abilities whose effects apply to all weapons of a particular type once they are unlocked.<\/div><div><br><\/div><div>Other changes include the ability to equip wyrmprints to your weapons.<\/div><div><br><\/div><div>The way you use and upgrade weapons is changing. The following is a list of the main changes.<\/div><div><br><\/div><div>\\u30fbIn Version 1.23.1 and earlier, a weapon&#39;s stats (HP &amp; Strength) were upgraded by leveling it up. In the next update and beyond, this will be accomplished by unlocking nodes.<\/div><div>\\u30fbIn Version 1.23.1 and earlier, unbinding was performed using copies of a weapon. In the next update and beyond, this will be accomplished by unlocking nodes with materials.<\/div><div>\\u30fbOnly one of any particular weapon can be crafted, but by unlocking additional copies of the weapon, it can be equipped on multiple members of a team.<\/div><div>\\u30fbSlots will be added to weapons, and up to five wyrmprints can be equipped to each weapon.<\/div><div>Note: Wyrmprints will be changed to typically have one ability per wyrmprint.<\/div><div>\\u30fbThe weapon bonus will grant an increasing benefit to the HP and strength provided by certain types of weapons as players craft and upgrade more of them.<\/div><div>\\u30fbCertain weapon abilities such as the &quot;Bane&quot; abilities found in the weapons from Void Battles and Advanced Dragon Trials will apply to all weapons of a certain type once unlocked.<\/div><div><br><\/div><div>Each change will be explained in further detail below.<\/div><hr><div><br><\/div><div><strong>\\u25a0Crafting Weapons<\/strong><\/div><div>1. Crafting groups<\/div><div>One weapon of each type from each of the following groups can be crafted:<\/div><div>\\u30fbCore Weapons: 3\\u2605 non-elemental weapon, 4\\u2605 non-elemental weapon, 5\\u2605 non-elemental weapon, 5\\u2605 weapon of each element (flame, water, wind, light, shadow) (8 total)<\/div><div>\\u30fbVoid Weapons: 5\\u2605 weapon of each element (5 total)<\/div><div>\\u30fbChimeratech Weapons: 5\\u2605 weapon of each element (5 total)<\/div><div>\\u30fbHigh Dragon Weapons: 5\\u2605 weapon of each element (5 total)<\/div><div>\\u30fbAgito Weapons: 6\\u2605 weapon of each element (5 total)<\/div><div><br><\/div><div>Notes:<\/div><div>\\u30fbEach weapon can only be crafted once, but a weapon can be upgraded (as described later in this notification) to increase the number of them that team members can wield.<\/div><div>\\u30fbIn the next update, certain existing weapons will be removed and can no longer be crafted.<\/div><div>\\u30fbWeapon skins of certain existing weapons that are removed in the next update can be obtained by upgrading weapons from each group.<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/1d6710a454b67c543ae667ea7a5c7937.png\\"><\/div><div><br><\/div><div>2. Weapon unlock progression<br>Craftable weapons will be unlocked in the following order:<br>(1) 3\\u2605 non-elemental core weapon<br>(2) 4\\u2605 non-elemental core weapon<br>(3) 5\\u2605 non-elemental core weapon<br>(4) 5\\u2605 weapon of each element from each group<br><br>The requirements for unlocking weapons from each group are as follows:<br>\\u30fbCore Weapons<br>3\\u2605 non-elemental weapon: no Smithy Lv. or other requirements<br>4\\u2605 non-elemental weapon: fully upgraded 3\\u2605 non-elemental weapon and Smithy Lv. 4+<br>5\\u2605 non-elemental weapon: fully upgraded 4\\u2605 non-elemental weapon and Smithy Lv. 5+<br>5\\u2605 weapon of each element: fully upgraded 5\\u2605 non-elemental weapon and Smithy Lv. 6+<br>\\u30fbVoid Weapons: fully upgraded 5\\u2605 non-elemental core weapon and Smithy Lv. 7+<br>\\u30fbChimeratech Weapons: fully upgraded 5\\u2605 non-elemental core weapon and Smithy Lv. 8+<br>\\u30fbHigh Dragon Weapons: fully upgraded 5\\u2605 non-elemental core weapon, void weapon of matching type and element, and Smithy Lv. 7+<br>\\u30fbAgito Weapons: fully upgraded 5\\u2605 non-elemental core weapon, chimeratech weapon of matching type and element, and Smithy Lv. 8+<br><br>Note: A &quot;fully upgraded&quot; weapon is one that has had its stat and functionality upgrade nodes fully unlocked as described later on in this notification.<br><br>3. Other weapons<br>The following weapons may be equipped and upgraded if the player possesses them:<br>\\u30fbSoldier&#39;s Brand<br>\\u30fbLucky Hanetsuki Paddle<br>\\u30fbMega Sword, Mega Blade, Mega Dagger, Mega Axe, Mega Lance, Mega Bow, Mega Wand, and Mega Staff<br><br>The following weapons may only be equipped and will not be displayed under the &quot;Other&quot; heading:<br>\\u30fbBattleworn Sword, Battleworn Blade, Battleworn Dagger, Battleworn Axe, Battleworn Lance, Battleworn Bow, Battleworn Wand, Battleworn Staff<\/div><hr><div><br><strong>\\u25a0Upgrading Weapons<\/strong><br>1. Improving weapon stats<br>In the next update and beyond, a weapon&#39;s stats will be upgraded by spending whetstones to unlock HP &amp; Strength nodes. Unbinding and refining a weapon as described below will be necessary to upgrade these stats to their maximum values.<br><br>2. Unbinding weapons<br>Unlock a weapon&#39;s unbinding nodes to increase the maximum number of times that its HP &amp; Strength nodes can be unlocked.<br><br>In Version 1.23.1 and earlier, unbinding was performed using copies of a weapon. In the next update and beyond, unbinding them will be performed by spending materials instead. Steel Bricks, Damascus Ingots, and Adamantite Ingots may continue to be used to unbind weapons.<br><br>Weapons with a weapon skill can be unbound to a certain stage to level up that weapon skill. In addition, certain weapons will unlock weapon skins when unbound.<br><br>3. Refining weapons<br>Unlock a weapon&#39;s refinement nodes to increase the maximum number of times that the weapon can be unbound. Refining a weapon requires materials, and a weapon&#39;s skills and abilities may change after refinement.<br><br><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/ccf282f4032bd4e9083c7392fa8bcf80.png\\"><\/div><div><br><\/div><div>4. Augmenting weapons<br>In the next update and beyond, weapons may no longer be upgraded with augments. Fortifying Jewels (the specialized items that increase the HP provided by a weapon in Version 1.23.1 and earlier) will be removed.<br>Note: Because weapons may no longer be improved with augments, we will not be adding Amplifying Jewels (the specialized items that increase the strength provided by a weapon) previously announced for a future update.<\/div><hr><div><br><\/div><div><strong>\\u25a0Weapon Functionality<\/strong><br>1. Copies of weapons<br>In Version 1.23.1 and earlier, multiple copies of the same weapon could be obtained. In the next update and beyond, only one of each weapon may be obtained. By unlocking a weapon&#39;s copies, team members may equip up to four of the same weapon.<br><br>Notes:<br>\\u30fbWeapon storage will be removed.<br>\\u30fbCertain weapons must be unbound to a certain level before their copies can be unlocked.<br>\\u30fbIf a player obtains a weapon that they already have, it will be converted into materials or other items.<br><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/bb77c193d650ccf6043e307992cd657f.png\\"><\/div><div><br><\/div><div>2. Weapon slots<br>Each weapon will come with a certain number of slots.<br><br>In Version 1.23.1 and earlier, up to two wyrmprints could be equipped to an adventurer. In the next update and beyond, wyrmprints will be equipped to weapons instead, and can be equipped in a number equal to the number of slots in the weapon.<br><br>The number of slots that a weapon has will vary from weapon to weapon, and slots can be added to a weapon until it has five, allowing it to equip up to five wyrmprints.<br><br>Slots come in two types:<br>\\u30fbSlots for 5\\u2605 wyrmprints (up to three per weapon)<br>\\u30fbSlots for 2\\u2605, 3\\u2605, or 4\\u2605 wyrmprints (up to two per weapon)<br><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/d9cc12a50ee56f2e56e4da638f57e6db.png\\"><\/div><div><br><\/div><div>3. Weapon bonuses<br>By unlocking the weapon bonus for elemental weapons from each group, players can boost their adventurers&#39; stats depending on the type of weapon that they wield. These boosts are reflected on the Castle Information screen.<br><br>Weapon bonuses for certain Agito weapons will be added in the future.<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/bc5f9da9e3335b8cd6a468e32d57a456.png\\"><\/div><div><br><\/div><div>4. Weapon abilities<br>In Version 1.23.1 and earlier, individual weapons came with a variety of abilities that provided advantages in Void Battles, Astral Raids, and Advanced Dragon Trials. In the next update and beyond, these same individual abilities can be made available as generalized weapon abilities by upgrading certain weapons.<br><br>The weapon abilities that are available to a particular weapon will depend on the weapon&#39;s type, and these abilities will take effect regardless of what weapon an adventurer has equipped, as long as the adventurer&#39;s weapon type and element match that of the weapon ability.<br><br>Therefore, you will no longer need to equip a specific weapon with an ability tailored for a particular enemy in order to benefit from it as long as you have previously unlocked that weapon ability for the weapon type that you are using.<br><br>Certain weapons will unlock weapon skins when their weapon abilities are unlocked. The list of weapon abilities that you have unlocked can be viewed in-game.<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/e26dc1e67c40738e506bc8a80b249523.png\\"><\/div><hr><div><br><\/div><div><strong>\\u25a0Other Changes<\/strong><br>1. Weapon-related endeavors<br>With the changes to the weapon system, certain endeavors will be removed, others will have their details or rewards revised, and new endeavors will be added.<br><br>The following endeavors will be affected:<br><br>\\u30fbNormal Endeavors<br>Certain endeavors will be removed, new endeavors will be added, and certain endeavor details and rewards will be revised.<br><br>\\u30fbCampaign Unlock Endeavors<br>Certain endeavors will be removed, and certain endeavor details and rewards will be revised.<br><br>\\u30fbThe Royal Regimen<br>Certain endeavor details will be revised.<br><br>\\u30fbEvent Compendium Endeavors<br>Weapons obtainable from the The Miracle of Dragonyule event endeavors in the Event Compendium will be replaced with weapon skins.<br><br>2. Other changes<br>\\u30fbThe tutorial describing how to upgrade weapons that unlocks after players clear &quot;Dragalia Lost&quot; (5-3) in chapter 2 of the main campaign will be replaced with one describing Weapons\/Crafting that unlocks after clearing &quot;New Power&quot; (6-2) in chapter 2 of the main campaign.<br>\\u30fbWeapon storage slots received as rewards from chests found in main campaign maps will be replaced by dragon storage slots and augment items.<br><br>\\u25a0Notes<br>Any adventurers and game screenshots shown are still in development.<br><br>Thank you for playing Dragalia Lost.<\/div>","start_time":1600840800,"prev_article_id":"1581","next_article_id":"1605","image_path":"","update_time":1600858498}}}'