b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":1656,"category_name":"News","pr_category_id":"1","title_name":"This Month in Dragalia Lost","message":"<div>Hello! Yuji Okada here, director of Dragalia Lost.<\/div><div><br><\/div><div>I want to start by thanking you for playing Dragalia Lost. The game has just welcomed its 2nd anniversary, and we couldn&#39;t have met this monumental milestone without the continued passion and support of players like you.<\/div><div><br><\/div><div>The Forgotten Truths raid event is going on now as part of the 2nd anniversary celebration. Ushered through a doorway on the precipice of reality, Zethia finds herself cast back a thousand years before her time. What secrets will she uncover about the Ilian Church, Morsayati, and the very foundation of her most sacred beliefs?<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/7a4fd8f59e572ebfb211cf3928144c26.png\\"><\/div><div><br><\/div><div>Gala Zena, Meene, and Midgardsormr Zero have made their appearance in Gala Dragalia.<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/6ec83465e5912426451122991e8bf248.png\\"><\/div><div><br><\/div><div>Gala Zena uses a staff and is a great offensive healer, making her a reliable cornerstone for your team when tackling various quests. Although she only has a single healing skill, she can create a healing zone that other players can enter at their discretion to restore their HP. She also has an Auspex gauge that fills when her first or second skills are used, and when the gauge is completely filled, she is granted a unique force strike with five increasingly powerful charge levels.<\/div><div><br><\/div><div>\\u25a0Regarding Adjustments to Weapons and Wyrmprints<\/div><div>As a result of the extensive changes made to the weapon, crafting, and wyrmprint systems in Version 2.0, we reset certain progress that players had made in the number of weapons and wyrmprints in their possession, as well as how far those weapons and wyrmprints had been upgraded. At the same time, we provided goodwill gestures to affected players in the form of materials that players had spent to craft and upgrade the affected weapons and wyrmprints. Wyrmprints had their augments reset and were unequipped from teams before being provided as goodwill gestures.<\/div><div><br><\/div><div>Given how radically all of the moving parts of these systems have changed, it was virtually impossible to keep a player&#39;s teams exactly as they were after the update was implemented. In the short term, these changes mean that players may have to re-craft certain weapons and have to re-equip wyrmprints to their teams, and we apologize for any inconvenience that this may cause.<\/div><div><br><\/div><div>Please note that certain weapons that no longer exist in Version 2.0, such as weapons from the Fire Emblem Heroes and Monster Hunter events, may still be unlocked and used as weapon skins by upgrading other weapons.<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/e1fc8c44b114aa5f569d74360be5ebb1.png\\"><\/div><div><br><\/div><div>We understand that these changes are numerous and a lot to take in at once, but we believe that they will benefit the game in the long run. Weapon crafting progression is now more streamlined and easier to understand, and wyrmprints now provide a greater level of flexibility and customization in team-building. We&#39;ve paired these quality-of-life changes with revisions to adventurer and quest balance, and we hope it all adds up to produce an even more enjoyable experience for our players.<\/div><div><br><\/div><div>\\u25a0Regarding the Overhauled Appearance of 3D Models<\/div><div>As players have no doubt noticed, we have implemented a fresh look for adventurers and dragons, bringing the 3D models even closer to their illustrations. We&#39;re not done tweaking though, and we plan to adjust some aspects of the graphics, such as the strength of the shadows, until the presentation is right where we want it. Look forward to more details in a separate notification!<\/div><div><br><\/div><div><br><\/div><div>\\u25a0Plans for This Month<\/div><div>\\u30fbStarting at <span class=\\"local_date\\" data-local_date=\\"1601877600\\"><\/span>, additional story content and difficulty levels for the second half of the Forgotten Truths raid event will unlock. For this event, Omega Level 3 will be added, and this new difficulty level will be quite the struggle to overcome.<\/div><div><br><\/div><div>This event also features a solo-only quest with fixed parameters with the same content as the Omega-difficulty battle, but it&#39;s designed to allow as many players as possible to experience the epic showdown with Morsayati without having to worry about whether or not their team is strong enough to participate.<\/div><div><br><\/div><div>The battle with Morsayati will have four phases, and in each phase the boss will change appearance and use different attacks. Even the stage and background music will change! We hope you enjoy this dynamic battle!<\/div><div><br><\/div><div>\\u30fbStarting at <span class=\\"local_date\\" data-local_date=\\"1601877600\\"><\/span>, a Prize Showcase in which the manacaster-wielding adventurer Ilia will appear will be held. For further details like her stats and skills, please see the corresponding in-game notification.<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/f3a169eb629e224a6b311a8a4b15a70e.png\\"><\/div><div><br><\/div><div>When you summon on a Prize Showcase, you will receive a bonus prize with each summon. It&#39;s been a while since the last Prize Showcase was held, but in the upcoming one, we plan to revise the overall lineup of bonus prizes based on the recent adjustments to game balance. Thank you for your understanding.<\/div><div><br><\/div><div>\\u30fbMaster difficulty will be added to Ciella&#39;s Wrath in The Agito Uprising at <span class=\\"local_date\\" data-local_date=\\"1602223200\\"><\/span>. Quests for solo and co-op play will be added at the same time.<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/7cc40f848002316b91461ff2b602a199.png\\"><\/div><div><br><\/div><div>\\u30fbA Halloween-themed onslaught event will start at <span class=\\"local_date\\" data-local_date=\\"1602482400\\"><\/span>.<\/div><div><br><\/div><div>\\u30fbThe Accursed Archives facility event and Stirring Shadows story event will make a return at <span class=\\"local_date\\" data-local_date=\\"1603087200\\"><\/span>. The adventurer stories for Curran, Heinwald, and Lathna are closely tied to these two events, so use this opportunity to learn more about your allies if you haven&#39;t already!<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/3c0f5b8fa539a34a0f0ead155d871ebf.png\\"><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/c220f68fb292c17162dff572976de914.png\\"><\/div><div><br><\/div><div>\\u30fbChapter 16 of the main campaign will be added at <span class=\\"local_date\\" data-local_date=\\"1603346400\\"><\/span>. As revealed in the latest episode of Dragalia Digest, a new main campaign chapter will be added every two months.<\/div><div><br><\/div><div>In Chapter 16, the Prince and friends set out for a destination due north of Alberia...but who or what is the driving force behind this decision? Even Alberia has begun to change. What&#39;s more, a new adventurer will join you in Chapter 16. Who, you ask? You&#39;ll just have to play to find out!<\/div><div><br><\/div><div><br><\/div><div>\\u25a0Future Updates<\/div><div>\\u30fbWhile Version 2.0 brought with it a bevy of adjustments and improvements to many aspects of the game, we weren&#39;t able to polish some features as much as we had hoped to by its release, and going forward we&#39;ll continue to tweak the systems introduced in this major update.<\/div><div><br><\/div><div>While the ability to equip up to five wyrmprints to a single weapon allows for a large degree of customization, it also means that players have more things to juggle when building a team from scratch. With that in mind, a feature that allows players to register sets is currently in development.<\/div><div><br><\/div><div>Also, in order to help players more quickly find the particular wyrmprint they&#39;re looking for, we&#39;ll consider ways to improve the sorting feature.<\/div><div><br><\/div><div>While we hope that players are enjoying the improvements made to the weapon and crafting systems, we realize that no system is perfect, so if you have any feedback about these changes, please let us know via the Leave Feedback feature in-game.<\/div><div><br><\/div><div>\\u30fbA new difficulty level for the Agito Uprising that&#39;s even tougher than Master is in the works. Materials obtained from clearing quests of this difficulty can be used to upgrade Agito Weapons, but doing so will not increase the parameters much. Players will, however, notice a difference in the upgraded weapon&#39;s appearance. For example, flame-attuned weapons may become engulfed in flames. Take a look!<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/f1ba9903ce871c0d0b272f216dc16624.png\\"><\/div><div><br><\/div><div><br><\/div><div>This new difficulty level is designed to push both your skills at managing resources to make adventurers stronger and precisely controlling them in the heat of battle to their limits. The first of the Agito Uprising quests to feature this difficulty will be Volk&#39;s Wrath. As with other quests, there will be a solo play variant and a co-op variant released at the same time.<\/div><div><br><\/div><div>\\u30fbWe plan to bring back the ranking event held during the 1st anniversary on a wider scale. Last time, players went against the clock in Advanced Dragon Trials, but this time players will compete for the best time in content that is more accessible so that as many players as possible can participate in the event.<\/div><div><br><\/div><div>\\u30fbAs the &quot;Season 0&quot; subtitle of the Alberian Battle Royale suggests, this is just the beginning for the latest game mode. We plan to add new features and provide continuous updates as time goes on.<\/div><div><br><\/div><div>At the moment, we have plans for new skill tokens, new map mechanics, a feature that allows players to unlock skins of adventurers in their roster, and a feature that allows players to use weapon skins.<\/div><div><br><\/div><div>\\u30fbNew high-difficulty quests are in development. These new quests are designed to succeed Advanced Dragon Trials and the Agito Uprising in difficulty progression. We&#39;ll provide more details over time, so stay tuned to This Month in Dragalia Lost and other notifications.<\/div><div><br><\/div><div>\\u30fbFurther new information will be provided in early November. Be sure to stay up to date with the latest news by checking the in-game notifications and our official Twitter account.<\/div><div><br><\/div><div>\\u25a0In Conclusion<\/div><div>Thank you again for your support and especially your patience during the massive changes that accompanied the release of Version 2.0. We understand that many players feel overwhelmed by the size and scale of what has changed, but we hope that over time the adjustments and improvements will speak for themselves. To many&mdash;ourselves included!&mdash;it feels like a whole new game, and we&#39;re just as excited as we were at the launch two years ago to see where we can take Dragalia Lost next.<\/div><div><br><\/div><div>We&#39;re giving all players the following items this month.<\/div><div><br><\/div><div>\\u30fbGold Fafnir x4<br>\\u30fb2,000,000 rupies<br>\\u30fbExquisite Honey x20<br>\\u30fbEldwater x20,000<\/div><div><br><\/div><div>The next installment of This Month in Dragalia Lost will be posted around <span class=\\"local_date\\" data-local_date=\\"1604210400\\"><\/span>.<\/div><div><br><\/div><div>Until then, thanks for reading, and for continuing to play Dragalia Lost!<\/div><div><br><\/div><div>Yuji Okada<\/div><div>Director, Dragalia Lost<\/div><div><br><\/div><div>Notes:<\/div><div>\\u30fbThe gift can be claimed from your goodie box for up to seven days after reception. If the gift isn&#39;t retrieved within seven days, it will be lost.<\/div><div>\\u30fbSummon showcase, event, and update content may change without notice.<\/div><div>\\u30fbAny adventurers and game screenshots shown are still in development.<\/div>","start_time":1601532000,"prev_article_id":"1628","next_article_id":"1638","image_path":"","update_time":1601524708}}}'