b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":1731,"category_name":"News","pr_category_id":"1","title_name":"Regarding Known Issues with Rapid-Fire Manacaster Force Strikes and the Adventurer Kimono Luca [Update]","message":"<div><span style=\\"color: rgb(41, 105, 176);\\"><strong>[Addendum <span class=\\"local_date\\" data-local_date=\\"1624613400\\"><\/span>]<\/strong><\/span><br>It has come to our attention that this message contained erroneous information regarding the time at which these issues will be addressed. We are still in the process of correcting these issues. These will be corrected in the data update releasing on <span class=\\"local_date\\" data-local_date=\\"1624946400\\"><\/span>.<br><br>The correct information is as follows:<br><br>Incorrect: The following issues were addressed in version 2.9.0, which was released around <span class=\\"local_date\\" data-local_date=\\"1624503600\\"><\/span>.<br><br>Correct: The following issues will be addressed in the data update releasing on <span class=\\"local_date\\" data-local_date=\\"1624946400\\"><\/span>.<br><br>We thank you for your patience and hope you continue to enjoy playing Dragalia Lost.<\/div><div><br><\/div><hr><div><span style=\\"color: rgb(41, 105, 176);\\"><strong>[Addendum <span class=\\"local_date\\" data-local_date=\\"1624590000\\"><\/span>]<\/strong><\/span><br>The following issues were addressed in version 2.9.0, which was released around <span class=\\"local_date\\" data-local_date=\\"1624503600\\"><\/span>.<br><br>\\u25bcIssues Affecting Adventurers Who Wield Manacasters in Rapid-Fire Mode<br>\\u30fbBuffs that increase force strike damage are not removed after a certain amount of time has passed or a certain amount of attacks have hit enemies, and will last through the duration of the force strike&#39;s rapid-fire attack.<br>\\u30fbIf a force strike is performed while the user is inflicted with a debuff that affects force strikes, the debuff will not be removed after a certain amount of time has passed, and will last through the duration of the subsequent force strike&#39;s rapid-fire attack.<br><br>\\u25bcIssue Affecting Gala Chelle<br>\\u30fbThe effect of buffs that increase force strike damage are not applied to the adventurer Gala Chelle&#39;s force strikes.<br><br>\\u25bcIssue Affecting Kimono Luca<br>\\u30fbWhen the adventurer Kimono Luca performs a force strike after using a shared skill that increases the damage dealt by his next force strike, the damage increase is applied to every hit of the force strike (for the duration that the player&#39;s finger is held down) instead of only the initial hit.<br><br>In addition, since the adventurer Hunter Sarisse&#39;s shared skill Tactical Retreat was also affected by these issues (due to its interaction with force strike damage), starting on <span class=\\"local_date\\" data-local_date=\\"1624600800\\"><\/span> we will send the three water tomes required to unlock it to players who unlocked it after obtaining Hunter Sarisse and before the release of version 2.9.0.<br><br>Thank you for playing Dragalia Lost.<\/div><div><br><\/div><div><br><\/div><hr><div>We have confirmed two issues affecting the force strikes of adventurers who wield manacasters in rapid-fire mode.<\/div><div><br><\/div><div>\\u25a0Issue Details<\/div><div>\\u30fbBuffs that increase force strike damage are not removed after a certain amount of time has passed or a certain amount of attacks have hit enemies, and will last through the duration of the force strike&#39;s rapid-fire attack.<\/div><div>\\u30fbIf a force strike is performed while the user is inflicted with a debuff that affects force strikes, the debuff will not be removed after a certain amount of time has passed, and will last through the duration of the subsequent force strike&#39;s rapid-fire attack.<\/div><div><br><\/div><div>\\u25a0Affected weapon type<\/div><div>Rapid-fire manacaster<\/div><div><br><\/div><div>\\u25a0Affected adventurer<\/div><div>Lapis<\/div><div><br><\/div><div>We are currently investigating these issues. Any further updates will be added to this notice.<\/div><div><br><\/div><div>Thank you for playing Dragalia Lost.<\/div>","start_time":1603951200,"prev_article_id":"2242","next_article_id":"2045","image_path":"","update_time":1624614201}}}'