b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":1838,"category_name":"News","pr_category_id":"1","title_name":"Dragalia Lost Director Yuji Okada Responds to Player Feedback (from November 29, 2020)","message":"<div>On November 29, 2020, Dragalia Lost director Yuji Okada replied to feedback players sent via the in-game Leave Feedback feature.<\/div><div><br><\/div><div>This notification contains the contents of an interview with director Okada that was conducted by Yumi Uchiyama and Ayaka Asai, voice actors for the Japanese-language version of Dragalia Lost.<\/div><div><br><\/div><div>Notes:<\/div><div>\\u30fbThe feedback featured in this notification was chosen from that received between October 1 and October 31.<\/div><div>\\u30fbTap Feedback on the game&#39;s title screen to open the Leave Feedback screen.<\/div><div>\\u30fbThe content of the interview has been edited for this notification, so wording may differ from the original conversation.<\/div><div>\\u30fbThe content of the responses is from the time of the interview, so content that is in-development may differ by the time of its release in-game.<\/div><div><br><\/div><hr><div>\\u25a0Responses to Feedback<\/div><div>Uchiyama &amp; Asai: Let&#39;s begin with the wyrmsigil system. Many players have written in to praise the ability to obtain an adventurer or dragon of their choice after performing a certain number of summons, but some have also requested that limited-time 4\\u2605 adventurers from seasonal events be included in the pool of redeemable adventurers.<\/div><div><br><\/div><div>Okada: Although the wyrmsigil system was designed to allow players to obtain an adventurer or dragon of their choice after a certain number of summons had been performed, the pool of choices is limited to certain adventurers and dragons, and it is true that we received a lot of feedback in October from players expressing disappointment that limited-time 4\\u2605 adventurers who appeared in past Halloween-themed showcases were not eligible to obtain with wyrmsigils during the Gala Dragalia Remix that was held in tandem with the Halloween event that month.<\/div><div><br><\/div><div>With that said, limited-time 4\\u2605 adventurers were eligible to obtain with wyrmsigils in the recent New Year&#39;s Tidings: A Clawful Caper showcase, and we plan to continue including 4\\u2605 adventurers in the wyrmsigil pool of future showcases in which past limited-time adventurers return or past adventurers are featured.<\/div><div><br><\/div><div><br><\/div><div>Uchiyama &amp; Asai: Players are appreciative of the Advanced Dragon Trials and Agito Uprising double-drops events, especially because singling out certain highly-rewarding quests for bonuses in this manner makes finding co-op partners for them much quicker and easier. With that in mind, these events may have been held specifically for the 2nd anniversary, but players would like to see one or both of them happen on an ongoing basis afterward as well.<\/div><div><br><\/div><div>Okada: These events proved to be quite popular, didn&#39;t they? Since changes to the crafting system included in the 2nd anniversary update resulted in players needing an increasing amount of materials, we plan to hold double-drops events for Void Battles, Advanced Dragon Trials, and the Agito Uprising in the future.<\/div><div><br><\/div><div><br><\/div><div>Uchiyama &amp; Asai: Regarding the auto-play feature, we&#39;ve received a request to allow adventurers to shapeshift into their equipped dragon automatically once the dragon gauge is fully charged. As it stands now, adventurers with a dragondrive gauge or those who rely heavily on shapeshifting mechanics are not able to realize their full potential during auto-play because they cannot shapeshift automatically. Since some of the appeal of Dragalia Lost lies in the freedom to use your favorite adventurers, players feel that this feature should be included.<\/div><div><br><\/div><div>Okada: We are working toward implementing a setting that allows players to specify whether or not adventurers can shapeshift into their equipped dragon automatically during auto-play. We would like to give players the choice in this respect since certain quests may be quicker to complete without shapeshifting into a dragon while others may need that extra push of dragon power to complete reliably.<\/div><div><br><\/div><div><br><\/div><div>Uchiyama &amp; Asai: Despite the extensive balance adjustments implemented in the 2nd anniversary update, it seems that some players are still struggling to use their favorite adventurers when playing high-difficulty content with others. Even if they join a quest with a recently-released adventurer, their co-op partners only seem to want to play with the particular adventurers who have proven to be highly effective for that quest. Perhaps another look at balance is in order?<\/div><div><br><\/div><div>Okada: We are aware that this issue exists, and unfortunately it is a very difficult one to solve to everyone&#39;s satisfaction. Players who use certain adventurers and follow certain strategies (and play with others who do the same) are rewarded for that effort with shorter clear times. However, if this degree of preparation and dedication becomes what players expect from co-op by default, then it becomes very difficult for more casual players or those who wish to use their favorite adventurers to play together with others. We ask for your patience as we work to find a solution that will help alleviate this issue by allowing a variety of adventurers to shine in a variety of content.<\/div><div><br><\/div><hr><div>Director Okada will continue to reply to the feedback players send via Leave Feedback again in the future. We&#39;re looking forward to hearing your comments. (The feedback featured in the next notification will be chosen from feedback received between November 1 and November 30.)<\/div><div><br><\/div><div>Thank you for playing Dragalia Lost.<\/div>","start_time":1607666400,"prev_article_id":"1821","next_article_id":"1839","image_path":"","update_time":1607496558}}}'