b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":2090,"category_name":"News","pr_category_id":"1","title_name":"Dragalia Lost Director Yuji Okada Responds to Player Feedback (from March 28, 2021)","message":"<div>On March 28, 2021, Dragalia Lost director Yuji Okada replied to feedback players sent via the in-game Leave Feedback feature.<\/div><div><br><\/div><div>This notification contains the contents of an interview with director Okada that was conducted by Yumi Uchiyama and Ayaka Asai, voice actors for the Japanese-language version of Dragalia Lost.<\/div><div><br><\/div><div>Notes:<\/div><div>\\u30fbThe feedback featured in this notification was chosen from that received between February 1 and February 28.<\/div><div>\\u30fbTap Feedback on the game&#39;s title screen to open the Leave Feedback screen.<\/div><div>\\u30fbThe content of the interview has been edited for this notification, so wording may differ from the original conversation.<\/div><div>\\u30fbThe content of the responses is from the time of the interview, so content that is in-development may differ by the time of its release in-game.<\/div><div><br><\/div><hr><div>\\u25a0Responses to Feedback from Players<\/div><div>Uchiyama &amp; Asai: Some longtime players have found that their stock of mana has hit its limit. As you may know, a message that informs players of this fact pops up every time they clear a quest as long as their stock remains full, which can quickly become annoying. Would it be possible to add a setting to disable this particular message, or perhaps even increase the mana limit?<\/div><div><br><\/div><div>Okada: While it is true that we programmed the game to display the message &quot;Excess items were discarded because your inventory is full&quot; in circumstances like this as a way to notify the player, I can understand how it could become frustrating to see over and over again. With that in mind, we will consider the suggestions above in addition to exploring new ways for players to spend their stock of mana.<\/div><div><br><\/div><div><br><\/div><div>Uchiyama &amp; Asai: Speaking of mana, some players expressed that they would like the mana circle unlock feature to automatically unlock more than one mana circle at a time or unlock a specified number of mana nodes.<\/div><div><br><\/div><div>Okada: At the moment, players must manually unlock each mana circle one-by-one, but in the future we plan to add a feature that allows them to select a node to unlock and automatically unlock all of the nodes under it.<\/div><div><br><\/div><div><br><\/div><div>Uchiyama &amp; Asai: Some players have expressed that Astral Raids could be more appealing by either eliminating the need to collect astral pieces to play them or increasing the maximum number of astral pieces that can be held at any given time. As an older quest, players have also found the difficulty and rewards lacking compared to the newer ones on offer.<\/div><div><br><\/div><div>Okada: Since the game&#39;s release, Astral Raids have become easier and easier to clear as players have become stronger and stronger. What&#39;s more, Astral Raids were initially the sole source of augments, but players can now earn these important items from other events as well. We would like Astral Raids to remain relevant, so we will consider implementing improvements like reducing the number of astral pieces required to play them.<\/div><div><br><\/div><div><br><\/div><div>Uchiyama &amp; Asai: Dragalia Lost&#39;s background music and songs are often praised by players as some of the best out there, but information on a particular track&#39;s name and author can be hard to track down. Why not add a way to find this information in-game?<\/div><div><br><\/div><div>Okada: For events, this information is included in the corresponding video trailer posted to social media and the in-game notification, but there is no feature in the game itself that allows players to see all of the song names and related information in one place. We will consider adding just such a feature in the future.<\/div><div><br><\/div><hr><div>Director Okada will continue to reply to the feedback players send via Leave Feedback again in the future. We&#39;re looking forward to hearing your comments. (The feedback featured in the next notification will be chosen from feedback received between March 1 and March 31.)<\/div><div><br><\/div><div>Thank you for playing Dragalia Lost.<\/div>","start_time":1617343200,"prev_article_id":"2086","next_article_id":"2088","image_path":"","update_time":1617245872}}}'