b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":2146,"category_name":"Events","pr_category_id":"4","title_name":"Jaldabaoth\'s Piercing Gale Has Arrived in Rise of the Sinister Dominion!","message":"<div>Jaldabaoth&#39;s Piercing Gale was added to Rise of the Sinister Dominion on <span class=\\"local_date\\" data-local_date=\\"1619762400\\"><\/span>. Should players manage the titanic task of repelling the demonic menace descending upon North Grastaea, they will be rewarded with the ability to equip new wyrmprints to their weapons.<\/div><div><br><\/div><div>&quot;I shall mete out bitter judgment upon all who reject my truth!&quot;<\/div><div><br><\/div><div>In ages of exile did his hatred and enmity burgeon,<\/div><div>and now his cries for vengeance upon the world<\/div><div>that sent him hence ring out all the louder.<\/div><div>He, the ruler of immorality, bears a code extolling<\/div><div>all deeds vile and iniquitous&mdash;and so does he<\/div><div>weave sweet memories as enticement, etching<\/div><div>desecrate principles upon the land&#39;s cowed masses.<\/div><div>He is the truth and vitiation of the world: Jaldabaoth!<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/50fdc2d195d92871631f72c84cba500c.png\\"><\/div><div>Required might for Jaldabaoth&#39;s Piercing Gale: Standard (Wind): 22,000<\/div><div>Required might for Jaldabaoth&#39;s Piercing Gale: Expert (Wind): 34,000<\/div><div>Required might for Jaldabaoth&#39;s Piercing Gale: Master (Wind\/Water): 36,000<\/div><div><br><\/div><div>\\u25a0How to Unlock<\/div><div>Players must complete Chapter 16 \/ 4-6 (Normal) of the main campaign in order to play.<\/div><div><br><\/div><div>\\u25a0New Weapon Slots<\/div><div>Players can use the materials obtained from clearing the quest Jaldabaoth&#39;s Piercing Gale to unlock sixth and seventh wyrmprint slots for their flame-attuned Agito weapons. Only wyrmprints obtained from Rise of the Sinister Dominion quests (including Jaldabaoth&#39;s Piercing Gale) may be equipped in a weapon&#39;s sixth or seventh slot.<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/f65d2108f0591ea2119e6170c690242d.png\\"><\/div><div><br><\/div><div>Materials for unlocking the sixth and seventh wyrmprint slots for Agito weapons of elemental attunements other than light and flame will be available from future Rise of the Sinister Dominion quests.<\/div><div><br><\/div><div>\\u25a0New Wyrmprints<\/div><div>Players can obtain special wyrmprints from clearing Rise of the Sinister Dominion quests.<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/38deb583288fb1a2c8b66ca701a27d62.png\\"><\/div><div><br><\/div><div>These special wyrmprints differ from existing wyrmprints in two ways: they may only be equipped in a weapon&#39;s sixth or seventh slot, and upgrading them requires materials that are earned when a duplicate special wyrmprint drops.<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/f9a7274c7bcac690dc32d5ab92bd8248.png\\"><\/div><div><br><\/div><div>\\u25a0Team Change Mechanic<\/div><div>The quest Jaldabaoth&#39;s Piercing Gale: Master features a mechanic that causes the boss to change their elemental attunement mid-battle. When this occurs, players must adapt to this new threat by changing their team, and therefore must prepare two teams of predetermined elemental attunements before embarking on the quest. Be sure that both of your teams are equally ready to take on this challenge!<\/div><div><br><\/div><div>Note: Quests with the Team Change mechanic do not reward Adventurer EXP.<\/div><div><br><\/div><div>\\u25a0Weekly Bonuses<\/div><div>Materials, Fortifying Dragonscales, and Amplifying Dragonscales may be obtained as weekly bonuses for Jaldabaoth&#39;s Piercing Gale quests.<\/div><div><br><\/div><div>Thank you for playing Dragalia Lost.<\/div><div><br><\/div>","start_time":1619762400,"prev_article_id":"30104","next_article_id":"2183","image_path":"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/50fdc2d195d92871631f72c84cba500c.png","update_time":1618976216}}}'