b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":217,"category_name":"Updates","pr_category_id":"2","title_name":"Version Update; [Addendum]","message":"<div>Update 1.4.0 is now available for download. You may install it right now; otherwise, an automatic update will occur at approximately <span class=\\"local_date\\" data-local_date=\\"1548385200\\"><\/span>.<\/div><div><br><\/div><div>With this update, we&rsquo;ve fixed various issues and added and changed some features.<\/div><div><br><\/div><div>To commemorate the update, we&rsquo;ll be sending everyone a tenfold summon voucher! This notice will be modified after they&rsquo;ve been distributed.<\/div><div><br><\/div><div>\\u25a0What&rsquo;s New?<\/div><div>\\u30fbIt&#39;s now possible to play sound from background applications (music applications, for example) while playing Dragalia Lost.<\/div><div>\\u30fbYou can now trade up to 20 of each Greatwyrm wyrmprint in Treasure Trade. [Added on <span class=\\"local_date\\" data-local_date=\\"1548314400\\"><\/span>]<\/div><div><span style=\\"text-align: initial; font-size: 12px;\\">\\u30fbCommunication time while waiting for other players immediately after starting a quest in co-op has been reduced.<\/span><\/div><div>\\u30fbDevices will no longer enter sleep mode while playing with Auto enabled.<\/div><div>\\u30fbDevices will no longer enter sleep mode from the time you enter or create a co-op room until you either leave the room or start the quest.<\/div><div>\\u30fbThe display for total damage done to an enemy when using a skill during a quest has been improved.<\/div><div>\\u30fbUI display settings options have been added for the status bar and the navigation bar on Android devices.<\/div><div>\\u30fbThe screen design has been adjusted slightly.<\/div><div><br><\/div><div>The following additional features and changes will be applied in data updates after <span class=\\"local_date\\" data-local_date=\\"1548394200\\"><\/span>.<\/div><div><br><\/div><div>\\u30fbAn animation displaying the matching attunement bonus will now display on the icon on the edit team and quest preparation screens when an adventurer&#39;s attunement matches that of their equipped weapon and dragon. Wyrmprints will not be considered.<\/div><div>\\u30fbA penalty will be applied to players who&#39;re inactive for a certain amount of time during co-op, regardless of whether the player is the host or the guest. If a player receives a penalty a certain number of times consecutively, they&#39;ll be unable to participate in co-op for some time. If they are participating in co-op as a guest, they will be forced to exit the quest.<\/div><div>\\u30fbThe number of Glorious Tempest and Volcanic Queen wyrmprints you can acquire from Treasure Trade has been increased. In addition to the fully unbound wyrmprints (one each), you can also trade for wyrmprints that haven&#39;t been unbound (up to 15 of each). [Update <span class=\\"local_date\\" data-local_date=\\"1548314400\\"><\/span>] The implementation date of this change has been corrected.<\/div><div><br><\/div><div>The following additional features and changes will be applied after the maintenance scheduled for <span class=\\"local_date\\" data-local_date=\\"1548727200\\"><\/span> to <span class=\\"local_date\\" data-local_date=\\"1548745200\\"><\/span>. For more information about this maintenance, see the Forced Exit Maintenance on 1\/29(JST) notification.<\/div><div><br><\/div><div>\\u30fbWhen playing a quest in co-op, hosts can now participate without expending stamina by using getherwings.<\/div><div>\\u30fbPlayers will now be guaranteed a 5\\u2605 adventurer when performing the initial tutorial summon after creating game data.<\/div><div>\\u30fbWhen you&#39;re unable to find a co-op room using Find a Room, you&#39;ll now be asked if you wish to automatically create a room.<\/div><div><br><\/div><div>\\u25a0Issues Fixed<\/div><div>The following issues have been fixed in this version.<\/div><div>\\u30fbWhen scrolling through the list of notices, tapping a banner would sometimes take you to the wrong notice.<\/div><div>\\u30fbSometimes the correct amount of HP would not be restored when shapeshifting ends if an HP Up buff was received while shapeshifted.<\/div><div>\\u30fbSometimes it was not possible to use Force Strike while playing with Auto enabled.<\/div><div>\\u30fbThe boss enemy did not appear in the main story quest Chapter 6 \/ EX 1-1, Woodland Blitz, when shapeshift was used to destroy fallen trees.<\/div><div>\\u30fbThe boss icon that should display over the entrance to the boss area on the minimap was not displaying in certain quests.<\/div><div>\\u30fbUsing Julietta&#39;s Force Strike under certain conditions while playing the Battle at the Wartarch Ruins: Master event quest in co-op would cause communication to be disrupted.<\/div><div>\\u30fbShapeshifting in certain areas while playing the Battle at Myriage Lake event quest would cause you to be transported to other areas.<\/div><div>\\u30fbSilver Slimes sometimes did not appear when playing Avenue to Fortune: Standard.<\/div><div>\\u30fbTravel distance was shortened for lance adventurers who use Force Strike in specific locations, such as puddles of water or poison.<\/div><div>\\u30fbThe Doublebuff wyrmprint ability for A Wish Upon the Yuletree, Valiant Crown, or Sisters of the Anvil would trigger for certain adventurers when they used a skill that does not buff defense while a defense buff was applied to them.<\/div><div>\\u30fbBleeding was applied to ally adventurers when a skill that inflicts bleeding hit allies afflicted with freeze in co-op.<\/div><div>\\u30fbThe &quot;Increases max HP by X% for the remainder of the quest&quot; buff from Sinoa&#39;s Custom Concoction skill was removed from the HP display of other on-screen adventurers when she uses the Custom Concoction skill again and gets a result other than the &quot;Increases max HP by X% for the remainder of the quest&quot; buff.<\/div><div>\\u30fbIt was possible to use Force Strike while moving by switching adventurers immediately after using Force Strike and then returning to the adventurer again.<\/div><div>\\u30fbThe Notices from the Support Team item under Alerts has been removed. If you wish to change your notification settings, please change them from your device&#39;s app notification settings.<\/div><div>\\u30fbStrength from wyrmprints was not added when shapeshifting.<\/div><div>\\u30fbThe bogged and poisoned afflictions would persist even after the effect duration had elapsed when afflicted under certain conditions.<\/div><div><br><\/div><div>A fix for the following issue will be applied after the maintenance scheduled for <span class=\\"local_date\\" data-local_date=\\"1548727200\\"><\/span> to <span class=\\"local_date\\" data-local_date=\\"1548745200\\"><\/span>. For more information about this maintenance, see the Forced Exit Maintenance on 1\/29(JST) notification.<\/div><div>\\u30fbThe first attack for certain dragons would sometimes not hit when shapeshifting while Auto was enabled.<\/div><div><br><\/div><div>\\u25a0Notes<\/div><div>1. It may take time for the store to reflect the updated information. Players may not be able to perform updates due to their device&rsquo;s data cache being full. If you are unable to perform the update, restart your device and then try downloading it from the store.<\/div><div>2. The schedule and content shown in this notification may change without warning.<\/div><div><br><\/div><div><span style=\\"color: rgb(41, 105, 176);\\"><strong>To be added <span class=\\"local_date\\" data-local_date=\\"1548386100\\"><\/span><\/strong><\/span><br>The following will be sent to players who started the game by <span class=\\"local_date\\" data-local_date=\\"1548385200\\"><\/span><br><br>\\u30fbTenfold Summon Voucher x1<br><br>This will be sent to your goodies box when you log in, and you can claim it until <span class=\\"local_date\\" data-local_date=\\"1548989940\\"><\/span>. This is seven days after it&#39;s sent to your goodie box.<\/div><div><br><\/div><div><span style=\\"color: rgb(41, 105, 176);\\"><strong>Addendum <span class=\\"local_date\\" data-local_date=\\"1548912600\\"><\/span><\/strong><\/span><br>We have clarified some of the skill descriptions in the data update applied on <span class=\\"local_date\\" data-local_date=\\"1548912600\\"><\/span>.<br>The skills&#39; actual effects have not been modified.<br><br>The skill descriptions have been changed as follows.<br>\\u30fbBefore: &quot;Increases the user&#39;s critical damage by XX% for 20 seconds.&quot;<br>\\u30fbAfter: &quot;Adds XX% to the modifier applied to the user&#39;s critical damage for 20 seconds.&quot;<br><br>This change was applied to the following weapon skill descriptions:<br>\\u30fbAxe of the Blazing King&#39;s &quot;Blazing Boost&quot;<br>\\u30fbRadiant Swath&#39;s &quot;Radiant Boost&quot;<br>\\u30fbPrimordial Titan&#39;s &quot;Primordial Boost&quot;<br>\\u30fbHalfling&#39;s Broadaxe&#39;s &quot;Halfling&#39;s Focus&quot;<\/div><div><br><\/div><div>Thank you for playing Dragalia Lost.<\/div>","start_time":1548306000,"prev_article_id":"176","next_article_id":"239","image_path":"","update_time":1548913332}}}'