b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":2280,"category_name":"Events","pr_category_id":"4","title_name":"Asura\'s Blinding Light Has Arrived in Rise of the Sinister Dominion!","message":"<div>Asura&#39;s Blinding Light was added to Rise of the Sinister Dominion on <span class=\\"local_date\\" data-local_date=\\"1625205600\\"><\/span>. Should players manage the titanic task of repelling the demonic menace descending upon North Grastaea, they will be rewarded with the ability to equip new wyrmprints to their weapons.<\/div><div><br><\/div><div>At times does she entrust her body to swelling anger.<br>At times does she tremble with sorrowful rage.<br>At times does she slaughter with coldhearted abandon.<br>Seeking endless conflict within the confines of death and rebirth,<br>she is a monster of legion. She is Asura. And to look upon<br>her face is to witness an insatiable craving for conflict.<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/31a177e03fa5b708eb85067d2d9ae97b.png\\"><\/div><div><br><\/div><div>Required might for Asura&#39;s Blinding Light: Standard (Light): 22,000<\/div><div>Required might for Asura&#39;s Blinding Light: Expert (Light): 34,000<\/div><div>Required might for Asura&#39;s Blinding Light: Master (Light\/Wind): 36,000<\/div><div><br><\/div><div>\\u25a0How to Unlock<\/div><div>Players must complete Chapter 16 \/ 4-6 (Normal) of the main campaign in order to play.<\/div><div><br><\/div><div>\\u25a0New Weapon Slots<\/div><div>Players can use the materials obtained from clearing the quest Asura&#39;s Blinding Light to unlock sixth and seventh wyrmprint slots for their shadow-attuned Agito weapons. Only wyrmprints obtained from Rise of the Sinister Dominion quests (including Asura&#39;s Blinding Light) may be equipped in a weapon&#39;s sixth or seventh slot.<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/be65ad316f24374448e1895778ee0777.png\\"><\/div><div><br><\/div><div>Materials for unlocking the sixth and seventh wyrmprint slots for Agito weapons of elemental attunements other than light, flame, and shadow will be available from future Rise of the Sinister Dominion quests.<\/div><div><br><\/div><div>\\u25a0New Wyrmprints<\/div><div>Players can obtain special wyrmprints from clearing Rise of the Sinister Dominion quests.<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/dd3b0b0c2f54e40ff02b1d2d42f5c88f.png\\"><\/div><div><br><\/div><div>These special wyrmprints differ from existing wyrmprints in two ways: they may only be equipped in a weapon&#39;s sixth or seventh slot, and upgrading them requires materials that are earned when a duplicate special wyrmprint drops.<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/95d33eae9909fb9c32094e5604dd1096.png\\"><\/div><div><br><\/div><div>\\u25a0Team Change Mechanic<\/div><div>The quest Asura&#39;s Blinding Light: Master features a mechanic that causes the boss to change their elemental attunement mid-battle. When this occurs, players must adapt to this new threat by changing their team, and therefore must prepare two teams of predetermined elemental attunements before embarking on the quest. Be sure that both of your teams are equally ready to take on this challenge!<\/div><div><br><\/div><div>Note: Quests with the Team Change mechanic do not reward Adventurer EXP.<\/div><div><br><\/div><div>\\u25a0Weekly Bonuses<\/div><div>Materials, Fortifying Dragonscales, and Amplifying Dragonscales may be obtained as weekly bonuses for Asura&#39;s Blinding Light quests.<\/div><div><br><\/div><div>Thank you for playing Dragalia Lost.<\/div>","start_time":1625205600,"prev_article_id":"30108","next_article_id":"2287","image_path":"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/31a177e03fa5b708eb85067d2d9ae97b.png","update_time":1625305247}}}'