b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":2366,"category_name":"Updates","pr_category_id":"2","title_name":"Version Update [Update]","message":"<div><span style=\\"color: rgb(41, 105, 176);\\"><strong>[Addendum <span class=\\"local_date\\" data-local_date=\\"1627354800\\"><\/span>]<\/strong><\/span><br>As a token of our appreciation, the following item has been sent to players who started playing before <span class=\\"local_date\\" data-local_date=\\"1627354800\\"><\/span>.<br><br>\\u30fbTenfold Summon Voucher &times; 1<br><br>This gift can be claimed from your goodie box for up to seven days after reception. If the gift isn&#39;t retrieved within seven days, it will be lost.<br><br>Thank you for playing Dragalia Lost.<\/div><div><br><\/div><hr><div>Version 2.10.0 will be available for download around <span class=\\"local_date\\" data-local_date=\\"1627182000\\"><\/span>. An automatic update will occur at approximately <span class=\\"local_date\\" data-local_date=\\"1627354800\\"><\/span>.<br><br>When you update to version 2.10.0 and play co-op, you will no longer be matched with players using earlier versions of the game. Rooms created by players playing earlier versions will not display in the Room List, and you will not be able to join them using Find a Room, Join Nearby Players, Enter an ID, or alliance chat.<br><br>To celebrate the update, we&#39;ll be sending all players a Tenfold Summon Voucher after the automatic update. This notice will be updated after it has been distributed.<br><br>Note: The Tenfold Summon Voucher will not be distributed until after the automatic update, even if you complete the update to version 2.10.0 early.<br><br>\\u25a0Update Details<br>\\u30fbPlayers will be able to use skip tickets to clear quests that award a daily bonus (excluding Trials of the Mighty) with just one tap from a central location.<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/f8b80c0165bb883fe4f0bc7491f51702.png\\"><\/div><div><br><\/div><div>\\u30fbThe user interface for the main campaign will be improved.<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/2e3bad082fdf8efceee86d129a7ebbd7.png\\"><\/div><div><br><\/div><div>\\u30fbPlayers will be able to choose whether or not to accept the daily bonus (assuming that they have one stock available) when clearing a Trials of the Mighty quest starting on <span class=\\"local_date\\" data-local_date=\\"1627365600\\"><\/span>.<br><br>\\u30fbPlayers will be able to trade steel bricks, moonlight stones, and mana for certain items in the Special section of the Treasure Trade starting on <span class=\\"local_date\\" data-local_date=\\"1627365600\\"><\/span>. Depending on the item offered for trade, players may obtain valuable resources in exchange.<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/ce8a7c446e45cad51a386258da25fa5a.png\\"><\/div><div><br><\/div><div>\\u30fbIn order to improve the auto-play experience in version 2.10.0 and beyond, all adventurers with the dragondrive mechanic will activate dragondrive when controlled by the game&#39;s AI (in the current version, only certain adventurers do), and Gala Notte will use her unique shapeshift (metamorphosis) automatically when controlled by the game&#39;s AI.<br><br>\\u30fbThe user interface for the Summon screen will be adjusted to include the ending dates and times for each active summon showcase.<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/a2503d79aedc4d9c2b43e25313002866.png\\"><\/div><div><br><\/div><div>\\u25a0Other Changes<br>\\u30fbThe user interface for matching with other players in co-op will be adjusted (with particular adjustments for Rise of the Sinister Dominion quests on Master difficulty).<br>\\u30fbThe name and email address registered to the currently linked Nintendo Account will be displayed on the Account Management screen (accessible by tapping the book icon on the Home screen, then Other, then Account Management).<br>\\u30fbAn indicator will appear on a particular weapon type&#39;s icon on the Crafting and Upgrade screens when players have enough materials to upgrade one or more of those weapons. In addition, the number of copies of particular weapon will no longer affect whether or not the game displays an indicator for that weapon.<br>\\u30fbOn the Weapons and Crafting screens, the text that indicates the number of copies of a particular weapon will be replaced with text that indicates the number of slots the weapon has.<br>\\u30fbIf an adventurer equips a Battleworn version of a weapon, their Wyrmprint tab will be grayed out on the Edit Teams screen.<br>\\u30fbOn the Wyrmprints and Upgrade Wyrmprints screens, players will be able to search for a particular wyrmprint by entering its name or the name of one of its abilities directly into the search field.<br>\\u30fbPlayers will be able to sort wyrmprints by their abilities in the Details view.<br>\\u30fbAn animation that plays when augmenting a wyrmprint will be added.<br>\\u30fbWhen returning to the Upgrade Wyrmprints screen after viewing a wyrmprint, the scrolling slider will return to its previous position instead of resetting to the top of the screen.<br>\\u30fbPlayers will be able to choose whether or not a sound effect plays when an overdrive counter is successfully executed.<br><br>\\u25a0Balance Adjustments<br>\\u30fbStarting on <span class=\\"local_date\\" data-local_date=\\"1627624800\\"><\/span>, while playing co-op in Tartarus&#39;s Wrath, adventurers who are bound by Dimensional Shift will no longer be freed after a certain amount of time has passed.<br>\\u30fbStarting on <span class=\\"local_date\\" data-local_date=\\"1627624800\\"><\/span>, while playing Tartarus&#39;s Wrath, Tartarus will use Retribution when the entire team becomes bound by Dimensional Shift. Unless players destroy the weak point that appears, Tartarus will wipe out the entire team.<br>\\u30fbWhen successfully executing an overdrive counter, the amount that players can reduce the enemy&#39;s overdrive mode gauge may not exceed a set maximum. This change will not affect how players strategize for quests.<br><br>\\u25a0Issues Addressed<br>\\u30fbWhen using a helper skill with an effect that doesn&#39;t activate again for a certain amount of time after activation, the effect may activate earlier than intended.<br>\\u30fbWhile playing co-op in Ayaha &amp; Otoha&#39;s Wrath on Standard and Expert difficulties, the effects for buffs and debuffs applied to enemies will not always display on guest devices, or will continue to display after they have ended.<br>\\u30fbSkill and ability buff durations and the durations of effects from abilities that don&#39;t activate again for a certain amount of time after activation may not decrease as intended if used by a helper.<br><br>Notes:<br>1. It may take time for the store to reflect the updated information. Players may not be able to perform updates due to their device&#39;s data cache being full. If you are unable to perform the update, restart your device, and then try downloading it from the store.<br>2. Any adventurers and game screenshots shown are still in development.<br><br>Thank you for playing Dragalia Lost.<\/div>","start_time":1626663600,"prev_article_id":"2274","next_article_id":"2421","image_path":"","update_time":1627354779}}}'