b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":2386,"category_name":"News","pr_category_id":"1","title_name":"This Month in Dragalia Lost","message":"<div>Hello, everyone! Yuji Okada here, director of Dragalia Lost.<br><br>First off, as always, thank you for playing Dragalia Lost. I&#39;m again excited to bring you the latest news on what&#39;s happening in and around the game this month.<br><br>\\u25a0The Stranded Scions Raid Event Is Here!<br>How are you enjoying the latest raid event, Stranded Scions? Those of you who have played chapter 12 of the main campaign may find the idea of Leonidas and the prince teaming up with the other royal siblings a bit hard to believe, but I&#39;ve always thought that this sort of situation would make for a fun event.<br><br>Play through the event to add the adventurer Summer Prince to your roster. This version of everyone&#39;s favorite scion comes with a unique twist that solo players can enjoy with the &quot;Camera Settings during Skills&quot; option enabled&mdash;he can take center stage with a special animation when using a skill! It can be difficult to appreciate the visual impact of an adventurer&#39;s skills in the chaos of battle, but this feature means that no foe can stop Summer Prince from being the star of the show.<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/3abe95f77b2df277136d63dfdd281708.png\\"><\/div><div><br><\/div><div>The adventurers Gala Audric and Summer Leonidas are featured in a Gala Dragalia available now.<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/0ffb0b292cb0ed2dce1246f889c1f18c.png\\"><\/div><div><br><\/div><div>\\u25a0Plans for This Month<br>\\u30fbThe adventurer Summer Chelle and dragon Summer Cat S&igrave;th will appear in a Prize Showcase starting on <span class=\\"local_date\\" data-local_date=\\"1628056800\\"><\/span>. For further details, like their stats and skills, please see the corresponding in-game notification.<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/ffd5fc986773110cfefd1c3ab931ffd4.png\\"><\/div><div><br><\/div><div>\\u30fbShadow- and flame-attuned versions of Lilith will appear as raid bosses in Trials of the Mighty. As usual, only certain element types will be eligible for these battles, but this time there will be no restrictions on weapon types. Materials for unlocking the 5\\u2605 adventurer Gala Cleo&#39;s mana spiral will be available from the daily bonus for the shadow-attuned Lilith battle, and materials for unlocking the 5\\u2605 adventurer Lea&#39;s mana spiral will be available from the daily bonus for the flame-attuned Lilith battle.<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/a26e216e95839fd60c005717dd006f03.png\\"><\/div><div><br><\/div><div>In the upcoming Light Legion&#39;s Trial, players will have to defeat multiple enemies in large-scale battles akin to The Imperial Onslaught. Materials for unlocking the 4\\u2605 adventurer Vixel&#39;s mana spiral will be available from the daily bonus for this quest.<\/div><div><br><\/div><div>\\u30fbA yukata-clad Cleo will make an appearance as an adventurer in an onslaught event in mid-August.<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/1580d6f93b781869cbe2961b80284c5a.png\\"><\/div><div><br><\/div><div>\\u30fbA Time Attack Challenges event pitting you against wind-attuned enemies will be held in late August. This time you&#39;ll be up against the piercing gale himself, Jaldabaoth.<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/9a88423921040d088b21adb0cd42f739.png\\"><\/div><div><br><\/div><div>\\u30fbPart one of chapter 21 of the main campaign will be added in late August. The adventure continues at the summit of the Sacred Tree as paths and opinions cross...<br><br>\\u30fbAn invasion event will take place in late August that will further explore the history and motivations of several characters who appear in the main campaign. I hope you&#39;ll enjoy delving into their past and learning more about how their present came to be.<\/div><div><br><\/div><div>\\u25a0Future Updates<br>\\u30fbIn an update in late August, we will add additional wyrmprint affinity bonuses that grant affliction resistance. As with existing affinity bonuses of this type, you will be able to enjoy 100% resistance to a certain affliction by equipping the requisite number of wyrmprints tied to these new affinity bonuses. While we of course plan to tie these affinity bonuses to upcoming wyrmprints, we are also considering tying them to existing wyrmprints as well. Further information will be provided in an upcoming in-game notification, so stay tuned.<br><br>\\u30fbThe game&#39;s three-year anniversary in late September is fast approaching. Like last year and the year before that, we plan to commemorate this momentous milestone with a variety of celebratory events. While players may be expecting this year&#39;s anniversary story to focus on Dragalia Lost&#39;s past, I&#39;m happy to announce that it will take a different direction than the previous two anniversaries. I hope you&#39;re looking forward to seeing what surprises we have in store this year!<br><br>\\u25a0In Conclusion<br>Thank you for reading this month&#39;s update. We&#39;re giving all players the following gift this month.<br><br>\\u30fbChampion&#39;s Testament x 2<br>\\u30fbSummon Voucher x 3<\/div><div><br><\/div><div>The next installment of This Month in Dragalia Lost will be posted around <span class=\\"local_date\\" data-local_date=\\"1630476000\\"><\/span>. Until then, thanks for reading and for continuing to play Dragalia Lost!<br><br><\/div><div>Yuji Okada<br>Director, Dragalia Lost<br><br>Notes:<br>\\u30fbThe gift can be claimed from your goodie box for up to seven days after reception. If the gift isn&#39;t retrieved within seven days, it will be lost.<br>\\u30fbSummon showcase, event, and update content may change without notice.<br>\\u30fbAny adventurers and game screenshots shown are still in development.<\/div>","start_time":1627797600,"prev_article_id":"2374","next_article_id":"2352","image_path":"","update_time":1627622888}}}'