b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":239,"category_name":"Updates","pr_category_id":"2","title_name":"Version Update[Addendum]","message":"<div>Update Ver.1.4.5 is now available for download! You may install it right now; otherwise, an automatic update will occur at approximately <span class=\\"local_date\\" data-local_date=\\"1550113200\\"><\/span>.<\/div><div><br><\/div><div>To commemorate the update, we&rsquo;ll be sending everyone a Tenfold Summon Voucher. This notice will be modified after they&rsquo;ve been distributed.<\/div><div><br><\/div><div>With this update, we&rsquo;ve implemented new content and a new event, made various changes, and fixed some issues.<\/div><div><br><\/div><div>\\u25a0Event and New Content Implemented<\/div><div>The following have been implemented.<\/div><div>1. New event Valentine&#39;s Confections added<\/div><div>The new event Valentine&#39;s Confections will start <span class=\\"local_date\\" data-local_date=\\"1550124000\\"><\/span>.<\/div><div><br><\/div><div>2. Advance preparation for Void Battles<\/div><div>We will share more information about Void Battles in a notification on <span class=\\"local_date\\" data-local_date=\\"1550124000\\"><\/span>.<\/div><div><br><\/div><div>\\u25a0Changes<\/div><div>The following changes have been made.<\/div><div>1. Changed the rules for when the Elemental Ruins event quests open<\/div><div>Up until now, the elemental ruin quests you could challenge varied based on the day of the week, but from now on you will be able to challenge Beginner and Standard quests for all elements at any time. The Expert quest you can challenge will continue to change based on the day of the week.<\/div><div>Additionally, up until now Beginner and Standard quests for all elements were available on weekends, but you will now be able to challenge Beginner, Standard, and Expert quests.<\/div><div><br><\/div><div>The changes to the rules for when the Elemental Ruins event quests open will be made after a data update scheduled for approximately <span class=\\"local_date\\" data-local_date=\\"1550122200\\"><\/span>.<\/div><div><br><\/div><div>2. Other changes<\/div><div>The game will now display a pop-up notice when you acquire a facility as a reward for clearing the main story to let you know that you have acquired it.<\/div><div><br><\/div><div>\\u25a0Issues Fixed<\/div><div>The following issues have been fixed in this version.<\/div><div>\\u30fbDebuff effects apply to adventurers in your team who are afflicted with freeze.<\/div><div>\\u30fbWhen playing with Estelle as your helper, her Healing Faith helper skill does not restore HP when the adventurer you are controlling has the lowest HP percentage in the team.<\/div><div>\\u30fbThe notification list screen does not display properly on some devices.<\/div><div><br><\/div><div>Fixes for the following issues will be applied after a data update scheduled for approximately <span class=\\"local_date\\" data-local_date=\\"1550122200\\"><\/span>.<\/div><div>\\u30fbWhen playing a quest with Auto enabled, the AI sometimes uses certain recovery skills even if HP has not been decreased.<\/div><div>\\u30fbWhen playing a quest with Auto enabled when there is an adventurer wielding a dagger that has a recovery skill in the party, the recovery skill is sometimes used immediately after continuing.<\/div><div><br><\/div><div>Notes:<\/div><div>1. It may take some time for the store to reflect the updated information. Players may not be able to perform updates due to their device&rsquo;s data cache being full. If you are unable to perform the update, restart your device and then try downloading the update from the store.<\/div><div>2. The schedule and content shown in this notification may change without warning.<\/div><div><br><\/div><div><span style=\\"color: rgb(41, 105, 176);\\"><strong>To be added <span class=\\"local_date\\" data-local_date=\\"1550114100\\"><\/span><\/strong><\/span><br>The following will be sent to players who started the game by <span class=\\"local_date\\" data-local_date=\\"1550113200\\"><\/span><br><br>\\u30fbTenfold Summon Voucher x1<br><br>This will be sent to your goodies box when you log in, and you can claim it until <span class=\\"local_date\\" data-local_date=\\"1550717940\\"><\/span>. This is seven days after it&#39;s sent to your goodie box.<\/div><div><br><\/div><div>Thank you for playing Dragalia Lost.<\/div>","start_time":1549940400,"prev_article_id":"217","next_article_id":"266","image_path":"","update_time":1550114127}}}'