b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":2421,"category_name":"Updates","pr_category_id":"2","title_name":"Version Update [Update]","message":"<div><span style=\\"color: rgb(41, 105, 176);\\"><strong>[Addendum <span class=\\"local_date\\" data-local_date=\\"1630033200\\"><\/span><\/strong><\/span><br>As a token of our appreciation, the following item has been sent to players who started playing before <span class=\\"local_date\\" data-local_date=\\"1630033200\\"><\/span>.<br><br>\\u30fbTenfold Summon Voucher &times; 1<br><br>This gift can be claimed from your goodie box for up to seven days after reception. If the gift isn&#39;t retrieved within seven days, it will be lost.<br><br>Thank you for playing Dragalia Lost.<\/div><div><br><\/div><hr><div>Version 2.11.0 will be available for download around <span class=\\"local_date\\" data-local_date=\\"1629946800\\"><\/span>. An automatic update will occur at approximately <span class=\\"local_date\\" data-local_date=\\"1630033200\\"><\/span>.<\/div><div><br><\/div><div>When you update to version 2.11.0 and play co-op, you will no longer be matched with players using earlier versions of the game. Rooms created by players playing earlier versions will not display in the Room List, and you will not be able to join them using Find a Room, Join Nearby Players, Enter an ID, or alliance chat.<\/div><div><br><\/div><div>To celebrate the update, we&#39;ll be sending all players a Tenfold Summon Voucher after the automatic update. This notice will be updated after it has been distributed.<\/div><div><br><\/div><div>Note: The Tenfold Summon Voucher will not be distributed until after the automatic update, even if you complete the update to version 2.11.0 early.<\/div><div><br><\/div><div>\\u25a0Update Details<\/div><div>\\u25bcBolster Your Affliction Resistance With New Affinity Bonuses!<\/div><div>Equipping multiple wyrmprints with the same affinity will activate an affinity bonus. Five new affinities will be added, and they can be used to activate affinity bonuses that provide resistance to the poison, freeze, blindness, bog, or sleep afflictions. Ability effects provided by affinity bonuses will stack with ability effects provided by wyrmprints but do not share limits.<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/6f2c239c2632e2d0eb8a16c4405db259.png\\"><\/div><div>The existing wyrmprints listed below will feature one of these new affinities starting in a data update around <span class=\\"local_date\\" data-local_date=\\"1630044000\\"><\/span>.<\/div><div><br><\/div><div>\\u30fbWinds of Saint Lotier<\/div><div>\\u30fbWelcome, One and All<\/div><div>\\u30fbThe Heretic&#39;s Laboratory<\/div><div>\\u30fbDestiny&#39;s Hand<\/div><div>\\u30fbOne with the Shadows<\/div><div>\\u30fbHappier Times<\/div><div>\\u30fbKicking Back<\/div><div>\\u30fbEgg-Shaped Dreams<\/div><div>\\u30fbTreasury of Knowledge<\/div><div>\\u30fbFresh Perspective<\/div><div>\\u30fbFallen Wings<\/div><div>\\u30fbTo My Dear Child<\/div><div>\\u30fbTwo Myms<\/div><div>\\u30fbThe Ilian Faithful<\/div><div>\\u30fbMemories of Summer&#39;s Dusk<\/div><div><br><\/div><div>To see which new affinity is assigned to which wyrmprint, please check the wyrmprint selection screen accessible when editing teams in-game after the data update around <span class=\\"local_date\\" data-local_date=\\"1629698400\\"><\/span>. For details on the number of affinities required to activate an affinity bonus and the effects that affinity bonuses provide, please check the All Affinity Bonuses section of the wyrmprint selection screen accessible when editing teams in-game.<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/46835571dcc9f329c95589ae66a8e743.png\\"><\/div><div>\\u25a0Other Changes<\/div><div>\\u30fbThe facial expressions of adventurers during their victory animation will be adjusted. This will not affect certain adventurers with unique victory animations.<\/div><div><br><\/div><div>\\u30fbThe behavior of the bleeding debuff will be adjusted. If a player attempts to apply a new stack of bleeding to an enemy when the maximum of three stacks is already applied, the new stack will overwrite the oldest stack with the least potency and lowest duration (so long as the new stack&#39;s potency and duration are greater). This change will make it easier to maintain the damage increase from the maximum of three stacks.<\/div><div><br><\/div><div>Notes:<\/div><div>1. It may take time for the store to reflect the updated information. Players may not be able to perform updates due to their device&#39;s data cache being full. If you are unable to perform the update, restart your device, and then try downloading it from the store.<\/div><div>2. Any adventurers and game screenshots shown are still in development.<\/div><div><br><\/div><div>Thank you for playing Dragalia Lost.<\/div>","start_time":1629342000,"prev_article_id":"2366","next_article_id":"2475","image_path":"","update_time":1630033302}}}'