b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":2634,"category_name":"Events","pr_category_id":"4","title_name":"Legend Difficulty for Jaldabaoth\'s Piercing Gale Is Coming to Rise of the Sinister Dominion!","message":"<div>Legend difficulty will be added to Jaldabaoth&#39;s Piercing Gale in Rise of the Sinister Dominion on <span class=\\"local_date\\" data-local_date=\\"1638943200\\"><\/span>.<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/031cc86e9e779ef8abbe04dace7abbc4.png\\"><\/div><div>&quot;I shall mete out bitter judgment upon all who reject my truth!&quot;<\/div><div><br><\/div><div>In ages of exile did his hatred and enmity burgeon, and now his cries for vengeance upon the world that sent him hence ring out all the louder. He, the ruler of immorality, bears a code extolling all deeds vile and iniquitous&mdash;and so does he weave sweet memories as enticement, etching desecrate principles upon the land&#39;s cowed masses. He is the truth and vitiation of the world: Jaldabaoth!<\/div><div><br><\/div><div>\\u25a0Changes to Survival Bonuses and the Number of Revives<\/div><div>Survival bonuses and the number of revives will change on <span class=\\"local_date\\" data-local_date=\\"1638943200\\"><\/span>. The number of revives in Jaldabaoth&#39;s Piercing Gale: Master will be changed to one, and survival bonuses will be added. The number of revives in Jaldabaoth&#39;s Piercing Gale: Expert will be increased to two, and the survival bonus content will be changed. The number of revives in Jaldabaoth&#39;s Piercing Gale: Standard will be increased to three, and the survival bonus content will be changed.<\/div><div><br><\/div><div>\\u25a0Team Change<\/div><div>This quest features a mechanic that causes the boss to change their elemental attunement mid-battle. When this occurs, players must adapt to this new threat by changing their team, and therefore must prepare two teams of predetermined elemental attunements before embarking on the quest. Be sure that both of your teams are equally ready to take on this challenge!<\/div><div><br><\/div><div>\\u25a0Notes<\/div><div>1. Quests with the Team Change mechanic do not reward Adventurer EXP.<\/div><div>2. Players must have completed Chapter 16 \/ 4-6 (Normal) of the main campaign to play Rise of the Sinister Dominion.<\/div><div>3. Players must have completed a Rise of the Sinister Dominion quest on Master difficulty in solo or co-op play to play Jaldabaoth&#39;s Piercing Gale: Legend in solo play.<\/div><div>4. Players must have completed a Rise of the Sinister Dominion quest on Master difficulty in solo or co-op play to play Jaldabaoth&#39;s Piercing Gale: Legend in co-op play.<\/div><div><br><\/div><div>Thank you for playing Dragalia Lost.<\/div>","start_time":1638511200,"prev_article_id":"2625","next_article_id":"2607","image_path":"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/031cc86e9e779ef8abbe04dace7abbc4.png","update_time":1637216712}}}'