b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":2665,"category_name":"News","pr_category_id":"1","title_name":"Dragalia Lost Director Yuji Okada Responds to Player Feedback (from November 28, 2021)","message":"<div>On November 28, 2021, Dragalia Lost director Yuji Okada replied to feedback players sent via the in-game Leave Feedback feature.<\/div><div><br><\/div><div>This notification contains the contents of an interview with director Okada that was conducted by Yumi Uchiyama and Ayaka Asai, voice actors for the Japanese-language version of Dragalia Lost.<\/div><div><br><\/div><div>Notes:<\/div><div>\\u30fbThe feedback featured in this notification was chosen from that received between October 1 and October 31.<\/div><div>\\u30fbTap Feedback on the game&#39;s title screen to open the Leave Feedback screen.<\/div><div>\\u30fbThe content of the interview has been edited for this notification, so wording may differ from the original conversation.<\/div><div>\\u30fbThe content of the responses is from the time of the interview, so content that is in development may differ by the time of its release in-game.<\/div><div><br><\/div><hr><div>\\u25a0Responses to Feedback from Players<\/div><div>Uchiyama &amp; Asai: A player wrote in to request an increase in the amount of drops for the more difficult quests in Rise of the Sinister Dominion. If the rewards for Master difficulty are too similar to those for Expert difficulty, players may not find it worth their time to invest the additional effort required to clear the more difficult version.<\/div><div><br><\/div><div>Okada: When determining Rise of the Sinister Dominion rewards, our intention was to ensure that players who play Expert difficulty are able to sufficiently improve their Agito weapons without feeling pressured to complete Master difficulty. We will consider making adjustments to these rewards when new high-difficulty content that pits players against the Five Greatwyrms in their primordial forms is introduced in December.<\/div><div><br><\/div><div><br><\/div><div>Uchiyama &amp; Asai: In the recent Faith Forsaken (Part Two) raid event, players were able to earn rewards based on how much damage they dealt to the raid boss. Some players enjoyed this change of pace in co-op play but were quickly demoralized when they realized that their results would not be counted if the host left mid-battle. In addition, some were frustrated that they had to wait for lengthy cinematic scenes to finish during the quest on Nightmare difficulty, especially since the event encouraged playing this quest multiple times to earn the full amount of Daily Damage Rewards. For players who prefer to play Nightmare difficulty once a day and move on, it would be nice to have some other form of reward, such as those based on a player&#39;s individual contribution.<\/div><div><br><\/div><div>Okada: Since the Faith Forsaken raid event was held in celebration of the game&#39;s third anniversary, we really wanted to make the climatic showdown with Satan memorable, and adding cinematic scenes was one way to accomplish that. In retrospect, it may have been wise to allow players to skip scenes that they have already seen since these quests are designed to be played at least once a day for the duration of the event. It&#39;s clear that some players prefer to complete their quests as quickly as possible, so we will consider adding a scene skip feature to these sorts of battles. Regarding Daily Damage Rewards, while we feel that this was a good first attempt at this mechanic, there is clearly room for improvement, and we will consider how to implement it in a more enjoyable way in the future.<\/div><div><br><\/div><div><br><\/div><div>Uchiyama &amp; Asai: It&#39;s been just over a year in real time since Leonidas saved the prince from a mob of angry citizens and set him down the path to the faerie kingdom in chapter 16 of the main campaign. He&#39;s surely been preoccupied keeping the affairs of Alberia in order in the prince&#39;s absence, though he did find time for some fun in the sun this past summer. With that said, a particularly dedicated fan is wondering when we will next see him in the main campaign, as he has played a considerable role in the story thus far.<\/div><div><br><\/div><div>Okada: While it would be wonderful to have Leonidas take part in upcoming main campaign chapters, it&#39;s important to remember that the prince&#39;s other siblings also deserve some time in the spotlight. For now, he will focus on maintaining peace and stability at home while the main campaign further explores the lives of the other members of the royal family, but rest assured that you have not seen the last of the first scion.<\/div><div><br><\/div><div><br><\/div><div>Uchiyama &amp; Asai: A linguistically-inclined player wrote in to ask how to say &quot;Please teach me your language&quot; to Surtr, the boss in Rise of the Sinister Dominion who has a unique way of communicating, in the language that he understands. They are very curious to figure out exactly what it is that he&#39;s saying to them during the fight.<\/div><div><br><\/div><div>Okada: Surtr&#39;s quotes and skill names may appear to be gibberish, but they can in fact be translated into English using a certain method. However, I think that not knowing what he&#39;s saying is part of what makes the fight novel and exciting, so you can enjoy it regardless of whether you&#39;re fluent in Surtr&#39;s native tongue.<\/div><div><br><\/div><hr><div>Director Okada will continue to reply to the feedback players send via Leave Feedback again in the future. We&#39;re looking forward to hearing your comments. (The feedback featured in the next notification will be chosen from feedback received between November 1 and November 30.)<\/div><div><br><\/div><div>Thank you for playing Dragalia Lost.<\/div>","start_time":1638943200,"prev_article_id":"2648","next_article_id":"2661","image_path":"","update_time":1638854494}}}'