b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":2768,"category_name":"Events","pr_category_id":"4","title_name":"A Raid Event Revival, A Waltz with Fate, Is Now Live!","message":"<div>Up to four players with four adventurers each (up to 16 adventurers in total!) can battle together in A Waltz with Fate raid event revival, which began on <span class=\\"local_date\\" data-local_date=\\"1647928800\\"><\/span>. Take on event-specific quests to defeat the shadow-attuned raid boss and earn rewards!<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/19ee3ee64c9742871a25dca430f89808.png\\"><br><br>An adventurer, Felicia, will join you during this event. Increase your friendship with her to add her to your roster permanently. You can also collect blazons and emblems to get the dragon Phantom.<br><br>\\u25a0Event Duration<br><span class=\\"local_date\\" data-local_date=\\"1647928800\\"><\/span> to <span class=\\"local_date\\" data-local_date=\\"1648619999\\"><\/span><br>Note: If the event ends while you are in a quest, the quest will continue until the results have been determined. You will be able to earn rewards according to the results of the quest.<br><br>\\u25a0Reward Availability Period<br><span class=\\"local_date\\" data-local_date=\\"1647928800\\"><\/span> to <span class=\\"local_date\\" data-local_date=\\"1649224799\\"><\/span><br>Note: You will be able to perform blazon summons and obtain emblem rewards during this period.<br><br>\\u25a0Temporary Adventurers<br>When you complete quests, you will increase the friendship with any temporary adventurers in your team.<br><br>If you maximize your friendship with a temporary adventurer, they will permanently remain in your collection, allowing you to include them in your team after the event ends. Their level, stats, equipment, and position in your team and collection will be maintained. Even if an event adventurer isn&#39;t permanently added to your collection, any items used to upgrade their level, unlock their mana circles, and promote them will not be returned.<br><br>There are no event adventurer upgrade items or event perks for the adventurer Felicia.<br><br>\\u25a0If Felicia Previously Joined as a Temporary Adventurer<br>You can include Felicia in your team again when this event starts, and she will maintain the same level and stats as when this event was held previously.<br><br>\\u25a0Raid Battles<br>Raid battles are co-op battles where up to four teams (16 adventurers) can cooperate against a raid boss together! To participate in a raid battle, you must either create a room as the host or join a room as a guest.<br><br>\\u30fbAs a Host:<br>Creating a room requires otherworld fragments and getherwings. You can obtain otherworld fragments from boss battles.<br><br>\\u30fbAs a Guest:<br>Joining a room requires otherworld fragments and getherwings. You must have unlocked the respective difficulty to participate in a raid battle.<br><br>\\u25a0Extra Raid Battles<br>To challenge the Extra Raid Battle, you must clear the raid battle on Expert.<br><br>\\u30fbAs a Host:<br>Creating a room requires an otherworld gem. You can obtain otherworld gems from the Expert-, Nightmare-, and Omega-difficulty raid battles.<br><br>\\u30fbAs a Guest:<br>Joining a room requires an otherworld gem. You must have cleared the Expert difficulty to participate in a raid battle.<br><br>\\u25a0Omega Difficulty<br>To challenge Omega difficulty, you must clear the raid battle on Nightmare difficulty. Additionally, to unlock Omega difficulty, you must collect three omega keys. You can obtain one omega key from each type of emblem rewards: bronze emblems, silver emblems, and gold emblems.<br><br>\\u30fbOmega Level 1 (Solo)<br>This quest is for solo play only. It will unlock when you clear the raid battle on Nightmare difficulty.<br><br>\\u30fbOmega Level 1 (Raid)<br>This quest is for co-op play only and will unlock when you clear Omega Level 1 (Solo).<br><br>\\u30fbOmega Level 2 (Solo)<br>This quest is for solo play only and will unlock when you clear Omega Level 1 (Raid).<br><br>\\u30fbOmega Level 2 (Raid)<br>This quest is for co-op play only and will unlock when you clear Omega Level 2 (Solo).<br><br>\\u30fbOmega Level 3 (Solo)<br>This quest is for solo play only and will unlock when you clear Omega Level 2 (Raid).<br><br>\\u30fbOmega Level 3 (Raid)<br>This quest is for co-op play only and will unlock when you clear Omega Level 3 (Solo).<br><br>Omega (Raid) availability:<br><span class=\\"local_date\\" data-local_date=\\"1647928800\\"><\/span> to <span class=\\"local_date\\" data-local_date=\\"1648619999\\"><\/span><br><br>\\u25a0Raid Boosts<br>When you clear raid battles, you&#39;ll be able to get raid boosts, which power up adventurers for this event only. Raid boosts you obtain will stack, and only apply to your team. The maximum effects you can achieve with raid boosts are described below.<br>\\u30fbDamage +100%<br>\\u30fbHP +50%<br>\\u30fbShapeshift Prep +25%<br>\\u30fbDragon Time +50%<br><br>The number of raid boosts you can obtain by clearing a single quest varies depending on the difficulty. There are also special rare raid boosts. In this event, you will not be able to obtain rare raid boosts from boss battles.<br><br>Raid battle co-op rooms will display each team&#39;s boosted might, which factors in the increased power from raid boosts. Boosted might does not affect the might required to start a quest.<br><br>\\u25a0Blazon Summons<br>Complete boss battles and raid battles to obtain peregrine blazons. Blazons collected can be used for blazon summoning to get event-specific 5\\u2605 dragons and other rewards.<br><br>After obtaining the dragon Phantom, you can reset the contents available. From the 5th reset onward, you must accept all rewards before you can reset the contents available.<br><br>\\u25a0Emblems<br>You can obtain rewards based on the total number of emblems you gather during the event.<br><br>\\u25a0Event Endeavors<br>Two types of event endeavors will be available during the event: Daily and Limited.<br><br>\\u25a0Epilogue<br>The epilogue for this event revival will unlock on <span class=\\"local_date\\" data-local_date=\\"1648620000\\"><\/span>. To view it, you must have completed episode 5 of the event story.<br><br>\\u25a0Epilogue Availability<br><span class=\\"local_date\\" data-local_date=\\"1648620000\\"><\/span> to <span class=\\"local_date\\" data-local_date=\\"1649224799\\"><\/span><br><br>Notes:<br>1. During raid battles, you will only recover 1\/4 of the amount of HP from certain skills and abilities.<br>2. Players must have completed up to Chapter 2 \/ 2-1 (Normal) of the main campaign to participate in event quests.<br>3. Players must have completed up to Chapter 2 \/ 2-1 (Normal) of the main campaign to play co-op.<br>4. If you do not maximize your friendship with temporary adventurers during the event, they will not join you after the event ends, regardless of their level or stats.<br>5. If a temporary adventurer permanently joins your roster, you will be able to read their Adventurer Story.<br>6. You will not be able to use blazons, emblems, otherworld gems, or otherworld fragments obtained in this event in future events.<br>7. For details concerning this raid event, check the Help section on the raid event&#39;s top page in the game.<br><br>Thank you for playing Dragalia Lost.<\/div>","start_time":1647928800,"prev_article_id":"2849","next_article_id":"2906","image_path":"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/19ee3ee64c9742871a25dca430f89808.png","update_time":1641958928}}}'