b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":2780,"category_name":"Updates","pr_category_id":"2","title_name":"Version Update [Update]","message":"<div><span style=\\"color: rgb(41, 105, 176);\\"><strong>[Addendum <span class=\\"local_date\\" data-local_date=\\"1643079600\\"><\/span>]<\/strong><\/span><br>As a token of our appreciation, the following item has been sent to players who started playing before <span class=\\"local_date\\" data-local_date=\\"1643079600\\"><\/span>.<br><br>\\u30fbTenfold Summon Voucher &times; 1<br><br>This gift can be claimed from your goodie box for up to seven days after reception. If the gift isn&#39;t retrieved within seven days, it will be lost.<\/div><div><br><\/div><hr><div>Version 2.16.0 will be available for download around <span class=\\"local_date\\" data-local_date=\\"1642993200\\"><\/span>. You may install it when it becomes available; otherwise, an automatic update will occur around <span class=\\"local_date\\" data-local_date=\\"1643079600\\"><\/span>.<\/div><div><br><\/div><div>When you update to version 2.16.0 and play co-op, you will no longer be matched with players using earlier versions of the game. Rooms created by players using earlier versions will not display in the Room List, and you will not be able to join them using Find a Room, Join Nearby Players, Enter an ID, or alliance chat.<\/div><div><br><\/div><div>To celebrate the update, we&#39;ll be sending all players a Tenfold Summon Voucher after the automatic update. This notice will be updated after it has been distributed.<\/div><div><br><\/div><div>Note: The Tenfold Summon Voucher will not be distributed until after the automatic update, even if you complete the update to version 2.16.0 early.<\/div><div><br><\/div><div>\\u25a0Update Details<\/div><div>\\u30fbThe defensive event Shadow of the Mukuroshu and the onslaught event Elementary Escapades will be added to the Event Compendium on <span class=\\"local_date\\" data-local_date=\\"1643090400\\"><\/span>.<\/div><div><br><\/div><div>\\u30fbSupport for upcoming adventurers and quests scheduled to appear in late January through February will be added and certain unresolved issues will be addressed.<\/div><div><br><\/div><div>\\u25a0Balance Adjustments<\/div><div>\\u30fbWhen controlled by the game&#39;s AI, the adventurers Sandalphon and Kimono Notte will no longer automatically activate their unique shapeshift during quests (with the exception of the Kaleidoscape).<\/div><div><br><\/div><div>Sandalphon and Kimono Notte were designed to focus mainly on healing and swap to dealing damage in their shapeshifted forms when such support was no longer required. However, it was difficult for the AI to effectively balance time spent dealing damage and time spent healing since most players rely on these adventurers primarily for their healing rather than damage-dealing capabilities. By ensuring that the AI does not shapeshift at a disadvantageous time, these adventurers will become more reliable in their main role while under the game&#39;s control.<\/div><div><br><\/div><div>\\u25a0Other Changes<\/div><div>\\u30fbThe adventurer Ilia&#39;s alchemic cartridges will be made exempt from the effects of Curse of Nihility on <span class=\\"local_date\\" data-local_date=\\"1643090400\\"><\/span>.<\/div><div><br><\/div><div>\\u30fbA selection of voiced lines for Mini Mids, Mini Hildy, Mini Zodi, Mini Mercs, and Mini Jupi will be added on or after <span class=\\"local_date\\" data-local_date=\\"1643090400\\"><\/span>.<\/div><div><br><\/div><div>\\u30fbThe mana cost for the prince&#39;s Force Strike node in the mana circle tutorial will be changed to 0 on <span class=\\"local_date\\" data-local_date=\\"1643608800\\"><\/span>.<\/div><div><br><\/div><div>[Addendum [<span class=\\"local_date\\" data-local_date=\\"1642658400\\"><\/span>]<br>\\u30fbThe Dawn Amber Intake Boost and Dusk Amber Intake Boost abilities will be added to the Fafnir Upgrades screen in the Kaleidoscape on <span class=\\"local_date\\" data-local_date=\\"1643090400\\"><\/span>. These abilities will trigger on the Results screen.<\/div><div><br><\/div><div>\\u25a0Issues Addressed<\/div><div>The following issue will be addressed in the data update on or around <span class=\\"local_date\\" data-local_date=\\"1643090400\\"><\/span>:<\/div><div><br><\/div><div>\\u30fbThree Gold Fafnirs with which you cannot form a pact currently appear in the Encyclopedia in Notte&#39;s Notes.<\/div><div><br><\/div><div>Notes:<\/div><div>1. It may take time for the store to reflect the updated information. Players may not be able to perform updates due to their device&#39;s data cache being full. If you are unable to perform the update, restart your device, and then try downloading it from the store.<\/div><div>2. Any adventurers and game screenshots shown are still in development.<\/div><div><br><\/div><div>Thank you for playing Dragalia Lost.<\/div>","start_time":1642388400,"prev_article_id":"2737","next_article_id":"2865","image_path":"","update_time":1643079575}}}'