b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":303,"category_name":"News","pr_category_id":"1","title_name":"New Void Enemies and Void Battle Limited-Time Endeavors!","message":"<div>New Void enemies will be added to Void Battles (event quests where you can battle powerful boss enemies) at <span class=\\"local_date\\" data-local_date=\\"1553061600\\"><\/span>!<br>You can craft new weapons using the materials obtained by defeating the newly added Void enemies. Additionally, the Silver Fafnir dragon will be added to the Void Battles Treasure Trade.<br>Furthermore, Limited Void Battle Endeavors will be available between <span class=\\"local_date\\" data-local_date=\\"1553061600\\"><\/span> and <span class=\\"local_date\\" data-local_date=\\"1554011999\\"><\/span>!<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/e9b4baed8a8ce6bd360e389c18958623.png\\"><\/div><div>One day, a call for help from a neighboring city reached the Prince and his companions. Atrocious fiends, including monstrous dragons transformed by the effects of black mana, were wreaking havoc!<\/div><div><br><\/div><div>Void Battles<br>\\u25a0Void Enemies<br>New Void enemies will be added.<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/3327e6fa3955b89cf2fa366e495b1fab.png\\"><\/div><div>Blazing Ghost (Flame), Required Might: 9,000<\/div><div>A tricky and powerful enemy protected by its Ranged Resistance ability!<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/78cfd3c00bab7083e52f082b7e994b11.png\\"><\/div><div>Frost Hermit (Water), Required Might: 10,000<\/div><div>A powerful foe that duplicates itself with its Propagation ability! Watch out for its area-of-effect attack, which inflicts Bog!<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/d93a6d47a0d9e4d04e672ec72950dcb3.png\\"><\/div><div>Obsidian Golem (Shadow), Required Might: 10,000<\/div><div>Watch out for its Dull ability (which greatly decreases strength), and the poison affliction!<\/div><div><br><\/div><div>\\u25a0Crafting<br>Craftable weapons will be added.<br>\\u30fbThe Mushroom Dagger and other weapons crafted using materials obtained from the Wandering Shroom can be enhanced into wind-attuned weapons.<br>\\u30fbThe Hefty Ingot and other weapons crafted using materials obtained from the Steel Golem can be enhanced into light-attuned weapons.<br>Note: Materials obtained from the Obsidian Golem are required to enhance into light-attuned weapons.<br>\\u30fbThe Wind Apogee and other weapons crafted using materials obtained from Void Zephyr can be enhanced into wind-attuned weapons.<br>\\u30fbWeapons that can be crafted using materials obtained from the Blazing Ghost have been added.<\/div><div>\\u30fbWeapons that can be crafted using materials obtained from the Frost Hermit have been added.<br><br>\\u25a0Void Battles Treasure Trade<br>The Silver Fafnir dragon will be added to the Treasure Trade for Void Battles. This dragon&#39;s Mana +25% ability increases the amount of mana that can be acquired when completing quests, so it&#39;s useful for powering up your adventurers.<br>When fully unbound, the Mana +25% ability increases to Mana +50%! What&#39;s more, the ability&#39;s effects stack, so if you equip the dragon to all four members of your team, you can get up to +200% mana! You can trade for Silver Fafnir a maximum of 20 times.<br>Note: The exchange limit does not reset.<\/div><div><br><\/div><div>\\u25a0Void Battles Schedule<br>You can play Void Battles anytime, regardless of the day of the week. However, the Void enemy that appears will differ based on the day. Check out the Void Battles Schedule notification for information about when each Void enemy is scheduled to appear.<\/div><div><a href=\\"unity:Information_19999\\">Void Battles Schedule<\/a><\/div><div><br><\/div><div>Limited-Time Endeavors<br>To celebrate the addition of new Void enemies, we&#39;re adding Limited Void Battle Endeavors! These are separated into Daily and Limited variations. You can complete the endeavors to obtain various rewards.<br>While the Limited Void Battle Endeavors are active, a wide variety of Void enemies will appear each day!<\/div><div><br><\/div><div>\\u25a0Limited Void Battle Endeavors Duration<br><span class=\\"local_date\\" data-local_date=\\"1553061600\\"><\/span> to <span class=\\"local_date\\" data-local_date=\\"1554011999\\"><\/span><br><br>Notes:<br>1. For more information about Void Battles, tap Events on the main page, then go to the Void Battles page and select Help.<br>2. For more information about Void enemies, tap Events on the main page, then go to the Void Battles page and check Details on the various quest pages.<br>3. You can check the Endeavors added for a limited time by tapping Endeavors on the main page, then selecting the Daily or Limited tabs.<br>4. Players must have completed up to Chapter 7 \/ 5-6 (Normal) of the main campaign in order to participate in Void Battles.<br><br>Thank you for playing Dragalia Lost.<\/div>","start_time":1553061600,"prev_article_id":"299","next_article_id":"302","image_path":"","update_time":1553064163}}}'