b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":673,"category_name":"Events","pr_category_id":"4","title_name":"Story Event Revival, Valentine\'s Confections, Is Now Live![Update]","message":"<div><span style=\\"color: rgb(44, 130, 201);\\"><strong>[Addendum <span class=\\"local_date\\" data-local_date=\\"1566460800\\"><\/span>]<\/strong><\/span><\/div><div>The original announcement stated that &quot;The flame attuned adventurer upgrade event, and Brunhilda&#39;s Trial double drops event do not apply to ravishing roses&quot;. It should have read &quot;The flame attuned adventurer upgrade event, Void Battles double drops event, and Brunhilda&#39;s Trial double drops event do not apply to ravishing roses&quot;.<\/div><div>Additionally, the original annoucement had two mentions that these events do not apply to ravishing roses, so we have removed one of them.<\/div><div><br><\/div><div>Thank you for playing Dragalia Lost.<\/div><div><br><\/div><hr><div>Greetings, all you love-struck adventurers!<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/d494cefb2b9b718b0cae7c6f3a5f6379.png\\"><\/div><div>A story event revival, Valentine&#39;s Confections, went live at <span class=\\"local_date\\" data-local_date=\\"1566453600\\"><\/span>. And so we&#39;d like to say...<\/div><div><br><\/div><div>Valentine&#39;s Day may be months away, but it&#39;s never too early to share your feelings!<\/div><div><br><\/div><div>Just what can you do on this lovey-dovey holiday? You can fight an array of fiends to collect items to create special memories with characters from the Halidom! But which will you choose? The especially strict priestess? The man with love to spare? Although, you never know who else may make an appearance!<\/div><div><br><\/div><div>Of course, how much story you experience is up to you... But we hope you make the most of this extra-sweet, gushy time of year!<\/div><div><br><\/div><div>\\u25a0Event Overview<\/div><div>In the Valentine&#39;s Confections story event revival you can use event items acquired by clearing quests from the main campaign and various events to unlock special Valentine&#39;s stories.<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/a3774a5d36a90b153e54d4d3a2018e7a.png\\"><\/div><div>There will also be summer versions of certain Valentine&#39;s stories, but the story content itself will be the same as the last time this event was held.<\/div><div><br><\/div><div>\\u25a0Acquiring Event Items<\/div><div>To be able to acquire event items by clearing quests from the main campaign and various events, you must clear Chapter 2 \/ 2-1 (Normal) and view the main page for the event at least once.<\/div><div>If you have not viewed the main page for the event before, you will not receive event items when clearing quests from the main campaign and various events.<\/div><div><br><\/div><div>\\u25a0Event Duration<\/div><div><span class=\\"local_date\\" data-local_date=\\"1566453600\\"><\/span> to <span class=\\"local_date\\" data-local_date=\\"1567231199\\"><\/span><\/div><div><br><\/div><div>\\u25a0Reward Availability Period<\/div><div><span class=\\"local_date\\" data-local_date=\\"1566453600\\"><\/span> to <span class=\\"local_date\\" data-local_date=\\"1567835999\\"><\/span><\/div><div><br><\/div><div>\\u25a0How to Play<\/div><div><strong>1. Collect ravishing roses!<\/strong><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/4a3ba3ee9601dd5de2285e0249448507.png\\"><\/div><div>You can obtain the event item, ravishing roses, from main campaign quests and various event quests during the event.<\/div><div><span style=\\"color: rgb(226, 80, 65);\\">Note: The flame attuned adventurer upgrade event, Void Battles double drops event, and Brunhilda&#39;s Trial double drops event do not apply to ravishing roses, and you will not receive ravishing roses from clearing The Mercurial Gauntlet quests.<\/span><\/div><div>The number of ravishing roses you can obtain differs between quests. The more stamina a quest expends, the more ravishing roses you will get.<\/div><div><br><\/div><div><strong>2. Unlock event stories!<\/strong><\/div><div><strong><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/306ff044f4564caaf2f1529fe30d3ef6.png\\"><\/strong><br><\/div><div>Use the ravishing roses you collected to unlock event stories.<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/2060a49424ab4cfc6c6634a55696fd4d.png\\"><\/div><div>There are event stories for multiple characters, which will be added over time during the event.<\/div><div>If you read each story to the end, then you will receive an event-specific wyrmprint.<\/div><div>Note: You will not receive event-specific wyrmprints for summer versions of Valentine&#39;s stories.<\/div><div><br><\/div><div><br><\/div><div><strong>3. Get event-specific Treasure Trade items!<\/strong><\/div><div>In the Treasure Trade section on the event page, you can trade the ravishing roses event items for various items, such as twinkling sand, champion&#39;s testaments, and the event-specific wyrmprint The Petal Queen.<\/div><div>Some items in the Treasure Trade are unlocked by clearing event stories.<\/div><div>Collect lots of ravishing roses during the event!<\/div><div><br><\/div><div><strong>4. Clear limited-time endeavors to earn rewards!<\/strong><\/div><div>You can earn rewards like wyrmite, eldwater, and epithets by clearing Valentine&#39;s Confections endeavors. To clear endeavors, find and defeat the special rare enemies that appear during the event: Valentine&#39;s Slime and Choco Golem.<\/div><div>The Valentine&#39;s Slime and Choco Golem enemies can appear randomly in any quest where rare enemies appear.<\/div><div><br><\/div><div>Notes:<\/div><div>1. Details for the Valentine&#39;s Confections event revival are available by tapping Help on the event page.<\/div><div>2. Players must have completed up to Chapter 2 \/ 2-1 (Normal) of the main campaign to participate.<\/div><div>3. Players must have completed up to Chapter 2 \/ 2-1 (Normal) of the main campaign in order to play co-op.<\/div><div>4. To check the additional limited-time daily endeavors, tap Endeavors on the home page, then check the Limited tab.<\/div><div>5. You will not be able to use the ravishing roses event item in future events.<\/div><div><br><\/div><div>Thank you for playing Dragalia Lost.<\/div>","start_time":1566453600,"prev_article_id":"677","next_article_id":"666","image_path":"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/d494cefb2b9b718b0cae7c6f3a5f6379.png","update_time":1569480528}}}'