b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":760,"category_name":"Updates","pr_category_id":"2","title_name":"Version Update [Update]","message":"<div>Update 1.12.0 is now available for download.<\/div><div><br><\/div><div>You may install it right now; otherwise, an automatic update will occur at approximately <span class=\\"local_date\\" data-local_date=\\"1569564000\\"><\/span>.<\/div><div><br>We are reducing the size of voice data in version 1.12.0, so a voice data download will occur on the title screen the first time you open the game after updating. This makes it possible to reduce the data size. Thank you for understanding.<\/div><div><br><\/div><div>Note: When you update to version 1.12.0 and play co-op, you will no longer be matched with players using earlier versions of the game. Rooms created by players playing earlier versions will not display in the Room List, and you will not be able to join them using Find a Room or Join Nearby Players. Additionally, if you input an ID using Enter an ID, the room will display, but you will not be able to enter it. Lastly, rooms created by alliance members playing earlier versions will be visible in the alliance chat, but you will not be able to join the room. The &quot;All set, thanks!&quot; message will display in such cases.<\/div><div><br><\/div><div>To celebrate the update, we&rsquo;ll be sending all players a Tenfold Summon Voucher after the automatic update.<\/div><div><br><\/div><div>This notice will be modified after they&rsquo;ve been distributed.<\/div><div><br><\/div><div>Note: The Tenfold Summon Voucher will not be distributed until after the automatic update, even if you complete the update to version 1.12.0 early.<\/div><div><br><\/div><div><br><\/div><div><strong>\\u25a0Update Details<\/strong><\/div><div><br><\/div><div>\\u30fb<u>Raid Boosts<\/u><\/div><div><br><\/div><div>Future raid events will feature a new factor known as raid boosts.<\/div><div>Raid boosts bolster your team for the corresponding raid event with effects such as increased damage dealt to enemies or boosted adventurer HP.<\/div><div>You can get these raid boost effects when you clear boss battles and raid battles during raid events.<\/div><div>Use boosts to power up your party and challenge boss battles!<\/div><div><br><\/div><div>We&#39;re also adding new features in the next raid event.<\/div><div>Some of these features include a new Omega difficulty, the addition of bronze and silver emblems to the clear reward and Grand Bounty for Nightmare difficulty, the use of special items to play the Extra Raid Battle whenever you want, and a feature that will allow you to trade for any of the elementally-attuned 5\\u2605core weapons by clearing the extra battle.<\/div><div><br><\/div><div>For more information, see the notification for the next raid event.<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/8a4a9d661cfd849ee257a7e90f4b5a1f.png\\"><\/div><div><br><\/div><div><br><\/div><div>\\u30fb<u>New Gameplay Elements in Advanced Dragon Trials<\/u><\/div><div><br><\/div><div>\\u25bcNew difficulty levels!<\/div><div>The existing difficulty level for Advanced Dragon Trials will be considered Standard difficulty, and we will be adding Expert and Master difficulties.<\/div><div>You will be able to use the materials obtained in the new difficulty levels to craft new weapons.<br>We are planning to add the new difficulties in October, and we will share more information in a separate notification.<\/div><div><br><\/div><div>\\u25bcTime attack rankings<\/div><div>We will add a feature to the planned Advanced Dragon Trial Expert difficulty where players can compete for clear times over a set period of time.<\/div><div>We will share more information about when the feature will be available and how it will work in a future notification.<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/cc5b4f567c4a7b0847c86971b6920f5f.png\\"><\/div><div><br><\/div><div><br><\/div><div>\\u30fb<u>Changes to the Title Screen<\/u><\/div><div><br><\/div><div>The title screen illustration will change as of version 1.12.0.<\/div><div>The illustration for the new title screen will reflect the progress of the main campaign.<br>From <span class=\\"local_date\\" data-local_date=\\"1569564000\\"><\/span> (after the maintenance is complete) to <span class=\\"local_date\\" data-local_date=\\"1571378399\\"><\/span>, the illustration will be a special first anniversary image.<\/div><div><br><\/div><div>\\u30fb<u>First Anniversary Stickers<\/u><\/div><div><br><\/div><div>The following stickers will be added <span class=\\"local_date\\" data-local_date=\\"1569564000\\"><\/span> (after the maintenance is complete).<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/5167562c9bd73b6a570e28ce0e93370a.png\\"><\/div><div><br><\/div><div><br><\/div><div>\\u30fb<u>Special First Anniversary Voice Lines<\/u><\/div><div><br><\/div><div>Special first-anniversary voice lines will be available from <span class=\\"local_date\\" data-local_date=\\"1569564000\\"><\/span> (after the maintenance is complete) to <span class=\\"local_date\\" data-local_date=\\"1571378399\\"><\/span>. To listen to them, tap or press and hold an adventurer on the Adventurers screen or the Edit Team screen, then tap the magnifying glass icon in the bottom right corner of the screen. You will be able to listen to the voice lines on the screen that opens.<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/f088e64027ca08b8ab2dd273590c4485.png\\"><\/div><div><br><\/div><div><br><\/div><div>\\u30fb<u>New Co-Abilities<\/u><\/div><div><br><\/div><div>New co-ability effects will be added.<\/div><div>Gala Prince has the first of these new co-abilities. His Shapeshifting Boost co-ability will boost shapeshifting time and damage dealt while shapeshifting for the entire team.<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/fdabee3c23538433ec05ffe9e6bd37af.png\\"><\/div><div>We plan to continue adding new co-abilities over time.<\/div><div><br><\/div><div><br><\/div><div>\\u30fb<u>Changes to the Item Lineup and Price for Item Summons<\/u><\/div><div><br><\/div><div>We will change the lineup and price for item summons starting <span class=\\"local_date\\" data-local_date=\\"1569564000\\"><\/span> (after the maintenance is complete).<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/0575ec44c6a7cacac6d588694f9d4143.png\\"><\/div><div><br><\/div><div>\\u25bcLineup changes<\/div><div><br><\/div><div>Removed items:<br>\\u30fbSilver crystals<br>\\u30fbRipe dragonfruit<br>\\u30fbSilver whetstone<br>\\u30fbBlessed water<br><br>Added items:<br>\\u30fbSword tablets<br>\\u30fbBlade tablets<br>\\u30fbDagger tablets<br>\\u30fbAxe tablets<br>\\u30fbLance tablets<br>\\u30fbBow tablets<br>\\u30fbWand tablets<br>\\u30fbStaff tablets<br>\\u30fbHustle hammers<\/div><div><br><\/div><div>\\u25bcPrice changes (in wyrmite)<\/div><div><br><\/div><table style=\\"width: 33%; margin-right: calc(67% - 0px);\\"><tbody><tr><td style=\\"width: 23.1481%;\\">Number of times<br><\/td><td style=\\"width: 37.5%;\\">Old price<br><\/td><td style=\\"width: 39.3519%;\\">New price<br><\/td><\/tr><tr><td style=\\"width: 23.1481%;\\">1<\/td><td style=\\"width: 37.5%; background-color: rgb(255, 255, 255);\\">0<\/td><td style=\\"width: 39.3519%; background-color: rgb(255, 255, 255);\\">0<\/td><\/tr><tr><td style=\\"width: 23.1481%;\\">2<\/td><td style=\\"width: 37.5%; background-color: rgb(255, 255, 255);\\">50<\/td><td style=\\"width: 39.3519%; background-color: rgb(255, 255, 255);\\">30<\/td><\/tr><tr><td style=\\"width: 23.1481%;\\">3<\/td><td style=\\"width: 37.5%; background-color: rgb(255, 255, 255);\\">100<\/td><td style=\\"width: 39.3519%; background-color: rgb(255, 255, 255);\\">50<\/td><\/tr><tr><td style=\\"width: 23.1481%;\\">4<\/td><td style=\\"width: 37.5%; background-color: rgb(255, 255, 255);\\">200<\/td><td style=\\"width: 39.3519%; background-color: rgb(255, 255, 255);\\">100<\/td><\/tr><tr><td style=\\"width: 23.1481%;\\">5<\/td><td style=\\"width: 37.5%; background-color: rgb(255, 255, 255);\\">400<\/td><td style=\\"width: 39.3519%; background-color: rgb(255, 255, 255);\\">200<\/td><\/tr><tr><td style=\\"width: 23.1481%;\\">6<\/td><td style=\\"width: 37.5%; background-color: rgb(255, 255, 255);\\">800<\/td><td style=\\"width: 39.3519%; background-color: rgb(255, 255, 255);\\">300<\/td><\/tr><\/tbody><\/table><div><br><\/div><div>Note: Due to an event, you will be able to perform six item summons for free each day from <span class=\\"local_date\\" data-local_date=\\"1569564000\\"><\/span> (after the maintenance is complete) to <span class=\\"local_date\\" data-local_date=\\"1571378399\\"><\/span>. The new prices will be applied after this event ends, and you will still be able to perform one item summon for free each day.<\/div><div><br><\/div><div>\\u30fb<u>Recover Stamina at the Halidom<\/u><\/div><div><br><\/div><div>You will be able to produce honey tea, which will allow you to recover stamina, at the Halidom.<\/div><div>One honey tea is produced every 30 minutes, and you will reach capacity in three days.<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/f73d1500fa9721558115d3bcc6dc8714.png\\"><\/div><div><br><\/div><div><br><\/div><div>\\u30fb<u>New Hustle Hammer Item to Complete Facility Construction Immediately<\/u><\/div><div><br><\/div><div>We will add a new hustle hammer item, which will allow you to complete facility construction immediately.<\/div><div>You can get hustle hammers from item summons and as rewards for completing endeavors.<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/1a68a9d51eada29ac0e5bfd159593cc6.png\\"><\/div><div><br><\/div><div><br><\/div><div>\\u30fb<u>New &quot;Go&quot; Button for Endeavors<\/u><\/div><div><br><\/div><div>You will be able to use the Go button for endeavors to jump directly to the corresponding quest where you can complete the endeavor.<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/a209b8b4f9b4bcd74c2c0e95e60024af.png\\"><\/div><div><br><\/div><div><br><\/div><div>\\u30fb<u>Feature Addition Information<\/u><\/div><div><br><\/div><div>The home page will display which features are added by progressing through the main campaign.<\/div><div>It will also show your daily endeavor progress.<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/ec39094809a947b61c290bac83c30cd0.png\\"><\/div><div><br><\/div><div><br><\/div><div>\\u30fb<u>Feature for Changing the Background Music on the Home Page<\/u><\/div><div><br><\/div><div>You will be able to change the home page&#39;s background music from the System tab under Options.<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/727c630c3fad5b955d3373c0ba324b34.png\\"><\/div><div><br><\/div><div><br><\/div><div>\\u30fb<u>Feature for Skipping the Boss Intro Sequence<\/u><\/div><div><br><\/div><div>We are adding a feature to raid battles that will allow you to skip the boss intro animation. If the player who created the co-op room selects the &quot;Skip intro sequence&quot; box on the room screen, then the boss&#39;s animation will be skipped when starting the quest.<br>Note: You will not be able to skip the intro sequence for quests that are not raid battles.<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/09086f05c73e7241e15ca867951ab531.png\\"><\/div><div><br><\/div><div>\\u30fb<u>Attunement Confirmation Before Starting Quests<\/u><\/div><div><br><\/div><div>When playing quests in the main campaign in solo play, a confirmation screen will now display when your team leader&#39;s attunement is not effective for the quest you are about to start.<\/div><div>You can disable this confirmation screen via the check-box on the confirmation screen or under Options.<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/d13cbace7244cbc51fd50bb83feb2811.png\\"><\/div><div><br><\/div><div><br><\/div><div>\\u30fb<u>Resetting the Social Reward in Co-op<\/u><\/div><div><br><\/div><div>We will reset the number of times you can receive the social reward, which can be obtained when you play co-op with a player for the first time, at <span class=\\"local_date\\" data-local_date=\\"1569823200\\"><\/span>.<br>After clearing a quest, you can get 50 wyrmite per player (for up to 50 players).<\/div><div><br><\/div><div><br><\/div><div><strong>\\u25a0Balance Adjustments<\/strong><\/div><div><br><\/div><div>\\u30fbThe effects of the Dragon Time +X% ability will be changed to no longer affect the amount of dragon time that is lost when damage is taken.<br>\\u30fbAI adventurers would not use skills while in the middle of combo attacks, even if the skill gauge was full. They will now use skills even in the middle of combo attacks.<br><br>The following adjustments will be applied at <span class=\\"local_date\\" data-local_date=\\"1569564000\\"><\/span> (after the maintenance is complete).<br>\\u30fbThe maximum augment bonus for adventurers and wyrmprints will be increased to +100.<br>\\u30fbThe maximum number of skip tickets you can hold will be increased to 200.<br>\\u30fbThe amount of stamina recovered when using wyrmite and diamantium will be changed from 100 stamina for 40 to 120 stamina for 30. Additionally, the diamantium and wyrmite cost previously increased based on the number of times stamina was recovered, but it will no longer do so.<br>\\u30fbThe number of getherwings recovered when using wyrmite and diamantium will be changed from 12 getherwings for 50 to 12 getherwings for 30.<\/div><div><br><\/div><div><br><\/div><div><strong>\\u25a0Other Changes<\/strong><\/div><div><br><\/div><div>\\u30fbIf you select &quot;Exclude voices&quot; when downloading data during a data update, the voice setting will automatically be set to mute. With this adjustment, if you select &quot;Exclude voices&quot; during a data update, the &quot;Exclude voices&quot; data download confirmation will only display on the title screen when there is a future data update.<\/div><div>Note: You can change your voice settings via the Voices option on the Sound tab under Options.<\/div><div><br><\/div><div>The following changes will be applied at <span class=\\"local_date\\" data-local_date=\\"1569564000\\"><\/span> (after the maintenance is complete).<br>\\u30fbWe will change the English skill name and voice for Summer Estelle&#39;s skill.<\/div><div><span style=\\"color: rgb(41, 105, 176);\\"><strong>[Update <span class=\\"local_date\\" data-local_date=\\"1570183200\\"><\/span>]<\/strong><\/span><br>There was a delay in the implementation of the skill name in English. It will be reflected in the data update which will be available at <span class=\\"local_date\\" data-local_date=\\"1571032800\\"><\/span>.<br>Note: The skill&#39;s voice has already been updated.<br>\\u30fbWe will adjust the text in the description for Fjorm&#39;s Ice Mirror skill.<br>Note: The effects of the skill will not change.<br>\\u30fbWe will change some of Nina&#39;s lines on the Shop screen.<br>\\u30fbWe will adjust the shading in the Dragon&#39;s Roost so the area near the dragon&#39;s feet appears brighter.<br>\\u30fbWe will adjust some 3D models for the following dragons.<br>\\u3000Zodiark<br>\\u3000Jeanne d&#39;Arc<br>\\u30fbWe will adjust the head size of certain adventurers&#39; 3D models.<br>\\u30fbAlong with the 3D model adjustments described above, we will also adjust the size of adventurers on the home page and the team screen.<br>\\u30fbWe will adjust the phonetic reading of Ieyasu&#39;s epithet.<br>Note: This change only affects Japanese and Simplified Chinese, which have the phonetic readings.<br>\\u30fbWe will change the icons for the following buffs.<br>\\u3000Skill Shift<br>\\u3000Addis: Bamboo Cutter Buffed<br>\\u3000Ezelith: Inferno Mode<br>\\u3000Yue: Wild Child<br>\\u3000Beautician Zardin: Stunning Beauty<br>\\u3000Ieyasu: Blade Formation<br>\\u30fbWe will also adjust the UI on some screens.<br><br>The following change will be applied in a data update around <span class=\\"local_date\\" data-local_date=\\"1571378400\\"><\/span>.<br>\\u30fbMaritimus will now be voiced.<\/div><div><br><\/div><div><strong>\\u25a0Issues Fixed<\/strong><\/div><div><br><\/div><div>The following issues have been fixed in this version:<\/div><div><br>\\u30fbThe notation that displays above Sarisse&#39;s head after using her Brilliant Bolt skill displayed a value above the maximum.<br>\\u30fbWhen Treasure Trade was tapped from Item Details for certain items, options with expired trade periods displayed and attempting to trade for them resulted in an error.<br>\\u30fbIn adventurer details, wyrmprint abilities that increase strength displayed as exceeding the maximum value.<br>\\u30fbSometimes certain skills did not hit enemies when the game was running slowly on certain devices.<br>\\u30fbWhen an adventurer landed a hit with an attack skill after the effects of Striker&#39;s Skill +X% activated multiple times, the icon and effect disappeared after the skill ended.<br>\\u30fbWhen Valentine&#39;s Hildegarde hit an enemy with a force strike while the Sisters&#39; Day Out wyrmprint was equipped, the strength decrease effect from her ability was applied to Hildegarde herself, but only the first time during the quest.<br>\\u30fbSometimes an AI adventurer&#39;s Pop-Star Siren did not use her skill a second time.<br>\\u30fbIn The Mercurial Gauntlet, AI adventurers&#39; dragons sometimes did not use their skill under certain circumstances.<br>\\u30fbIn Violet Ghost Strike, when starting the battle with Auto enabled, the adventurer being controlled would move away from the enemy.<br>\\u30fbWhen two instances of Skill Shift were activated with Gala Cleo, and either one was reset, the Skill Shift buff icon disappeared, even though one effect remained.<br><br>The following fixes will be applied at <span class=\\"local_date\\" data-local_date=\\"1569564000\\"><\/span> (after the maintenance is complete).<br><br>\\u30fbThe eyes of certain dragons would flicker when their 3D models were displayed on the Dragon Details screen.<br>\\u30fbThe clothing would interfere with adventurer 3D models in some places in 3D story scenes.<br>\\u30fbIn the Dragon&#39;s Roost, Vayu&#39;s left arm interfered with the wings on his back.<\/div><div><br><\/div><div><br><\/div><div>Notes:<\/div><div><br><\/div><div>1. It may take time for the store to reflect the updated information. Players may not be able to perform updates due to their device&rsquo;s data cache being full. If you are unable to perform the update, restart your device, and then try downloading it from the store.<\/div><div>2. Any adventurers and game screenshots shown are still in development.<\/div><div><br><\/div><div><span style=\\"color: rgb(44, 130, 201);\\"><strong>[Addendum <span class=\\"local_date\\" data-local_date=\\"1569564000\\"><\/span>]<\/strong><br><\/span>As a token of our appreciation, the following item has been sent to players who started playing before <span class=\\"local_date\\" data-local_date=\\"1569562200\\"><\/span>.<br><br>\\u30fbTenfold Summon Voucher x1<br><br>This gift can be claimed from your goodie box for up to seven days after logging in. If the gift isn&rsquo;t retrieved within seven days, it will be lost.<br><br>Thank you for playing Dragalia Lost.<\/div>","start_time":1569467400,"prev_article_id":"680","next_article_id":"767","image_path":"","update_time":1574302302}}}'