b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":852,"category_name":"Events","pr_category_id":"4","title_name":"Story Event, Stirring Shadows, Coming Soon!","message":"<div>The story event Stirring Shadows will start <span class=\\"local_date\\" data-local_date=\\"1572501600\\"><\/span>.<\/div><div><br><\/div><div>In the Stirring Shadows story event you can use event items acquired by clearing main-campaign quests and various events to unlock special stories.&nbsp;<\/div><div><br><\/div><div>The Stirring Shadows story includes content that expands on the story told in The Accursed Archives facility event.<\/div><div><span style=\\"color: rgb(226, 80, 65);\\">To get the most out of Stirring Shadows, we strongly encourage you to play The Accursed Archives facility event, which will be active at the same time, first.<\/span><\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/0b5ed54ea39c7dcfb17733024ae3d4ab.png\\"><\/div><div>When a little girl mysteriously vanishes, the search leads her would-be saviors to The Immortal Village, a place where eternity ensnares all who reside there. Encounters with the strange dragon and priestess who rule over the village cast the pursuit deeper into chaos and confusion. In a village imprisoned by worship and obsession, who really holds the truth?<\/div><div><br><\/div><div>We hope you&#39;re looking forward to the Stirring Shadows story event!<\/div><div><br><\/div><div>Notes:<\/div><div>1. Players must have completed up to Chapter 2 \/ 2-1 (Normal) of the main campaign to participate.<\/div><div>2. Players must have completed up to Chapter 2 \/ 2-1 (Normal) of the main campaign in order to play co-op.<\/div><div><br><\/div><div>Thank you for playing Dragalia Lost.<\/div>","start_time":1572415200,"prev_article_id":"840","next_article_id":"841","image_path":"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/0b5ed54ea39c7dcfb17733024ae3d4ab.png","update_time":1572318433}}}'