b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":886,"category_name":"Updates","pr_category_id":"2","title_name":"Version Update [Update]","message":"<div>Update 1.14.0 will be available for download around <span class=\\"local_date\\" data-local_date=\\"1574918100\\"><\/span>.<\/div><div><br><\/div><div>You may install it when it becomes available; otherwise, an automatic update will occur at approximately <span class=\\"local_date\\" data-local_date=\\"1574996400\\"><\/span>.<\/div><div><br><\/div><div>When you update to version 1.14.0 and play co-op, you will no longer be matched with players using earlier versions of the game. Rooms created by players playing earlier versions will not display in the Room List, and you will not be able to join them using Find a Room or Join Nearby Players. Additionally, if you input an ID using Enter an ID, the room will display, but you will not be able to enter it. Lastly, rooms created by alliance members playing earlier versions will be visible in the alliance chat, but you will not be able to join the room. The &quot;All set, thanks!&quot; message will display in such cases.<\/div><div><br><\/div><div>To celebrate the update, we&#39;ll be sending all players a Tenfold Summon Voucher after the automatic update.<\/div><div><br><\/div><div>This notice will be modified after they&#39;ve been distributed.<\/div><div><br><\/div><div>Note: The Tenfold Summon Voucher will not be distributed until after the automatic update, even if you complete the update to version 1.14.0 early.<\/div><div><br><\/div><div><strong>\\u25a0Update Details<\/strong><br><u>\\u30fbNew Very Hard difficulty for the main campaign<\/u><br>We are planning to add a new difficulty, Very Hard, to the main campaign around mid-December 2019.<br>You will be able to challenge Very Hard difficulty after clearing Chapter 10 (Normal) of the main campaign, then clearing the various chapters on Hard difficulty.<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/cb35a2e2037d4b93418331854c4f92e1.png\\"><\/div><div><br><\/div><div><u>\\u30fbNew weapon skin feature<br><\/u>We will introduce a new weapon skin feature, which will allow you to change the appearance of your equipped weapon to that of another weapon you have obtained before.<br>Changing your weapon&#39;s appearance using the weapon skin feature will not affect the weapon&#39;s stats, skills, or abilities.<br>Additionally, you will only be able to change your weapon to look like another of the same weapon type.<br>Example: You can change a sword to look like another sword, but you cannot change a sword to look like a dagger.<br>Lastly, we plan to make it possible to disable the weapon skin feature on the co-op room screen from the Game tab under Options.<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/8e9dcc8eeb5a1544a71cb19ac789f98a.png\\"><\/div><div><br><\/div><div><u>\\u30fbNew auto-repeat feature<\/u><\/div><div>We are adding an auto-repeat feature, which will allow you to automatically replay certain quests.<u><br><\/u>To be able to auto-repeat a quest, you must first complete all three quest endeavors.<br>You can set it to repeat until all stamina is consumed or to repeat a pre-set number of times, and can toggle the auto-repeat feature on and off during the quest.<br>For more information, see the Quests section under Help after the update.<br>Note: The auto-repeat feature unlocks after clearing Chapter 1 \/ 4-2 (Normal) of the main campaign.<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/c0df52d041c254e569b40046a1e03df9.png\\"><\/div><div><br><\/div><div><u>\\u30fbHome page UI changes<\/u><\/div><div>In version 1.14.0, we will change the position of some buttons on the Home page, such as the Quests and More buttons.<br>You will also be able to hide the UI on the Home page so that you can enjoy watching the adventurers and backgrounds.<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/a5333b380234b2ebb9fce14c6925b922.png\\"><\/div><div><br><\/div><div><u>\\u30fbDisplay effective abilities on the co-op room screen for Void Battles<\/u><br>The weapon abilities that are effective against the boss enemies will now display on the co-op room screen for Void battles.<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/1e13c100498f126fa7a0d29b92f13edf.png\\"><\/div><div><br><\/div><div><strong>\\u25a0Other Changes<\/strong><br>\\u30fbStarting at 10 PM PT on November 28, there will always be one or more Void Battles quests where drop rewards will be doubled.<br>\\u30fbWe will increase the effects of skills like Victor and Julietta&#39;s that apply immunity to knockback.<br>\\u30fbWe will change how some products in the shop display to clarify which items are included and which are bonus items.<br>\\u30fbWe will add a feature that allows you to check the shapeshifted appearance for adventurers like Gala Mym and Lathna, who always shapeshift into a certain dragon, regardless of which dragon they have equipped, on the adventurer details screen.<br>\\u30fbIf you have already agreed to the Terms of Service and the Terms of Service are updated, a screen notifying you that the Terms of Service have been updated will now display before the message where you agree on the title screen.<br>\\u30fbThe wait time when you choose to continue playing after a co-op quest has ended will be reduced from 40 seconds to 25 seconds.<br>\\u30fbWe will change the voice that plays when the Vampire&#39;s Lantern weapon skill Vampire&#39;s Treat is used.<br>\\u30fbWe have implemented a new voice for the Prince.<br>\\u30fbWe will change the icons for the following skills.<br>\\u25bcAffected Skills<br>The adventurer Heinwald&#39;s Call of Chaos<br>The adventurer Halloween Edward&#39;s Nightmare Waltz<br>The adventurer Halloween Althemia&#39;s Bitter Trick<br>The adventurer Yue&#39;s Wild Instinct<br>The adventurer Xuan Zang&#39;s Heaven&#39;s Binding<br>The adventurer Alfonse&#39;s Sol<br>The adventurer Veronica&#39;s Nosferatu<br>The dragon Garuda&#39;s Tempestuous Kiss<br><br><strong>\\u25a0Issues Fixed<br><\/strong>The following issues have been fixed in this version:<br>\\u30fbThe exclamation mark icon displayed on the alliance button on the Home page did not disappear when the alliance you belonged to was disbanded or you were dismissed from the alliance while your check-in reward was available.<br>\\u30fbWhen playing High Midgardsormr&#39;s Trial in co-op and one of the tornadoes produced by High Midgardsormr&#39;s attacks hit an adventurer, the tornado disappeared, but only on the device of the player who got hit.<br>\\u30fbWhile under the effects of a buff restoring a portion of an adventurer&#39;s inflicted damage as HP, adventurers who apply afflictions to enemies via normal attacks also suffered those afflictions themselves.<\/div><div><br><\/div><div>Notes:<br>1. It may take time for the store to reflect the updated information. Players may not be able to perform updates due to their device&#39;s data cache being full. If you are unable to perform the update, restart your device, and then try downloading it from the store.<br>2. Any adventurers and game screenshots shown are still in development.<\/div><div><br><\/div><div><span style=\\"color: rgb(44, 130, 201);\\">Addendum <span class=\\"local_date\\" data-local_date=\\"1574996400\\"><\/span><\/span><br>As a token of our appreciation, the following item has been sent to players who started playing before <span class=\\"local_date\\" data-local_date=\\"1574996400\\"><\/span>.<br><br>\\u30fbTenfold Summon Voucher x1<br><br>This gift can be claimed from your goodie box for up to seven days after logging in. If the gift isn&#39;t retrieved within seven days, it will be lost.<br><br>Thank you for playing Dragalia Lost.<\/div>","start_time":1574316000,"prev_article_id":"826","next_article_id":"947","image_path":"","update_time":1574996411}}}'