b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":899,"category_name":"News","pr_category_id":"1","title_name":"This Month in Dragalia Lost","message":"<div>Hello! Yuji Okada here, director of Dragalia Lost.<\/div><div><br><\/div><div>Are you enjoying the Mega Man event? If you didn&#39;t know, this event was based on the world of Mega Man 2. There are wyrmprints, weapons, and stickers you&#39;ll only be able to earn during this event, so I hope you&#39;re working on collecting them!<\/div><div><br><\/div><div>Even the background music was arranged specifically for this event and is only available for a limited time, so please make sure you&#39;re listening when you play!<\/div><div><br><\/div><div>We&#39;ve also implemented some gameplay elements from the bosses in Mega Man 2 into the Greatwyrm bosses for this event. And as a heads up, we&#39;ll also be releasing Superhero difficulty battles for these bosses over time.<\/div><div><br><\/div><div>\\u25a0December Events<\/div><div>\\u30fbIn the second week of December, we&#39;ll be reviving the Dragonyule event.<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/3ba16ea4b47a599cec3ee9e31dfde6fe.png\\"><\/div><div><br><\/div><div>The challenge battle will have a new difficulty level, and we&#39;ll be increasing the maximum facility level. There will also be new Dragonyule adventurers and dragons available via summon showcase. We&#39;ll share more information in future notifications, so keep your eyes peeled for those.<\/div><div><br><\/div><div>\\u30fbWe&#39;ll have four Astral Raids in December<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/0ccdde0081d5fafcaa977576c80c96e8.png\\"><\/div><div><br><\/div><div>Astral Raids are on right now, but some bosses who have never appeared in Astral Raids before will be making their first appearance.<\/div><div>Barbary, Thanatos, and Chronos, who appeared in the first anniversary raid event, will all make their Astral Raids debut. The Astral Raids version of Chronos will be his dragon form, not Chronos Nyx.<\/div><div><br><\/div><div>Starting with the current Astral Raids, we&#39;re also adjusting the amount of drop rewards and the number of trades you can make using astral shards.<\/div><div><br><\/div><div>I hope everyone challenges these battles!<\/div><div><br><\/div><div>\\u30fbThe Mercurial Gauntlet (light): Lv. 51-55 will unlock on 12\/14(PT)<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/115cecefb42e37756f6deda273578a6f.png\\"><\/div><div><br><\/div><div>\\u30fbChapter 11 of the main campaign will be added 12\/15(PT)<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/9cd35189bccd7db4fd5a417430ea0d02.png\\"><\/div><div><br><\/div><div>In chapter 10, the prince came into conflict with his siblings, and the first to stand against him will be... This chapter of the main campaign centers on Luca and some combat androids that oppose the prince and friends!<\/div><div><br><\/div><div>\\u30fbVery Hard difficulty will be added to the main campaign on 12\/15(PT)<\/div><div>Very Hard difficulty, which will be even harder than Hard difficulty, will be added. It will unlock when you clear chapter 10 of the main campaign as well as the Hard difficulty for a chapter. By clearing it, you&#39;ll be able to get augments and materials that will be required in the future for unbinding the sixth mana circle tier.<\/div><div><br><\/div><div>\\u30fbStarting 12\/15(PT) in Void Battles, the Astral&#39;s Bane ability, which is effective against bosses in Astral Raids, will be added to the weapons you can craft by defeating the Manticore Void enemies for each element.<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/c6cbf0f842bd91bc1943798416644fa8.png\\"><\/div><div><br><\/div><div>We&#39;re also adjusting the amount of materials that drop, making these weapons even easier to craft. Astral Raids don&#39;t happen very often, but you can get a lot of upgrade items each time. That&#39;s why, to make it a little easier to challenge higher difficulties, we&#39;ve increased the number of ways to approach these quests.<\/div><div><br><\/div><div>\\u30fbWe&#39;ll share more about other events around the end of this year and the start of the new year via notifications.<\/div><div><br><\/div><div>\\u25a0Regarding Future Updates<br>We&#39;re planning one final version update for 2019.<br>Here is some information about the plans for that update.<br><br>\\u30fbNew high-difficulty quests, The Agito Uprising<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/e5e84f122c8547511e964715b5c70b74.png\\"><\/div><div><br><\/div><div>The new boss quests announced in the September Dragalia Digest will be called The Agito Uprising. Unlike bosses up to this point, which have been predominantly dragons, these bosses take on an almost human form.&nbsp;<\/div><div>They&#39;ll unlock after the update at the end of the year. We&#39;re also creating new background music for the battles, so I hope you&#39;re looking forward to it!<br><br>\\u30fbWith the next update, certain adventurers will be able to unbind the sixth mana circle tier<br>A new material is required to unbind nodes on the sixth tier. This new material can be obtained from the new Very Hard difficulty of the main campaign.<br><br>We&#39;ll share more information about which adventurers will be able to access the sixth tier in a separate notification, but we also plan to adjust 3\\u2605 adventurers in the summoning pool.<br><br>\\u30fbWe will add a new flame-attuned Void enemy, Volcanic Chimera<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/0e68823043b5a184de7cec056dc12f13.png\\"><\/div><div><br><\/div><div>The Volcanic Chimera is an extremely tough boss, but it has few gameplay elements designed for co-op, like those you might find in Advanced Dragon Trials, but you can work to beat it in solo too!<br><br>When you defeat this boss, you&#39;ll get crafting materials that will allow you to craft weapons that are more powerful than the core weapons and other Void weapons up to this point. The Advanced Dragon Trials are a challenge to complete when not playing co-op, but we hope this new enemy will become a way for players to get powerful weapons by playing solo before moving on and challenging the Advanced Dragon Trials in co-op.<br><br>We&#39;re starting with flame, but we will unlock battles for the other elements over time.<br><br>\\u30fbWe&#39;re adding Expert difficulty to certain Void enemies and changing the existing difficulty to Standard.<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/6f33eb18c74c86fcf9c9ef2b2c5fe6eb.png\\"><\/div><div><br><\/div><div>Expert difficulty battles will drop the material required for unbinding the sixth mana circle tier, and drops like the heart materials required for crafting will drop more frequently. The difficulty level is a little higher than Standard, but you can get a lot more rewards from these bosses.<br><br>\\u30fbRefreshing the UI for the shop<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/26d8f819ca798bfb11409639650b3e23.png\\"><\/div><div><br>We&#39;ll be adjusting the layout of the shop.<\/div><div><br><\/div><div>\\u25a0Regarding Future Game Balance<br>\\u30fbWe&#39;ve been making some big balance adjustments lately, and we hope to continue making adjustments as more content is added in the future, taking player feedback and play data into account.<br><br>\\u30fbOur current goal is to increase the number of adventurers who can challenge the game&#39;s high-difficulty content.<br>Because the clear rate for high-difficulty content using certain adventurers is extremely high, we are considering making adjustments so that a wider variety of adventurers can complete that content.<br><br>We&#39;ll gradually make adjustments to adventurers by unlocking their 6th mana circle tier, or by adjusting the adventurer&#39;s capabilities.<\/div><div><br><\/div><div>\\u25a0In Conclusion<br>We&#39;re giving the following items to all players, whether you&#39;ve played for a long time or just started with the Mega Man event.<br><br>\\u30fb5\\u2605 Summon Voucher (Dragon) x1<br>\\u30fbHustle Hammers x10<br>\\u30fbVoid Seeds x30<br><br>The next installment of This Month in Dragalia Lost will be posted around 1\/1\/2020(JST). It&#39;ll be the first one for the new year, and I&#39;ll have more to share about the future of Dragalia Lost. I hope you&#39;re looking forward to it!<br><br>Thanks for reading, and thank you for playing Dragalia Lost!<br><br>Yuji Okada<br>Director, Dragalia Lost<br><br>Notes:<br>\\u30fbThe gift can be claimed from your goodie box for up to seven days after logging in. If the gift isn&#39;t retrieved within seven days, it will be lost.<br>\\u30fbSummon showcase, event, and update content may change without notice.<br>\\u30fbAny adventurers and game screenshots shown are still in development.<\/div>","start_time":1575180000,"prev_article_id":"10023","next_article_id":"906","image_path":"","update_time":1575020532}}}'