b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":947,"category_name":"Updates","pr_category_id":"2","title_name":"Version Update[Update]","message":"<div><span style=\\"color: rgb(41, 105, 176);\\"><strong>[Addendum <span class=\\"local_date\\" data-local_date=\\"1577242800\\"><\/span>]<\/strong><\/span><br>We have added some notes regarding the Shop UI changes.<\/div><div><br><\/div><hr><div>Update 1.15.1 will be available for download around <span class=\\"local_date\\" data-local_date=\\"1577242800\\"><\/span>.<\/div><div><br><\/div><div>You may install it when it becomes available; otherwise, an automatic update will occur at approximately <span class=\\"local_date\\" data-local_date=\\"1577329200\\"><\/span>.<\/div><div><br><\/div><div>When you update to version 1.15.1 and play co-op, you will no longer be matched with players using earlier versions of the game. Rooms created by players playing earlier versions will not display in the Room List, and you will not be able to join them using Find a Room or Join Nearby Players. Additionally, if you input an ID using Enter an ID, the room will display, but you will not be able to enter it. Lastly, rooms created by alliance members playing earlier versions will be visible in the alliance chat, but you will not be able to join the room. The &quot;All set, thanks!&quot; message will display in such cases.<\/div><div><br><\/div><div>To celebrate the update, we&#39;ll be sending all players a Tenfold Summon Voucher after the automatic update.<\/div><div><br><\/div><div>This notice will be modified after they&#39;ve been distributed.<\/div><div><br><\/div><div>Note: The Tenfold Summon Voucher will not be distributed until after the automatic update, even if you complete the update to version 1.15.1 early.<\/div><div><br><\/div><div><strong>\\u25a0Update Details<\/strong><br><u>\\u30fbIt will be possible to change teams before selecting a co-op room<br><\/u>You will be able to change your team before entering a room, such as on the quest&#39;s co-op screen or the room list.<br><br><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/dfd524353ce6cc5b7cc8d4c22b958101.png\\"><\/div><div><br><\/div><div><u>\\u30fbAdded Expert difficulty to Void Battles<\/u><br>Expert difficulty will be added to certain Void Battles quests at <span class=\\"local_date\\" data-local_date=\\"1577340000\\"><\/span>.<br>For quests that have Expert difficulty added, the existing difficulty level will be considered Standard difficulty.<br><br><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/e56a81436f2b1a54d961d642796b5889.png\\"><\/div><div><br><\/div><div><u>\\u30fbNew high-difficulty quests, The Agito Uprising<\/u><br>The Agito Uprising, high-difficulty quests that pit you against powerful members of a new hostile force, will be added at <span class=\\"local_date\\" data-local_date=\\"1577340000\\"><\/span>.<br>You can use the materials obtained in The Agito Uprising to craft the new 6\\u2605 weapons.<br><br><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/e5e84f122c8547511e964715b5c70b74.png\\"><\/div><div><br><\/div><div><u>\\u30fbShop UI changes<\/u><br>We will adjust the shop layout.<\/div><div>After updating to version 1.15.1, a &quot;Monthly Packs Restocked!&quot; pop-up is displayed. However the items displayed in the &quot;This Month&quot; tab will only be updated on <span class=\\"local_date\\" data-local_date=\\"1577858400\\"><\/span>.<br>Note: This is merely a display issue. The items in the &quot;This Month&quot; tab are the ones which were updated on <span class=\\"local_date\\" data-local_date=\\"1575180000\\"><\/span>.<br><br><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/26d8f819ca798bfb11409639650b3e23.png\\"><\/div><div><br><\/div><div><u>\\u30fbIncreased Halidom level cap<\/u><br>We will raise the Halidom&#39;s maximum level to 10 at <span class=\\"local_date\\" data-local_date=\\"1577340000\\"><\/span>.<\/div><div><br><\/div><div><strong>\\u25a0Other Changes<\/strong><br>\\u30fbThe 2D illustration for when Halloween Mym shapeshifts will be changed to a unique image at <span class=\\"local_date\\" data-local_date=\\"1577241000\\"><\/span>.<br>\\u30fbWe will adjust the heads of the 3D models for some characters starting <span class=\\"local_date\\" data-local_date=\\"1577340000\\"><\/span>.<br>\\u30fbWe will change the name of the skip tickets you can purchase in the shop to 5 Skip Ticket Set.<br>Note: This change does not affect the price or content of the item.<br>\\u30fbWe will increase the height of effect for buff zones produced by certain skills.<br>Note: This change will make it so that the skills of certain characters who jump when they use their skills are still affected. The area of effect will not be changed.<br>\\u25bcAffected Skills<br>Gala Prince&#39;s Rising Circlet skill<br>Wedding Elisanne&#39;s Sacred Union skill<br>Akasha&#39;s Vital Gate Skill<br>\\u30fbYou will be able to purchase a 4 Exquisite Honey Set item from the shop on the Today tab under Upgrade Essentials (called Upgrade Essentials &amp; Packs after the layout adjustments).<\/div><div><span style=\\"color: rgb(41, 105, 176);\\"><strong>[Addendum <span class=\\"local_date\\" data-local_date=\\"1577242800\\"><\/span>]<\/strong><\/span><\/div><div>The following change will be applied in a data update around <span class=\\"local_date\\" data-local_date=\\"1577340000\\"><\/span>.<\/div><div>\\u30fbWe will remove the effect of Jupiter&#39;s Amplify attack, which removes all debuffs and afflictions, from all difficulty levels of High Jupiter&#39;s Trial.<\/div><div><span style=\\"color: rgb(41, 105, 176);\\"><strong>[Addendum <span class=\\"local_date\\" data-local_date=\\"1577340000\\"><\/span>]<\/strong><\/span><\/div><div>The following change will be applied in a data update around <span class=\\"local_date\\" data-local_date=\\"1577772000\\"><\/span>.<\/div><div>\\u30fbWe will increase the attack area of Ieyasu&#39;s Sakura Flurry skill.<\/div><div><br><strong>\\u25a0Issues Fixed<\/strong><br>The following issue has been fixed in this version:<br>\\u30fbThe position of the text bubbles that display for obtained items on the quest results screen is sometimes shifted downard.<\/div><div><span style=\\"color: rgb(41, 105, 176);\\"><strong>[Addendum <span class=\\"local_date\\" data-local_date=\\"1577242800\\"><\/span>]<\/strong><\/span><br>We have confirmed that this issue still happens under certain circumstances.<br>We will update this notice once the issue is fixed.<br>Thank you for playing Dragalia Lost.<\/div><div><br><\/div><div>Notes:<br>1. It may take time for the store to reflect the updated information. Players may not be able to perform updates due to their device&#39;s data cache being full. If you are unable to perform the update, restart your device, and then try downloading it from the store.<br>2. Any adventurers and game screenshots shown are still in development.<br><br><span style=\\"color: rgb(44, 130, 201);\\"><strong>[Addendum <span class=\\"local_date\\" data-local_date=\\"1577329200\\"><\/span>]<\/strong><\/span><br>As a token of our appreciation, the following item has been sent to players who started playing before <span class=\\"local_date\\" data-local_date=\\"1577329200\\"><\/span>.<br><br>\\u30fbTenfold Summon Voucher x1<br><br>This gift can be claimed from your goodie box for up to seven days after logging in. If the gift isn&#39;t retrieved within seven days, it will be lost.<\/div><div><br>Thank you for playing Dragalia Lost.<\/div>","start_time":1576648800,"prev_article_id":"886","next_article_id":"1022","image_path":"","update_time":1577339938}}}'