b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":988,"category_name":"News","pr_category_id":"1","title_name":"Notte\'s Slumber Shot Is Now Live!","message":"<div>Notte&#39;s Slumber Shot, the popular and adorable shooting game created by Notte and released exclusively on April Fools&#39; Day, is back! Previously released when Notte took over as director of the game for a day, this fan favorite is coming back for a limited six-day period around the end of the year and the start of the new one!<\/div><div><br><\/div><div>We&#39;re also adding limited-time endeavors!<\/div><div><br><\/div><div>Notte&#39;s letting loose in the forest again! Whether you&#39;re a Notte&#39;s Slumber Shot veteran or playing for the first time, we hope you have a blast!<\/div><div><br><\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/a89fb8636bc066f27ce1a8cfc4530932.png\\"><\/div><div>\\u25a0How to Play<\/div><div>\\u30fbWhoa! Notte&#39;s the star of her own game?! Let&#39;s not worry about the why or the how, let&#39;s just set out on a heart-pounding adventure!<\/div><div>\\u30fbShoot water drops at the enemies that stand in your way to send them packing! Defeat the golden fafnirs that appear to find berries. Eating them will level up your water drops!<\/div><div>\\u30fbYou&#39;ll lose hearts if you&#39;re hit by an enemy attack, and if you run out, it&#39;s game over. But don&#39;t give up just because of a few bumps and scrapes! If you can hang in there when the going gets tough, you&#39;ll be able to recover hearts.<\/div><div>\\u30fbBut what&#39;s waiting at the end? Well, we didn&#39;t want to be the one to tell you this, but... It&#39;s a pretty big dragon. If you can evade its fierce attacks and take it down, you&#39;ll get a ton of sparkling stars. So get in there and aim for a high score!<\/div><div><br><\/div><div>\\u25a0Event Duration<\/div><div><span class=\\"local_date\\" data-local_date=\\"1577772000\\"><\/span> to <span class=\\"local_date\\" data-local_date=\\"1578290399\\"><\/span><\/div><div><br><\/div><div>\\u25a0Limited-Time Endeavors<\/div><div>The following limited-time endeavors will be added.<\/div><div>You can earn wyrmite by completing the endeavors.<\/div><div>\\u30fbPlay Notte&#39;s Slumber Shot<\/div><div>\\u30fbClear Notte&#39;s Slumber Shot on SWEET difficulty.<\/div><div><br><\/div><div>Notes:<\/div><div>1. Notte&#39;s Slumber Shot is an event that was previously released for one day only from <span class=\\"local_date\\" data-local_date=\\"1554098400\\"><\/span> to <span class=\\"local_date\\" data-local_date=\\"1554184799\\"><\/span>.<\/div><div>2. If you start playing during the event duration but clear the game after the event duration has ended, the limited-time endeavor that requires you to clear the game will not be completed.<\/div><div><br><\/div><div>Thank you for playing Dragalia Lost.<\/div>","start_time":1577772000,"prev_article_id":"964","next_article_id":"979","image_path":"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/a89fb8636bc066f27ce1a8cfc4530932.png","update_time":1577263343}}}'