article_id:1112,category_name:News,title_name:This Month in Dragalia Lost,image_path:,message:<div>Hello there! Yuji Okada here, director of Dragalia Lost.</div><div>&nbsp; &nbsp;</div><div>I hope you&#39;re enjoying the events that are currently live! I&#39;m here to talk a little about A Dash of Disaster, as well as other things that are coming up in Dragalia Lost.</div><div><br></div><div>■A Dash of Disaster</div><div>In this event, you can get a facility that boosts the stats of blade and wand adventurers.</div><div><br></div><div>Also, Valerio, an adventurer who appears in the summon showcase, has a special mechanic that allows him to switch between three stances. These stances change his normal attacks and skills. He&#39;s a strong adventurer even if you don&#39;t switch between stances, but he gets even stronger when you switch between stances based on the situation. Valerio can even inflict frostbite on enemies with one of his skills!</div><div><br></div><div>I hope you enjoy playing with the subtle differences in how he controls depending on his stance.</div><div><br></div><div>I also want to point out that Valerio&#39;s second skill, Bon App&eacute;tit, applies a new effect called inspiration to adventurers. If an adventurer&#39;s inspiration increases to stage five, the next skill effect is guaranteed to be critical!</div><div><br></div><div>The dragon Nimis also has a special skill which extends shapeshift time, allowing you to deal tons of damage when you shapeshift.</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/d3b8086031fcde6590608297a0930f7d.png"></div><div><br></div><div>Part two of the summon showcase will start in the near future, and it&#39;ll feature Mitsuba, an adventurer who appeared in the event. Like Valerio, Mitsuba can switch between two different stances which change her normal attacks and skills. These are called sashimi stance and tempura stance.</div><div><br></div><div>A notification about this will be posted later, so check that out for more details!</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/db81d9f37623dae4bc167905e0513254.png"></div><div><br></div><div>We&#39;re also planning on adjusting the auto-play feature for adventurers and dragons that have unique control options, so look forward to that in the future!</div><div><br></div><div>■Adventurers with the Mana Spiral Unlocked</div><div>We&#39;ve unlocked the mana spiral for three more adventurers.</div><div><br></div><div>As their mana spirals are unbound, the force strikes of shadow-attuned adventurers Cleo (staff) and Nefaria (bow) gain an effect that removes one buff from enemies. This effect will be useful against bosses like those from The Agito Uprising.</div><div><br></div><div>Meanwhile, the water-attuned Xainfried gains the ability to inflict frostbite with his skills and does more damage against frostbitten enemies, which greatly increases the damage he can deal.</div><div><br></div><div>All of these adventurers have been in the game since launch, so you should try using them and see how much more powerful they&#39;ve become!</div><div><br></div><div>This was announced recently, but I want to reiterate that it&#39;s taking some time to make adjustments for the shadow-attuned 3★ adventurers whose mana spiral will be unlocked, so you&#39;ll have to wait a little longer for them. Thank you for your patience.</div><div><br></div><div>■The Agito Uprising</div><div>The light-attuned boss Kai Yan recently joined The Agito Uprising.</div><div><br></div><div>The mana spiral was recently unlocked for some more shadow-attuned adventurers, so equip them with chimera weapons or high dragon weapons and use them to challenge him!</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/c854ff22f1a59301cfba7eb06f7c97ca.png"></div><div><br></div><div>Just like last time, you&#39;ll be able to craft a 6★ weapon using the materials from the first clear rewards for Standard difficulty in The Agito Uprising. Bosses that transform during battle starting at Expert difficulty are a big part of The Agito Uprising, so here&#39;s some post-transformation art.</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/e5a9d15342467011b98091338be5a94f.png"></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/4b873a6f65dc0bff77c95aed36b000d4.png"></div><div><br></div><div>Enemy behavior and other factors in The Agito Uprising are designed to make these quests a little more approachable than Advanced Dragon Trials in terms of difficulty. To make these battles even more accessible, we&#39;ll also continue releasing chimera enemies and chimera weapons for the applicable element when we implement these battles going forward.</div><div><br></div><div>You can create weapons that are effective against chimera enemies by defeating phantom enemies. While they may be challenging, we&#39;re designing chimera battles so they can be cleared in solo play.</div><div><br></div><div>You can prepare for Advanced Dragon Trials by following the phantom &rarr; chimera &rarr; Agito &rarr; Advanced Dragon Trial pattern. So, if you&#39;re having trouble clearing Advanced Dragon Trials, try starting with the Agito!</div><div><br></div><div>■Events This Month</div><div>・We&#39;ll be reviving the Skyborne Spectacle raid event in mid-March.</div><div><br></div><div>We&#39;re also planning to unlock the adventurer Su Fang&#39;s mana spiral, so if you haven&#39;t played this event, don&#39;t miss your chance to add him to your team.</div><div><br></div><div>We&#39;ll be adding the mana spiral for two other adventurers at that time as well, and one of those adventurers will be Hawk. Be on the lookout for more information via notifications.</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/0bdc0d06bb1333330fc723ab0f2c616f.png"></div><div><br></div><div>・We added an interlude to chapter 11 in January, and in March we&#39;ll add one to chapter 12.</div><div><br></div><div>This interlude will be crucial for the future of the story, so be sure to check it out!</div><div><br></div><div>■The Future of Dragalia Lost</div><div>・As of this month, it will have been one and a half years since the release of Dragalia Lost.</div><div><br></div><div>We&#39;re planning some events for the end of March to celebrate the anniversary! We&#39;re also planning to release a Dragalia Digest where we&#39;ll talk about a version update at the end of March and the future of Dragalia Lost. Keep an eye out for notifications with more detailed schedule information!</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/382b242e18ec323b2f348d5c3887884f.png"></div><div><br></div><div>・Since adding the revive and mentor bonus features in January&#39;s update, we&#39;ve received feedback that it has become easier to clear high-difficulty quests, and I was happy to see that our data also shows more players challenging and clearing these quests.</div><div><br></div><div>That said, we&#39;ve also seen cases where players who haven&#39;t cleared the quests before and players who want to get the mentor bonus are having trouble matching because it is hard to convey what you wish to accomplish through the room&#39;s objectives. This leads to players with different objectives being matched up, so we&#39;d like to fix this in a future update by adding conditions for room creation.</div><div><br></div><div>・Starting with chapter 12 of the main campaign, we introduced a change to gameplay where players must complete endeavors to progress.</div><div><br></div><div>These endeavors also serve as hints about how to clear quests, and we plan to continue implementing this update to gameplay moving forward. There are a lot of facets to upgrading in Dragalia Lost, so we want to convey this information to the player bit by bit as they progress through the main campaign so it&#39;s not overwhelming.</div><div><br></div><div>■In Conclusion</div><div>This month, we&#39;re giving the following items to players.</div><div><br></div><div>・Summon Voucher x5</div><div>・Exquisite Honey x20</div><div>・Skip Ticket x30</div><div>・Golden Key x2</div><div><br></div><div>The next installment of This Month in Dragalia Lost will be posted around April 2, 2020.</div><div><br></div><div>Thanks for reading, and for continuing to play Dragalia Lost!</div><div><br></div><div>Yuji Okada</div><div>Director, Dragalia Lost</div><div><br></div><div>Notes:</div><div>・The gift can be claimed from your goodie box for up to seven days after reception. If the gift isn&#39;t retrieved within seven days, it will be lost.</div><div>・Summon showcase, event, and update content may change without notice.</div><div>・Any adventurers and game screenshots shown are still in development.</div><div><br></div>,start_time:1583042400,update_time1582874147