article_id:1286,category_name:News,title_name:This Month in Dragalia Lost,image_path:,message:<div>Hello! Yuji Okada here, director of Dragalia Lost.</div><div><br></div><div>I want to start by thanking you for playing Dragalia Lost. I hope you&#39;re enjoying the Fire Emblem Heroes event!</div><div>Chapter 13 of the main campaign was also added, so I hope you&#39;re enjoying that too. The first time you play the main campaign on Normal difficulty it won&#39;t cost any stamina, and as you clear quests you&#39;ll get upgrade items and unlock special endeavors. I think it&#39;ll serve both new and returning players well in their future adventures if they play the main campaign during breaks between events!</div><div><br></div><div>■Fire Emblem Heroes Events</div><div>・The following two events are live until May 11.</div><div>Fire Emblem: Lost Heroes</div><div>Fire Emblem: Kindred Ties</div><div>If you haven&#39;t played them yet, I would recommend starting with the original event, Fire Emblem: Lost Heroes. In Fire Emblem: Lost Heroes, Alfonse will join your team as you play quests, and Sharena will do the same during the Fire Emblem: Kindred Ties event.</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/030cbab476cb576a562e97085b9d3a0b.png"></div><div>Also, the defensive battles in Fire Emblem: Lost Heroes are solo-only, but those in Fire Emblem: Kindred Ties can be played co-op as well!</div><div><br></div><div>This time around, we&#39;ve made a few adjustments to defensive battles to make them easier to play.</div><div>1. We increased dashing speed to make it easier to traverse the wide maps.</div><div>2. We introduced a quest skill that can be activated up to three times per quest.</div><div>When you activate this quest skill, a barrage of arrows will rain down from the sky, damaging enemies in a wide area.</div><div><br></div><div>・The theme song for the Fire Emblem: Kindred Ties event, Dawn Song, plays during the story and certain quests, such as Trials quests.</div><div>It was composed by Taku Inoue and sung by Hitomi Miyahara. As the song&#39;s title implies, I think it turned out to be rather energizing!</div><div><br></div><div>・The second half of the Fire Emblem: Kindred Ties event starts May 3.</div><div>Tiki will appear in the summon showcase that starts along with the second half of the event.</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/3a29a0cae61d9a9b025d023e39a0acaa.png"></div><div>Tiki is an adventurer with her own unique fighting style, so I hope you&#39;re looking forward to her joining the game.</div><div><br></div><div>・Also, a new type of content, the coliseum, will be added in the second half of the event.</div><div>In these quests, you&#39;ll fight successive battles against adventurers from Dragalia Lost and receive rewards based on how many battles you&#39;re able to win. There are quests for each of the five elements and several difficulty levels.</div><div>The might requirements for the highest difficulty level, Infernal, will be rather high. Even though there are no special rewards for Infernal difficulty, I hope you take the opportunity to challenge yourself with these quests if you&#39;re confident in your skills!</div><div><br></div><div>■Plans for This Month<br>・After the Fire Emblem Heroes events end, we&#39;re planning on reviving the Loyalty&#39;s Requiem raid event.<br>It was the first event after the release of the game, but this is the first time it will be revived!<br>You can add everyone&#39;s favorite armsmaster, 4★ (water) Celliera, and the dragon Pele to your team. Also, 4★ (water) Celliera and 4★ (wind) Ranzal&#39;s mana spirals will unlock at the same time. 4★ (wind) Ranzal will be able to remove enemy buffs, which will make him an effective adventurer against the water-attuned Agito boss Ciella.<br><img src="https://dragalialost.akamaized.net/attached/information/images/5df7e5f2618f90b0cb0b34db9cba585b.png"></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/3e084347c03a00d462b9a558b6ea0c80.png"></div><div><br></div><div>・In late May, we plan to add an interlude to chapter 13 and add the Dream Big Under the Big Top facility event to the Event Compendium.<br><img src="https://dragalialost.akamaized.net/attached/information/images/d9dc3f36f9d68bd299955550bc01ac3a.png"></div><div><br></div><div>・At the end of May, we plan to add Master difficulty to Volk&#39;s Wrath in The Agito Uprising.<br>You will also be able to craft tier II flame-attuned 6★ weapons. We&#39;re preparing some action elements you can only see in Master difficulty, so I hope you try clearing it.<br>We&#39;re planning to add Master difficulty to other quests in The Agito Uprising as well, but we want to provide Standard and Expert first and add Master over time.<br><img src="https://dragalialost.akamaized.net/attached/information/images/ce3b0f2536d0f722373c9e024260473e.png"></div><div>Please also challenge the water-attuned Agito boss Ciella, who was recently added. As before, you will get the materials required to create a 6★ weapon the first time you clear the quest on Standard difficulty. In the Treasure Trade, you can also trade for a powerful facility that boosts the stats of adventurers.<br><img src="https://dragalialost.akamaized.net/attached/information/images/7139f019fca6753f41aa80946b1827da.png"></div><div><br></div><div>■Regarding Future Updates<br>・As announced previously in Dragalia Digest, one future update we&#39;re working on is the ability for a single adventurer to use up to two select skills from other adventurers. I&#39;d like to share a little more about how this will work.</div><div>　</div><div>　・An adventurer can equip up to two skills from other adventurers.<br>　・Only the leader of each team can use the skills equipped from other adventurers.<br>　・To equip skills from another adventurer, the adventurer who the skill belongs to must be level 80 or higher and have at least 50 mana nodes unlocked. Specific items must also be used.<br>　・Skills belonging to adventurers who join as part of the main campaign can be equipped even if they do not meet the conditions described above.<br>　・Some skills cannot be equipped in this way.<br><br>Please be aware that this feature is in development, so there may be changes to the above by the time of release. We will share more information about how this feature will work in a future update notification.<br><br>・Regarding the main campaign<br>This was also shared during Dragalia Digest, but chapter 14 is scheduled for release in June.<br>A new adventurer will join you in chapter 14, but you&#39;ll have to wait until you actually play the chapter in June to see who will be journeying along with you.<br><br>■In Conclusion<br>I&#39;m very happy we were able to have another Fire Emblem Heroes event! The second half of the event is coming up, and there&#39;s the revival event featuring the raid boss Phraeganoth after that, with Celliera&#39;s mana spiral being unlocked as well. Also, we&#39;re planning a new raid event for the end of May, so I hope you continue to enjoy playing Dragalia Lost!<br><br>We&#39;re giving all players the following items this month.<br>・Blessed Ethon Ashes x30<br>・Wyrmite x1,200<br>The next installment of This Month in Dragalia Lost will be posted around June 1, 2020.<br><br>Until then, thanks for reading, and for continuing to play Dragalia Lost!<br><br>Yuji Okada<br>Director, Dragalia Lost<br><br>Notes:<br>・The gift can be claimed from your goodie box for up to seven days after reception. If the gift isn&#39;t retrieved within seven days, it will be lost.<br>・Summon showcase, event, and update content may change without notice.<br>・Any adventurers and game screenshots shown are still in development.</div>,start_time:1588312800,update_time1588302661