article_id:1787,category_name:Updates,title_name:Version Update [Update],image_path:,message:<div><span style="color: rgb(41, 105, 176);"><strong>[Addendum <span class="local_date" data-local_date="1606446000"></span>]</strong></span></div><div>As a token of our appreciation, the following item has been sent to players who started playing before <span class="local_date" data-local_date="1606446000"></span>.</div><div><br>・Tenfold Summon Voucher &times; 1</div><div><br>This gift can be claimed from your goodie box for up to seven days after reception. If the gift isn&#39;t retrieved within seven days, it will be lost.</div><div><br>Thank you for playing Dragalia Lost.</div><hr><div><br></div><div>Version 2.2.0 will be available for download around <span class="local_date" data-local_date="1606359600"></span>. You may install it when it becomes available; otherwise, an automatic update will occur at approximately <span class="local_date" data-local_date="1606446000"></span>.</div><div><br></div><div>When you update to version 2.2.0 and play co-op, you will no longer be matched with players using earlier versions of the game. Rooms created by players playing earlier versions will not display in the Room List, and you will not be able to join them using Find a Room, Join Nearby Players, Enter an ID, or alliance chat.</div><div><br></div><div>To celebrate the update, we&#39;ll be sending all players a Tenfold Summon Voucher after the automatic update. This notice will be modified after it has been distributed.</div><div>Note: The Tenfold Summon Voucher will not be distributed until after the automatic update, even if you complete the update to version 2.2.0 early.</div><div><br></div><div>■Update Details</div><div>▼Wyrmprint-related improvements</div><div>・On the Edit Teams screen, players will be able to register a particular adventurer&#39;s equipped wyrmprints into decks that can be saved and used to equip other adventurers with the exact same setup.</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/35ea77ffd7779e26501c34f4d91947c2.png"></div><div><br></div><div>・Players will be able to search for wyrmprints by affinity and find abilities that satisfy more specific conditions. The way that abilities are arranged will be adjusted, and players may choose to display them in groups based on conditions such as strength and defense.</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/1b39b30466befa242df2ee60b1e2a82e.png"></div><div><br></div><div>・The method that the optimize feature uses to determine which wyrmprints are best suited for the given conditions will be adjusted.</div><div><br></div><div>・A page introducing recommended wyrmprints will appear in the Treasure Trade for Wyrmprints.</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/51eba4c7f6251e2d449954b736b1b44a.png"></div><div><br></div><div>・On the Edit Teams and Treasure Trade for Wyrmprints screens, players will be able to search for a particular wyrmprint by entering its name or the name of one of its abilities directly into the search field.</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/f1361e08b6bedc77f0a5ac2c17992b40.png"></div><div><br></div><div>・The exclamation mark (!) meant to alert players that they have yet to unlock all copies of a particular wyrmprint will no longer be displayed on that wyrmprint (even if they still have not unlocked all copies of it).</div><div><br></div><div>▼Legend Difficulty for The Agito Uprising</div><div>Starting at <span class="local_date" data-local_date="1606456800"></span>, the Legend difficulty will be added to Volk&#39;s Wrath in The Agito Uprising. When forming a team for Volk&#39;s Wrath: Legend, please note that only adventurers of a certain element will be allowed to participate. Legend-difficulty quests can be accessed from the Challenge Events (Legend Difficulty) section of the Quests menu.</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/91249d57247be9fe325538c81873bf5b.png"></div><div><br></div><div>Clear a Legend-difficulty quest in The Agito Uprising to collect materials used to refine Agito weapons to their second stage. By refining these weapons to their second stage, you can alter their appearance.</div><div><span style="color: rgb(41, 105, 176);"><strong>[Addendum <span class="local_date" data-local_date="1605864600"></span>]</strong></span><br>・When enabling Minimal Mode or setting the Visual Effects to Basic in the Options menu, any changes to weapon appearances that you may have set will not be displayed during quests and in the victory pose screens.</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/6a3ee0aee794934a7bb0902e219093df.png"></div><div><br></div><div>■Other Changes</div><div>・Certain items will be limited in how many of them can be traded at once in the Treasure Trade.</div><div>・The user interface will be adjusted in various places.</div><div><span style="color: rgb(41, 105, 176);"><strong>[Addendum <span class="local_date" data-local_date="1606275000"></span>]</strong></span></div><div>・Starting at <span class="local_date" data-local_date="1606456800"></span>, when adventurers using rapid-fire manacasters interrupt their force strike, they will no longer suffer from a debuff that reduces their force strike damage.</div><div><br></div><div>■Issues Addressed</div><div>・The speed at which Incognito Nefaria moves while casting the Ancient Incandescence skill changes depending on the setting of the Smoothing option.</div><div>・While playing co-op in Ayaha &amp; Otoha&#39;s Wrath on Standard and Expert difficulties, when Ayaha &amp; Otoha (human form) use their Hakkeyoi skill, adventurers on guest devices may be restrained even if they are outside of the visual indicator of Ayaha&#39;a restraint effect and are not hit by Otoha&#39;s attack afterward.</div><div>・While playing co-op in Ayaha &amp; Otoha&#39;s Wrath on Standard and Expert difficulties, when Ayaha &amp; Otoha (human form) use their Hakkeyoi skill under certain conditions, the effect and the position where adventurers are restrained will sometimes not be aligned between the host and guest.</div><div><br></div><div>Notes:</div><div>1. It may take time for the store to reflect the updated information. Players may not be able to perform updates due to their device&#39;s data cache being full. If you are unable to perform the update, restart your device, and then try downloading it from the store.</div><div>2. Any adventurers and game screenshots shown are still in development.</div><div><br></div><div>Thank you for playing Dragalia Lost.</div>,start_time:1605765600,update_time1606446122