article_id:2216,category_name:Updates,title_name:Version Update [Update],image_path:,message:<div><span style="color: rgb(41, 105, 176);"><strong>[Addendum <span class="local_date" data-local_date="1622170800"></span>]</strong></span></div><div>As a token of our appreciation, the following item has been sent to players who started playing before <span class="local_date" data-local_date="1622170800"></span>.</div><div><br>・Tenfold Summon Voucher &times; 1</div><div><br>This gift can be claimed from your goodie box for up to seven days after reception. If the gift isn&#39;t retrieved within seven days, it will be lost.</div><div><br>Thank you for playing Dragalia Lost.</div><hr><div>Version 2.8.0 will be available for download around <span class="local_date" data-local_date="1622084400"></span>. An automatic update will occur at approximately <span class="local_date" data-local_date="1622170800"></span>.</div><div><br></div><div>When you update to version 2.8.0 and play co-op, you will no longer be matched with players using earlier versions of the game. Rooms created by players playing earlier versions will not display in the Room List, and you will not be able to join them using Find a Room, Join Nearby Players, Enter an ID, or alliance chat.</div><div><br></div><div>To celebrate the update, we&#39;ll be sending all players a Tenfold Summon Voucher after the automatic update. This notice will be modified after it has been distributed.</div><div><br></div><div>Note: The Tenfold Summon Voucher will not be distributed until after the automatic update, even if you complete the update to version 2.8.0 early.</div><div><br></div><div>■Update Details</div><div>▼Unlock Specific Nodes and Mana Spirals Automatically!</div><div>Players will be able to automatically unlock all five of an adventurer&#39;s mana circles at once (including nodes that upgrade a co-ability) or up to a specific mana node. Note that automatically unlocking mana spiral nodes requires that the mana spiral itself be unlocked first.</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/da1bdb53b8007bc0f29e68f54393ef9f.png"></div><div><br></div><div>▼Manage Your Facilities with Ease!</div><div>The Storehouse in the Castle Grounds will be renamed &quot;Manage Facilities&quot; and improved to allow players to view, upgrade, store, and place all of their facilities from a single location.</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/0718b540b3485c0ba435d6c48d58c321.png"></div><div><br></div><div>▼Distinguish Your Roster with Medals!</div><div>A new feature called &quot;medals&quot; will be added to Notte&#39;s Notes in a data update around <span class="local_date" data-local_date="1622181600"></span>. These medals will be awarded to individual adventurers when they clear certain quests without using a skip ticket and without having their HP reduced to 0, being revived, or using a continue. In co-op, you will only receive a medal for the adventurer you controlled at the start of the quest (you will not receive medals for any adventurers who replace those of players who disconnect immediately after the quest begins). Temporary adventurers may earn medals once they permanently join your roster.</div><div><br></div><div>Medals can be viewed in the Medal Collection section of Notte&#39;s Notes or by tapping on the Medals button on an adventurer&#39;s Details screen.</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/22c8f933d90bf9c274075b3b76a83775.png"></div><div>In addition, players will be able to go directly to Notte&#39;s Notes after earning an encyclopedia bonus by increasing an adventurer&#39;s level, unlocking an adventurer&#39;s mana nodes, unbinding a dragon, or increasing a dragon&#39;s bond.</div><div><br></div><div>■Other Changes</div><div>・The Halidom&#39;s maximum level will be increased to 11 on <span class="local_date" data-local_date="1622181600"></span>.</div><div>・The description of the adventurer Summer Cleo&#39;s skill Tropical Breeze Lv. 3 will be adjusted. Its effects will remain unchanged.</div><div>・The user interface will be adjusted in various places.</div><div><br></div><div>■Quality-of-Life Improvements</div><div>・The number of daily bonuses for Dragon Trials and The Imperial Onslaught will be reduced to one each but the rewards will be doubled, allowing players to earn the current amount of rewards in half of the time.</div><div><br></div><div>■Issues Addressed</div><div>・The dragon Ramiel&#39;s wings do not always display when he dodges.</div><div><br></div><div>Notes:</div><div>1. It may take time for the store to reflect the updated information. Players may not be able to perform updates due to their device&#39;s data cache being full. If you are unable to perform the update, restart your device, and then try downloading it from the store.</div><div>2. Any adventurers and game screenshots shown are still in development.</div><div><br></div><div>Thank you for playing Dragalia Lost.</div>,start_time:1621479600,update_time1622170816