article_id:246,category_name:Events,title_name:New Story Event, Valentine's Confections, Is Now Live!,image_path:,message:<div>Greetings, all you love-struck adventurers!</div><div><br></div><div>A new story event, Valentine&#39;s Confections, went live at <span class="local_date" data-local_date="1550124000"></span>. And so we&#39;d like to say...</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/d494cefb2b9b718b0cae7c6f3a5f6379.png"></div><div>Happy Valentine&#39;s! The season for sharing your feelings with that special someone is finally here!</div><div><br></div><div>Just what can you do on this lovey-dovey holiday? You can fight an array of fiends to collect items to create special memories with characters from the Halidom! But which will you choose? The especially strict priestess? The man with love to spare? Although, you never know who else may make an appearance!</div><div><br></div><div>Of course, how much story you experience is up to you... But we hope you make the most of this extra-sweet gushy time of year!</div><div><br></div><div>■Event Overview</div><div>The Valentine&#39;s Confections story event is a new type of event where you can use event items acquired by clearing main-story quests and various events to unlock special Valentine&#39;s stories. You&#39;ll be able to check out event stories for the various characters.</div><div><br></div><div>■Acquiring Event Items</div><div>To be able to acquire event items by clearing main-story quests and various events, you must clear Ch. 2 / 2-1 (Normal), The Sylvan Archer and view the main page for the event at least once.</div><div>If you have not viewed the main page for the event before, you will not receive event items when clearing main-story quests and various events.</div><div><br></div><div>■Event Duration</div><div><span class="local_date" data-local_date="1550124000"></span> to <span class="local_date" data-local_date="1550815199"></span></div><div><br></div><div>■Reward Availability Period</div><div><span class="local_date" data-local_date="1550124000"></span> to <span class="local_date" data-local_date="1551419999"></span></div><div><br></div><div>■How to Play</div><div>1. Collect Ravishing Roses!</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/4a3ba3ee9601dd5de2285e0249448507.png"></div><div>You can obtain the event item, Ravishing Roses, from all quests during the event.</div><div>The amount of Ravishing Roses you can obtain differs between quests. The more stamina a quest expends, the more Ravishing Roses you will get.</div><div><br></div><div>2. Unlock event stories!</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/306ff044f4564caaf2f1529fe30d3ef6.png"></div><div>Use the Ravishing Roses you collected to unlock event stories. There are event stories for multiple characters which will be added over time during the event.</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/2060a49424ab4cfc6c6634a55696fd4d.png"></div><div>If you read each story to the end, then you will receive an event-specific wyrmprint.</div><div><br></div><div>3. Get event-specific Treasure Trade items!</div><div>You can trade the Ravishing Roses event items for upgrade items and treasure items like Twinkling Sand and Champion&#39;s Testaments in the Treasure Trade section on the event page.</div><div>Some items in the Treasure Trade are unlocked by clearing event stories.</div><div>Collect lots of Ravishing Roses during the event!</div><div><br></div><div>4. Clear event-specific Endeavors to earn rewards!</div><div>You can earn rewards like wyrmite, eldwater, and epithets by clearing Valentine&#39;s Confections Endeavors. To clear Endeavors, find and defeat the special rare enemies that appear during the event: Valentine&#39;s Slime and Choco Golem.</div><div><br></div><div>Notes:</div><div>1. Details for the Valentine&#39;s Confections event are available by tapping Help on the event page.</div><div>2. You must clear Ch. 2 / 2-1 (Normal), The Sylvan Archer, to participate in the event.</div><div>3. You must clear Ch. 2 / 2-1 (Normal), The Sylvan Archer, to play co-op.</div><div>4. To check the additional limited-time Daily Endeavors, tap Endeavors on the home page, then check the Limited tab.</div><div>5. You will not be able to use the Ravishing Roses in future events.</div><div>6. The schedule and content may change without warning.</div><div><br></div><div>Thank you for playing Dragalia Lost.</div>,start_time:1550124000,update_time1550123961