article_id:2475,category_name:Updates,title_name:Version Update [Update],image_path:,message:<div><span style="color: rgb(41, 105, 176);"><strong>[Addendum <span class="local_date" data-local_date="1632711600"></span>]</strong></span><br>As a token of our appreciation, the following item has been sent to players who started playing before <span class="local_date" data-local_date="1632711600"></span>.<br><br>・Tenfold Summon Voucher &times; 1<br><br>This gift can be claimed from your goodie box for up to seven days after reception. If the gift isn&#39;t retrieved within seven days, it will be lost.</div><div><br></div><hr><div><span style="color: rgb(41, 105, 176);"><strong>[Addendum <span class="local_date" data-local_date="1632306600"></span></strong></span><br>A sizeable data download will occur in the title screen when first launching the game after the version update on <span class="local_date" data-local_date="1632452400"></span>.<br>A Wi-Fi connection is recommended for downloads larger than 50 MB.<br><br>When downloading this additional data, an equivalent amount of existing game data will be deleted from your device. You don&#39;t need to create any additional storage space before starting the download.<br><br>Thank you for playing Dragalia Lost.</div><div><br></div><hr><div>Version 2.12.0 will be available for download around <span class="local_date" data-local_date="1632452400"></span>. You may install it when it becomes available; otherwise, an automatic update will occur at approximately <span class="local_date" data-local_date="1632711600"></span>.</div><div><br></div><div>When you update to version 2.12.0 and play co-op, you will no longer be matched with players using earlier versions of the game. Rooms created by players playing earlier versions will not display in the Room List, and you will not be able to join them using Find a Room, Join Nearby Players, Enter an ID, or alliance chat.</div><div><br></div><div>To celebrate the update, we&#39;ll be sending all players a Tenfold Summon Voucher after the automatic update. This notice will be updated after it has been distributed.</div><div><br></div><div>Note: The Tenfold Summon Voucher will not be distributed until after the automatic update, even if you complete the update to version 2.12.0 early.</div><div><br></div><div>■Update Details</div><div>▼Unbind Certain 5★ Dragons Up to Five Times Instead of Four!</div><div>Certain dragons who have been unbound to the fourth stage (previously called &quot;fully unbound&quot;) can be unbound to the fifth stage after the automatic update. Doing so will increase their level cap to 120 and improve the effects of their abilities.</div><div><br></div><div>While the first through fourth stages of a particular dragon can be unlocked using a copy of the same dragon (one with the same illustration), the fifth stage for certain 5★ dragons can only be unlocked using certain items.</div><div><br></div><div>A dragon&#39;s maximum bond cannot be increased in this manner. The skill descriptions of dragons eligible for this feature will be adjusted when the automatic update is applied, but the effects of the skills themselves will remain the same.</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/671e5543d74a7720e8aab534786e4a1e.png"></div><div><br></div><div>▼Fully Level Up And Unlock Mana Nodes With Omnicite!</div><div>Players can use an item called omnicite to fully level up an adventurer and fully unlock their mana nodes (including the mana spiral, if the adventurer has one). When omnicite is used to upgrade a 3★ or 4★ adventurer, their rarity will be increased to 5★.</div><div><br></div><div>Omnicite cannot be used on temporary adventurers who have yet to join your roster. Omnicite can be used on adventurers from raid events who join your roster permanently, but it cannot be used on said adventurers who are upgraded using convictions until the availability period for the epilogue during their raid event has passed.</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/ba83037e45c82e6cc3ab4e582c4df8d5.png"></div><div><br></div><div>▼Collect More Materials with Improved Drop Rates!</div><div>The rate at which certain materials drop from enemies in Void Battles, The Imperial Onslaught: Beginner/Standard/Expert/Master,Advanced Dragon Trials: Prelude/Standard/Expert/Master, and The Agito Uprising: Standard/Expert/Master in both solo and co-op play will be increased so that weapons that use materials from these quests can be crafted and upgraded more quickly. This increase will vary from quest to quest.</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/e52055cbfb2987c753deff67a566c2f1.png"></div><div><br></div><div>▼See What Loadouts Work Best in Co-op with Suggested Teams!</div><div>Suggested Teams, a feature that allows players to browse and copy team loadouts that others have used to successfully clear certain quests, will support a selection of co-op quests.</div><div><br></div><div>The Suggested Teams feature may be used with the following quests in co-op play: Advanced Dragon Trials: Standard/Expert/Master, The Agito Uprising: Standard/Expert/Master/Legend, and Rise of the Sinister Dominion: Master. Additional quests will be made available in the future. Note that, while the solo-play version of the Morsayati Reckoning quest is supported, there are no plans to support the co-op version.</div><div><br></div><div>To see the top teams for an eligible quest, simply tap on the Suggested Teams button on the quest&#39;s selection screen. Levels, unbinds, and mana circle progress are shown at their highest values, while stat boosts from abilities, augments, facilities, and encyclopedia bonuses are not taken into account.</div><div><br></div><div>When copying a suggested team loadout, if you do not have an adventurer, dragon, or wyrmprint (or sufficient copies) to match that of the suggested team, then that slot on your team will remain empty. If you do not have any of the four adventurers on the suggested team, then the first slot on your team will be filled by the Prince. If you do not have a weapon (or sufficient copies) to match that of the suggested team, then that slot on your team will be filled with a Battleworn version of the corresponding weapon.</div><div><br></div><div>Even if you do have an adventurer, dragon, wyrmprint, or weapon to match that of the suggested team, it will be added to your team at its current status, not at the status shown in Suggested Teams. (For example, if the suggested team contains an adventurer who was promoted to 5★ but your version of them is still 4★, then that slot on your team will be filled with the 4★ version.)</div><div><br></div><div>The rarities, levels, and unbinding progress displayed on the Team Information screen for suggested teams are based on the adventurers, dragons, weapons, and wyrmprints in your collection.</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/c390111be94047410b611f1de101870a.png"></div><div><br></div><div>■Other Changes</div><div>・The title screen will display a 3rd Anniversary illustration after the version 2.12.0 update is released until <span class="local_date" data-local_date="1635227999"></span>.</div><div><br></div><div>・The background music track &quot;a n n i v e r s a r y&quot; will be available from <span class="local_date" data-local_date="1632722400"></span> to <span class="local_date" data-local_date="1635227999"></span> in the System tab under Options on the Menu.</div><div><br></div><div>・3rd Anniversary stickers will be added on <span class="local_date" data-local_date="1632722400"></span>.</div><div><br></div><div>・3rd Anniversary voice lines will be available from <span class="local_date" data-local_date="1632722400"></span> to <span class="local_date" data-local_date="1635227999"></span>. To listen to them, tap or press and hold an adventurer on the Adventurers screen or the Edit Team screen, then tap the magnifying glass icon in the bottom right corner of the screen. You will be able to listen to the voice lines on the screen that opens (so long as voices are enabled in the Options menu).</div><div><br></div><div>Notes:</div><div>1. It may take time for the store to reflect the updated information. Players may not be able to perform updates due to their device&#39;s data cache being full. If you are unable to perform the update, restart your device, and then try downloading it from the store.</div><div>2. Any adventurers and game screenshots shown are still in development.</div><div><br></div><div>Thank you for playing Dragalia Lost.</div>,start_time:1631847600,update_time1632711599