article_id:2815,category_name:News,title_name:Dragalia Lost Director Yuji Okada Responds to Player Feedback (from January 30, 2022),image_path:,message:<div>On January 30, 2022, Dragalia Lost director Yuji Okada replied to feedback players sent via the in-game Leave Feedback feature.</div><div><br></div><div>This notification contains the contents of an interview with director Okada that was conducted by Yumi Uchiyama and Ayaka Asai, voice actors for the Japanese-language version of Dragalia Lost.</div><div><br></div><div>Notes:</div><div>・The feedback featured in this notification was chosen from that received between December 1 and December 31.</div><div>・Tap Feedback on the game&#39;s title screen to open the Leave Feedback screen.</div><div>・The content of the interview has been edited for this notification, so wording may differ from the original conversation.</div><div>・The content of the responses is from the time of the interview, so content that is in development may differ by the time of its release in-game.</div><div><br></div><hr><div>■Responses to Feedback from Players</div><div>Uchiyama &amp; Asai: A player wrote in to request a way to exchange their overflowing stores of Dyrenell Aureus, Dyrenell Argenteus, and Dyrenell Aes for something more useful, like rupies or honey.</div><div><br></div><div>Okada: It&#39;s clear that some players have more of certain currencies than they require, so we will consider providing a method to spend Dyrenell Aureus, Dyrenell Argenteus, Dyrenell Aes, and other such currencies in additional ways in the future. This will take a bit of time, and we appreciate your patience.</div><div><br></div><div><br></div><div>Uchiyama &amp; Asai: A player wrote in to praise the new Expedition feature in the Kaleidoscape. Before its addition in version 2.15.0, this player was concerned that, as someone who began playing from the game&#39;s release, the increasing number of new adventurers being added over time may mean that their older adventurers would eventually fall to the wayside. However, the Expedition feature allows their roster of older adventurers to see action again, which makes them very happy.</div><div><br></div><div>Okada: I&#39;m glad to hear that they enjoyed the Kaleidoscape update. For those who are unaware, the Expedition feature allows you to dispatch a team of four adventurers on a mission to collect valuable rewards like items and portrait wyrmprints while you wait for their return. The best part is that you can simply set it and forget it, so don&#39;t hesitate to dispatch adventurers in the downtime between runs. What&#39;s more, the Kaleidoscape was designed to be rewarding for players who want to conquer its challenges with a variety of different adventurers, so I encourage you to see just how deep into its depths you can delve with both your newer and older adventurers alike.</div><div><br></div><div><br></div><div>Uchiyama &amp; Asai: Speaking of which, a player wrote in to say that they are enjoying the varied playstyles that different adventurers bring to the Kaleidoscape as well as the variety of bosses who must be defeated in order to progress. They suggest that the Kaleidoscape would be a great place for bosses who the players get to fight only rarely, such as raid bosses, to make an appearance. That would certainly change up some strategies!</div><div><br></div><div>Okada: While I cannot guarantee that we will see raid bosses in the Kaleidoscape in the future, I can say that we are working on multiple new floors and bosses for players to challenge in upcoming updates, so keep honing your skills and stay tuned for further information!</div><div><br></div><div><br></div><div>Uchiyama &amp; Asai: Continuing on with the topic of the Kaleidoscape, a player wrote in to request a change to the Suspend Progress feature that would allow them to suspend their progress without using one of their continues. They also request the addition of an option in the game settings to force the &quot;Proceed to the next floor?&quot; confirmation message to appear at the end of each floor (even if no inventory management is necessary), since they sometimes inadvertently cross the threshold into the next floor in the heat of battle.</div><div><br></div><div>Okada: We will consider adding an option to force the confirmation message to appear so that players do not inadvertently exit a floor before they have finished exploring or fighting. Regarding the Suspend Progress feature, the system of continues was designed to prevent players from playing Kaleidoscape runs over and over again and burning out. Should we notice that players are consistently using up all of their continues, we will consider adjusting the Kaleidoscape&#39;s difficulty to be easier overall.</div><div><br></div><hr><div>Director Okada will continue to reply to the feedback players send via Leave Feedback again in the future. We&#39;re looking forward to hearing your comments. (The feedback featured in the next notification will be chosen from feedback received between January 1 and January 31.)</div><div><br></div><div>Thank you for playing Dragalia Lost.</div>,start_time:1643954400,update_time1643859977