article_id:2907,category_name:News,title_name:Dragalia Lost Director Yuji Okada Responds to Player Feedback (from February 27, 2022),image_path:,message:<div>On February 27, 2022, Dragalia Lost director Yuji Okada replied to feedback players sent via the in-game Leave Feedback feature.</div><div><br></div><div>This notification contains the contents of an interview with director Okada that was conducted by Yumi Uchiyama and Ayaka Asai, voice actors for the Japanese-language version of Dragalia Lost.</div><div><br></div><div>Notes:</div><div>・The feedback featured in this notification was chosen from that received between January 1 and January 31.</div><div>・Tap Feedback on the game&#39;s title screen to open the Leave Feedback screen.</div><div>・The content of the interview has been edited for this notification, so wording may differ from the original conversation.</div><div>・The content of the responses is from the time of the interview, so content that is in development may differ by the time of its release in-game.</div><div><br></div><hr><div>■Responses to Feedback from Players</div><div>Uchiyama &amp; Asai: A player wrote in to praise the story developments in part two of chapter 23. In particular, Emile&#39;s line &quot;Which means you people haven&#39;t earned the right to give up! Not yet, anyway!&quot; really stuck with them, so much so that they&#39;re taking it to heart while studying for their upcoming exams this weekend. They look forward to seeing what&#39;s in store for the prince and his friends in the main campaign.</div><div><br></div><div>Okada: I&#39;m happy to hear that they enjoyed the story of chapter 23 so much. We&#39;ve been able to gradually paint a more complete picture of Emile and the rest of his siblings throughout various events and finally in the main campaign. We know that some players felt that Emile in particular had a lot of potential for further development and were waiting with bated breath to see where he ended up, so I&#39;m glad that we were able to use the story in this chapter to show just how far he&#39;s come.</div><div><br></div><div><br></div><div>Uchiyama &amp; Asai: Regarding portrait wyrmprints, a player wrote in to request that the search feature be updated to recognize hits for elemental attunements and weapon types. They would also appreciate it if this information could be communicated through the portrait wyrmprint&#39;s icon as well&mdash;doing so would make it easier to browse through them at a glance.</div><div><br></div><div>Okada: The portrait wyrmprints that you find in the Kaleidoscape are special because each may have different abilities even if the adventurer shown on them is the same. While we feel that, when faced with multiple portrait wyrmprints of the same adventurer, players will more than likely focus on which combination of abilities is most desirable, it is also important to be aware of elemental attunements and weapon types when deciding which portrait wyrmprint to use. With that in mind, we will consider ways of making searching though your collection easier.</div><div><br></div><div><br></div><div>Uchiyama &amp; Asai: A player wrote in to request that the skip ticket system be changed so that these tickets can be used on all quests instead of only certain ones.</div><div><br></div><div>Okada: We are considering gradually increasing the number of quests that are eligible for skip tickets until players reach the latest high-difficulty content such as Primal Dragon Trials. I can&#39;t guarantee that every quest will eventually be eligible, but we appreciate your patience and will continue to expand this feature as appropriate.</div><div><br></div><div><br></div><div>Uchiyama &amp; Asai: We&#39;ve received a request to change the schedule for Advanced Dragon Trials on Master difficulty so that they&#39;re available every day instead of only certain ones. The player who wrote in with this request occasionally finds themselves unable to take on their desired quest because they mistook the day on which it was available, and having this experience over and over again can be disheartening.</div><div><br></div><div>Okada: I can understand the frustration of wanting to complete a particular quest but not being able to do so simply because you happened to be playing on the wrong day. Personally I feel that it would be acceptable to remove this restriction and make these quests available to play anytime, so I will bring this idea up to the team.</div><div><br></div><hr><div>Director Okada will continue to reply to the feedback players send via Leave Feedback again in the future. We&#39;re looking forward to hearing your comments. (The feedback featured in the next notification will be chosen from feedback received between February 1 and February 28.)</div><div><br></div><div>Thank you for playing Dragalia Lost.</div>,start_time:1646373600,update_time1646207965