article_id:446,category_name:Events,title_name:A New Event, Fire Emblem: Lost Heroes, Is Now Live![Addendum],image_path:,message:<div><strong>[Addendum <span class="local_date" data-local_date="1557225000"></span> ]</strong></div><div>An error in the &quot;Treasure Trade Rewards&quot; section of this announcement has been fixed as follows:</div><div><br></div><div>[Before correction]</div><div>What&#39;s more, in the event&#39;s Treasure Trade, you&#39;ll be able to trade the various items acquired during the event for other items acquired during the event.</div><div>[After correction]</div><div>Note: <span style="color: rgb(226, 80, 65);">Badges can&#39;t be traded for Great Badges and vice versa.</span></div><div><br></div><div>Thank you for playing Dragalia Lost.</div><div><br></div><hr><div><br></div><div>The Fire Emblem: Lost Heroes event went live at <span class="local_date" data-local_date="1556258400"></span>!</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/d0312ce47e9e9ab41f5f28ccee4b139c.png"></div><div>Heroes from another world are thrust into the world of Dragalia Lost! As two princes clash, a bewitching emissary launches an attack with the Imperial army. It&#39;s the power to open otherworldly gates versus dragonblood in this meeting of two realms. With Heroes, motivations, and alliances intertwined, what will become of this world?</div><div><br></div><div>■Event Overview</div><div>In the Fire Emblem: Lost Heroes event, you&#39;ll aim to protect your gate from the attacking Dyrenell Empire troops in the new event format, defensive battles, to earn rewards.</div><div><br></div><div>Alfonse, a 5★ adventurer, appears in this event. Increase your friendship with this prince to permanently add him to your roster!</div><div><br></div><div>■How to Play</div><div>1. Collect the badge and great badge event items to progress!</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/a551c4e0aa6ea3dc6e6b3e73708fd7bd.png"></div><div><br></div><div>2. Challenge defensive battles to earn valor!</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/151c0fe9f326a25727da8437cca5d853.png"></div><div><br></div><div>3. Clear added story and quests to get great rewards!</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/20016675e2daeb60461a89951eebbd34.png"></div><div><br></div><div>Here are some of the new elements in the Fire Emblem: Lost Heroes event.</div><div><br></div><div>■Defensive Battles</div><div>1. Protect your gate from the attacking Dyrenell Empire troops!</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/7f3accd62dc19a48ad18330e5149cdbd.png"></div><div><br></div><div>2. Either defend the gate for a certain amount of time or defeat the Imperial Commander to complete the quest.</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/0089c442988359aa81d9347358a830c9.png"></div><div><br></div><div>3. Use drawbridges and houses to your advantage in defensive battles!</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/349f18b126a0e82c2e5b463ecd550116.png"></div><div><br></div><div>See below for more information about the Fire Emblem: Lost Heroes event.</div><div><br></div><div>■Event Duration</div><div><span class="local_date" data-local_date="1556258400"></span> to <span class="local_date" data-local_date="1557813599"></span></div><div>Note: Additional content will be added to the event starting <span class="local_date" data-local_date="1556863200"></span>.</div><div><br></div><div>■Reward Availability Period</div><div><span class="local_date" data-local_date="1556258400"></span> to <span class="local_date" data-local_date="1558418399"></span></div><div><br></div><div>■Temporary Adventurers</div><div>When you complete quests, you will increase the friendship with any temporary adventurers in your team. If you maximize your friendship with a temporary adventurer, they will permanently remain in your collection, allowing you to include them in your team after the event ends. Their level, stats, equipment, and position in your team and collection will be maintained.</div><div><br></div><div>Note: Even if an event adventurer isn&#39;t permanently added to your collection, any items used to upgrade their level, unlock their mana circles, and promote them will not be returned.</div><div><br></div><div>■Valor Rewards</div><div>Valor points are event-exclusive points which can be earned by clearing event quests. Collect them to earn all kinds of rewards!</div><div><br></div><div>■Treasure Trade Rewards</div><div>You can earn badges and great badges by playing event quests and trade them for various rewards on the Treasure Trade menu.</div><div><span style="color: rgb(226, 80, 65);">Note: Badges can&#39;t be traded for Great Badges and vice versa.</span></div><div><br></div><div>Note: Great badges can be obtained in quests added starting at <span class="local_date" data-local_date="1556863200"></span>.</div><div><br></div><div>■Acquiring Event Items: Badges</div><div>To be able to acquire badge event items by clearing main-story quests and various events, you must clear Ch. 2 / 2-1 (Normal), The Sylvan Archer and view the main page for the event at least once.</div><div><br></div><div><span style="color: rgb(226, 80, 65);"><strong>If you have not viewed the main page for the event before, you will not receive badge event items when clearing main-story quests and various events.</strong></span></div><div><br></div><div>■Endeavors</div><div>These endeavors can only be attempted for the duration of the event. They are separated into Daily and Limited variations. By accomplishing these endeavors, you can receive various rewards.</div><div><br></div><div>■To New Dragalia Lost Players</div><div>If you find you are having trouble completing quests from the Fire Emblem: Lost Heroes event, try out the main campaign! You can get badges, the event item, from the main campaign as well.</div><div>Note: While the event is active, the badge event item can be obtained from all quests. However, valor can only be earned by playing Fire Emblem: Lost Heroes event quests.</div><div><br></div><div>If you clear Chapter 2 of the main campaign, you&#39;ll be able to upgrade and craft weapons, and if you clear Chapter 4, you&#39;ll be able to equip two wyrmprints. Both weapons and wyrmprints will help increase your might and help you face challenges!</div><div><br></div><div>What&#39;s more, an event where stamina expended when playing the main campaign is cut in half started <span class="local_date" data-local_date="1556258400"></span>.</div><div>Use the above strategies to upgrade your team! Then you&#39;ll be prepared to challenge the Empire and defensive battle quests for the Fire Emblem: Lost Heroes event and reap rewards!</div><div><br></div><div>Notes:</div><div>1. You can see more details about this event by tapping Help on the Fire Emblem: Lost Heroes event page.</div><div>2. Players must have completed up to Chapter 2 / 2-1 (Normal) of the main campaign to participate.</div><div>3. Players must have completed up to Chapter 2 / 2-1 (Normal) of the main campaign in order to play co-op.</div><div>4. If the event ends while you are playing an event quest, the quest will continue until results have been determined and you will be able to gain the rewards shown.</div><div>5. If a temporary adventurer joins you after the event ends, you will be able to read their Adventurer Story.</div><div><br></div><div>Thank you for playing Dragalia Lost.</div>,start_time:1557225000,update_time1557224714