article_id:451,category_name:Events,title_name:New Void Enemy and Void Battle Limited-Time Endeavors![Addendum],image_path:,message:<div>A new Void enemy will be added to Void Battles (event quests where you can battle powerful boss enemies) at <span class="local_date" data-local_date="1555048800"></span>!</div><div>&nbsp;</div><div>You can craft new weapons using the materials obtained by defeating the newly added Void enemy. Additionally, the Gold Fafnir dragon will be added to the Void Battles Treasure Trade.</div><div>&nbsp;</div><div>Furthermore, Limited Void Battle Endeavors will be available between <span class="local_date" data-local_date="1555048800"></span> ～ <span class="local_date" data-local_date="1556258399"></span>!</div><div>&nbsp;</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/6ccfaeba7659bf5c42ba38f30cbda59f.png"></div><div>The dragon Agni, known as the Firelord, is regarded as a mighty, formidable force. Having been corrupted by black mana, he has grown tired of the people&#39;s offerings and is now scorching everything in sight. The prince and his companions must face Void Agni and calm his violent fury!</div><div>&nbsp;</div><div>■New Void Enemy</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/02183a21f048023940ecf362a61f51c8.png"></div><div>Void Agni (Flame), Required Might: 12,500</div><div>Having been corrupted by black mana, Agni uses his Skill Resistance ability to greatly reduce damage from skills, and his Scorching Air ability to burn off adventurers who get too close!</div><div>&nbsp;</div><div>■Crafting</div><div>Craftable weapons will be added.</div><div>・Daggers, lances, bows, and wands have been added to the weapon types that can be crafted using materials obtained from Void Zephyr.</div><div>Note: The new weapons listed above will be added to Void Zephyr&#39;s drop rewards in the future.</div><div>・The Lonely Ward and other weapons crafted using materials obtained from the Frost Hermit can be enhanced into water-attuned weapons with the Skill Resistance Penetrator ability.</div><div>・The Hefty Ingot and other weapons crafted using materials obtained from the Obsidian Golem can be enhanced into water-attuned weapons with the Scorching Air Res ability.</div><div>・Weapons that can be crafted using materials obtained from Void Agni have been added.</div><div><span style="color: rgb(41, 105, 176);"><strong>[Addendum <span class="local_date" data-local_date="1555554600"></span>]</strong></span></div><div>The following weapons were added to the drop rewards for Void Zephyr at <span class="local_date" data-local_date="1555554600"></span>.</div><div>・Impact Thrust (dagger)</div><div>・Great Aquila Lance (lance)</div><div>・Falkyn (bow)</div><div>・Scepter of Spirit (wand)</div><div><br></div><div>■Void Battles Treasure Trade</div><div>The Gold Fafnir dragon will be added to the Treasure Trade for Void Battles. This dragon&#39;s Rupies +25% ability increases the amount of rupies that can be acquired when completing quests, so it&#39;s useful for building and leveling up facilities in your Halidom, and for crafting weapons.</div><div>&nbsp;</div><div>When fully unbound, the Rupies +25% ability increases to Rupies +50%! What&#39;s more, the ability&#39;s effects stack, so if you equip the dragon to all four members of your team, you can get up to +200% rupies! You can trade for Gold Fafnir a maximum of 20 times.</div><div>&nbsp;</div><div>Note: The exchange limit does not reset.</div><div>&nbsp;</div><div>■Void Battles Schedule</div><div>You can play Void Battles anytime, regardless of the day of the week. However, the Void enemy that appears will differ based on the day.</div><div>&nbsp;</div><div>・While Limited-Time Endeavors Are Active</div><div><span class="local_date" data-local_date="1555048800"></span>　～ <span class="local_date" data-local_date="1556258399"></span></div><div>&nbsp; <img src="https://dragalialost.akamaized.net/attached/information/images/48759a473d9c908b85250d7d9c9f6b55.png"></div><div><br></div><div>・After Limited-Time Endeavors End</div><div><span class="local_date" data-local_date="1556258400"></span>～</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/3c8529360f721747533edb52c72dd77c.png"></div><div>&nbsp;</div><div><span style="color: rgb(44, 130, 201);"><strong>[Addendum <span class="local_date" data-local_date="1557727200"></span>]</strong></span></div><div>・After Limited-Time Endeavors End</div><div><span class="local_date" data-local_date="1557727200"></span>～</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/c50cf73b9fe2da5f4ae75b3923034dd0.png"></div><div><br></div><div>Limited-Time Endeavors</div><div>To celebrate the addition of a new Void enemy, we&#39;re adding Limited Void Battle Endeavors! These are separated into Daily and Limited variations. You can complete the endeavors to obtain various rewards.</div><div>&nbsp;</div><div>While the Limited Void Battle Endeavors are active, a wide variety of Void enemies will appear each day!</div><div>&nbsp;</div><div>■Limited Void Battle Endeavors Duration</div><div><span class="local_date" data-local_date="1555048800"></span>　～ <span class="local_date" data-local_date="1556258399"></span></div><div>&nbsp;</div><div>Notes:</div><div>1. For more information about Void Battles, tap Events on the main page, then go to the Void Battles page and select Help.</div><div>2. For more information about Void enemies, tap Events on the main page, then go to the Void Battles page and check Details on the various quest pages.</div><div>3. You can check the Endeavors added for a limited time by tapping Endeavors on the main page, then selecting the Daily or Limited tabs.</div><div>4. Players must have completed up to Chapter 7 / 5-6 (Normal) of the main campaign in order to participate in Void Battles.</div><div>&nbsp;</div><div>Thank you for playing Dragalia Lost.</div>,start_time:1557727200,update_time1557471166