article_id:528,category_name:Events,title_name:New Void Enemy and Void Battle Limited-Time Endeavors![Update],image_path:,message:<div>A new Void enemy will be added to Void Battles (event quests where you can battle powerful boss enemies) at <span class="local_date" data-local_date="1560319200"></span>!</div><div><br></div><div>You can craft new weapons using the materials obtained by defeating the newly added Void enemy. Additionally, a new Slime Statue facility will be added to the Treasure Trade for Void Battles.</div><div><br></div><div>Furthermore, Limited Void Battle Endeavors will be available between <span class="local_date" data-local_date="1560319200"></span> and <span class="local_date" data-local_date="1561010399"></span>!</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/a73a61889dcca37a79d758ae5a43aac2.png"></div><div>The once-blue water, now polluted by sinister black mana, envelops everything in its wake as it churns wildly. Not even Poseidon, the lord of the seas, can fend off this baleful force. His once-intelligent eyes grow vacant as he thrashes around in the swirling darkness. Challenge Poseidon and drive out the evil power that has overtaken him!</div><div><br></div><div>■New Void Enemy</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/b102e80c4c8101612140abfa68b680c8.png"></div><div>Void Poseidon (Water), Required Might: 12,000</div><div>Corrupted by black mana, Poseidon uses his Skill Resistance ability to greatly reduce damage from skills. He can also swallow up the adventurers around him with his Whirlpool ability.</div><div><br></div><div>■Crafting</div><div>Craftable weapons will be added.</div><div>・Daggers and blades have been added to the weapon types that can be crafted using materials obtained from the Frost Hermit.</div><div>Note: The new weapons listed above will be added to the Frost Hermit&#39;s drop rewards in the future.</div><div>・The Lonely Ward and other weapons crafted using materials obtained from the Frost Hermit can be enhanced into wind-attuned weapons with the Whirlpool Res ability.</div><div>・The Rest Eternal and other weapons crafted using materials obtained from the Violet Ghost can be enhanced into wind-attuned weapons with the Skill Resistance Penetrator ability.</div><div>・Swords, axes, bows, and wands have been added to the weapon types that can be crafted using materials obtained from Void Agni.</div><div>Note: The new weapons listed above will be added to Void Agni&#39;s drop rewards in the future.</div><div>・Weapons that can be crafted using materials obtained from Void Poseidon have been added.</div><div><span style="color: rgb(84, 172, 210);"><strong>[Addendum <span class="local_date" data-local_date="1560912300"></span>]</strong></span></div><div>At <span class="local_date" data-local_date="1560912300"></span>, the following weapons were added to the Frost Hermit&#39;s drop rewards.</div><div>・Gemstone Dagger (Dagger)</div><div>・Fiendcutter (Blade)</div><div>At <span class="local_date" data-local_date="1560912300"></span>, the following weapons were added to Void Agni&#39;s drop rewards.</div><div>・Judge of Souls (Sword)</div><div>・Unspeakable Crash (Axe)</div><div>・The Perforator (Bow)</div><div>・Couragebane (Wand)</div><div><br></div><div>■Void Battles Treasure Trade</div><div>A new Slime Statue facility has been added to the Treasure Trade for Void Battles. Build it in the Halidom to increase the HP and strength of your wind-attuned adventurers.</div><div><br></div><div>Note: The exchange limit does not reset.</div><div><br></div><div>■Void Battles Schedule</div><div>You can play Void Battles anytime, regardless of the day of the week. However, the Void enemies that appear will differ based on the day. Check out the Void Battles Schedule notification for information about when each Void enemy is scheduled to appear.</div><div><a href="https://dragalialost.com/en/news/detail/19999">【Void Battles Schedule】</a></div><div><br></div><div>Limited-Time Endeavors:</div><div>To celebrate the addition of the new Void enemy, we&#39;re adding Limited Void Battle Endeavors! These are separated into Daily and Limited variations. You can complete the endeavors to obtain various rewards.</div><div><br></div><div>While the Limited Void Battle Endeavors are active, a wide variety of Void enemies will appear each day!</div><div><br></div><div>■Limited Void Battle Endeavors Duration</div><div><span class="local_date" data-local_date="1560319200"></span> to <span class="local_date" data-local_date="1561010399"></span></div><div><br></div><div>Void Battles (Frost Hermit and Violet Ghost) Double Drops Event:</div><div>The drop rewards obtained from the Frost Hermit Strike and the Violet Ghost Strike, which are applicable quests in Limited Void Battle Endeavors, will be doubled.</div><div><br></div><div>Note: This does not apply to weapons and wyrmprints.</div><div><br></div><div>■Void Battles (Frost Hermit and Violet Ghost) Double Drops Event Duration</div><div><span class="local_date" data-local_date="1560319200"></span> to <span class="local_date" data-local_date="1561010399"></span></div><div><br></div><div>Notes:</div><div>1. For more information about Void Battles, tap Events on the main page, then go to the Void Battles page and select Help.</div><div>2. For more information about Void enemies, tap Events on the main page, then go to the Void Battles page and check Details on the various quest pages.</div><div>3. You can check the Endeavors added for a limited time by tapping Endeavors on the main page, then selecting the Daily or Limited tabs.</div><div>4. Players must have completed up to Chapter 7 / 5-6 (Normal) of the main campaign in order to participate in Void Battles.</div><div><br></div><div>Thank you for playing Dragalia Lost.</div>,start_time:1560912300,update_time1560827137