article_id:539,category_name:News,title_name:Regarding Changes to Some Pack Content and Item Prices in the Shop,image_path:,message:<div>Hello, everyone! It&#39;s the Dragalia Lost team.</div><div>First of all, thank you for playing Dragalia Lost!</div><div><br></div><div>Starting <span class="local_date" data-local_date="1561960800"></span>, we&#39;ll be changing the content of some packs for sale under the This Week tab in the shop, as well as item prices. Here is some information regarding each change.</div><div><br></div><div>■Name and Content Change for the Adventurer&#39;s Boon Pack</div><div>The Adventurer&#39;s Boon Pack will be changed to the Adventurer Booster Pack. We will also be changing the content of the pack as follows:</div><div><br></div><div>Before: 400 diamantium (384 diamantium + 16 bonus diamantium), 25 gold crystals, 5,000 mana</div><div>After: 400 diamantium (384 diamantium + 16 bonus diamantium), 50 gold crystals, 30,000 mana</div><div><br></div><div>■Equipment Booster Pack Changes</div><div>Equipment Booster Packs will be split into three types: Weapon Booster Packs, Wyrmprint Booster Packs, and Dragon Booster Packs.</div><div><br></div><div>・Weapon Booster Pack</div><div>Content: 400 diamantium (384 diamantium + 16 bonus diamantium), 30 gold whetstones, 1 steel brick</div><div><br></div><div>・Wyrmprint Booster Pack</div><div>Content: 400 diamantium (384 diamantium + 16 bonus diamantium), 30 consecrated waters, 1 silver key</div><div><br></div><div>・Dragon Booster Pack</div><div>Content: 400 diamantium (384 diamantium + 16 bonus diamantium), 30 succulent dragon fruits, 1 moonlight stone</div><div><br></div><div>■Name and Content Change for Elemental Upgrade Packs</div><div>The naming for these packs will change from Upgrade Pack (X) to Booster Pack (X) (X is the corresponding element).</div><div>We will also change the content as described below.</div><div><br></div><div>・Booster Pack (Flame)</div><div>Before: 400 diamantium (384 diamantium + 16 bonus diamantium), 50 flame orbs, 10 blaze orbs, 2 inferno orbs, 5 flamewyrm&#39;s scales, 1 flamewyrm&#39;s scaldscale</div><div>After: 400 diamantium (384 diamantium + 16 bonus diamantium), 100 flame orbs, 15 blaze orbs, 7 inferno orbs, 30 flamewyrm&#39;s scales, 10 flamewyrm&#39;s scaldscales</div><div><br></div><div>・Booster Pack (Water)</div><div>Before: 400 diamantium (384 diamantium + 16 bonus diamantium), 50 water orbs, 10 stream orbs, 2 deluge orbs, 5 waterwyrm&#39;s scales, 1 waterwyrm&#39;s glistscale</div><div>After: 400 diamantium (384 diamantium + 16 bonus diamantium), 100 water orbs, 15 stream orbs, 7 deluge orbs, 30 waterwyrm&#39;s scales, 10 waterwyrm&#39;s glistscales</div><div><br></div><div>・Booster Pack (Wind)</div><div>Before: 400 diamantium (384 diamantium + 16 bonus diamantium), 50 wind orbs, 10 storm orbs, 2 maelstrom orbs, 5 windwyrm&#39;s scales, 1 windwyrm&#39;s squallscale</div><div>After: 400 diamantium (384 diamantium + 16 bonus diamantium), 100 wind orbs, 15 storm orbs, 7 maelstrom orbs, 30 windwyrm&#39;s scales, 10 windwyrm&#39;s squallscales</div><div><br></div><div>・Booster Pack (Light)</div><div>Before: 400 diamantium (384 diamantium + 16 bonus diamantium), 50 light orbs, 10 radiance orbs, 2 refulgence orbs, 5 lightwyrm&#39;s scales, 1 lightwyrm&#39;s glowscale</div><div>After: 400 diamantium (384 diamantium + 16 bonus diamantium), 100 light orbs, 15 radiance orbs, 7 refulgence orbs, 30 lightwyrm&#39;s scales, 10 lightwyrm&#39;s glowscales</div><div><br></div><div>・Booster Pack (Shadow)</div><div>Before: 400 diamantium (384 diamantium + 16 bonus diamantium), 50 shadow orbs, 10 nightfall orbs, 2 nether orbs, 5 shadowwyrm&#39;s scales, 1 shadowwyrm&#39;s darkscale</div><div>After: 400 diamantium (384 diamantium + 16 bonus diamantium), 100 shadow orbs, 15 nightfall orbs, 7 nether orbs, 30 shadowwyrm&#39;s scales, 10 shadowwyrm&#39;s darkscales</div><div><br></div><div>■Four-Leaf Clover Price Change</div><div>Four-leaf clover prices will change as follows.</div><div><br></div><div>Before: 100 diamantium</div><div>After: 30 diamantium</div><div><br></div><div>Note:</div><div>For pricing and other information, tap Shop on the home page, then select Upgrade Essentials and check the This Week tab.</div><div><br></div><div>Thank you for playing Dragalia Lost.</div><div><br></div>,start_time:1561356000,update_time1561341223