article_id:590,category_name:Events,title_name:New Quest Levels Coming to The Mercurial Gauntlet!,image_path:https://dragalialost.akamaized.net/attached/information/images/115cecefb42e37756f6deda273578a6f.png,message:<div>New quest levels will be added to The Mercurial Gauntlet at <span class="local_date" data-local_date="1563170400"></span>!</div><div>When you clear the new quest levels, endeavors you can complete will also be added at the same time!</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/115cecefb42e37756f6deda273578a6f.png"></div><div>&quot;Faf fee! (I&#39;m Fafnir Roy III!)&quot;</div><div>There is a mysterious dragon called Fafnir Roy III who rules over a great treasury and is searching for someone worthy of obtaining that fortune. A dazzling mountain of treasure awaits those who can appease Fafnir Roy III. Enter the Mercurial Gauntlet to claim the prize!</div><div><br></div><div>■New Quest Levels</div><div>・The Mercurial Gauntlet (Wind): Lv. 41-50</div><div>・The Mercurial Gauntlet (Flame): Lv. 21-50</div><div><br></div><div>■Endeavors</div><div>In addition to the new quest levels, new endeavors will be added <span class="local_date" data-local_date="1563170400"></span>.</div><div>The notification titled The Mercurial Gauntlet Endeavors List will be updated in the future, so please check it for more information.</div><div><a href="https://dragalialost.com/en/news/detail/20000">【The Mercurial Gauntlet Endevaors List】</a></div><div><br></div><div>Notes:</div><div>1. Players must have completed up to Chapter 2 / 2-1 (Normal) of the main campaign to participate.</div><div>2. For more information about The Mercurial Gauntlet, select More on the in-game footer menu, then tap Help/Support, and see The Mercurial Gauntlet under Help.</div><div>3. Once you clear a level in The Mercurial Guantlet, you will be unable to challenge that level again. Once all levels for a given quest have been cleared, it is possible to replay the final level of that quest.</div><div>4. For certain endeavors, meeting the conditions by playing The Mercurial Gauntlet will not count toward completing the endeavor, unless the endeavor specifies The Mercurial Gauntlet in its conditions.</div><div>Example: If an endeavor&#39;s condition is &quot;Clear Five Quests,&quot; clearing The Mercurial Gauntlet quests will not count towards those five quests because playing The Mercurial Gauntlet is not included in its conditions.</div><div>5. You will not earn Player EXP or Adventurer EXP when clearing The Mercurial Gauntlet quests.</div><div><br></div><div>Thank you for playing Dragalia Lost.</div>,start_time:1562911200,update_time1569488465