article_id:629,category_name:Events,title_name:Astral Raids Are Here!,image_path:https://dragalialost.akamaized.net/attached/information/images/011f0d1be28deb9ad8be621a29e7529a.png,message:<div>Astral Raids are available in Event Quests starting <span class="local_date" data-local_date="1564207200"></span>!</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/011f0d1be28deb9ad8be621a29e7529a.png"></div><div>The Astral.</div><div>It is the culmination of countless memories amassed from the corners of the world.</div><div>It is the recollection of past ruin on the constant brink of reemergence.</div><div>It is the calamities that descended the world in bygone days.</div><div>It is a call to cleanse a world scourged by the flames of catastrophe!</div><div><br></div><div>See below for more information on Astral Raids.</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/a83939cc3dd1b922718ba8b30aff73ed.png"></div><div>■Featured Boss</div><div>Valfarre</div><div><br></div><div>■Astral Raids Overview</div><div>・Astral Raids are event quests where you can fight against past raid bosses, but they are only available on the weekends.</div><div>・To challenge Astral Raids quests, you will need to use Astral Pieces.</div><div><br></div><div>■Event Duration</div><div><span class="local_date" data-local_date="1564207200"></span> to <span class="local_date" data-local_date="1564379999"></span></div><div><br></div><div>■Astral Raid Battles</div><div>・Astral Raids are raid battles where up to four players with four adventurers each (up to 16 adventurers in total!) can battle together against raid bosses.</div><div>・There are four difficulty levels available: Beginner, Standard, Expert, and Master.</div><div>・The rewards and number of Astral Pieces required to challenge the battle vary based on the difficulty.</div><div>・The Expert and Master difficulties will drop special items which can be used to confer augments.</div><div><br></div><div>・Solo</div><div>Astral Pieces will be used at the start of the battle.</div><div><br></div><div>・Co-op (host)</div><div>Astral Pieces will be used when creating a room.</div><div><br></div><div>・Co-op (guest)</div><div>Astral Pieces will be used when joining co-op.</div><div>When challenging Astral Raids, you must meet the required Might for the selected difficulty.</div><div><br></div><div>■Astral Pieces</div><div>・Astral Pieces can be obtained from the main campaign and event quests.</div><div>・You will not receive Astral Pieces for clearing The Mercurial Gauntlet quests.</div><div>・You will not receive Astral Pieces for clearing quests while Astral Raids are active.</div><div>・The maximum number of Astral Pieces you can hold is 300.</div><div>・If you obtain Astral Pieces after reaching the limit, those Astral Pieces will be lost.</div><div><br></div><div><br></div><div>■Treasure Trade Rewards</div><div>・Astral shards, which can be obtained from Astral Raids, can be traded in the Treasure Trade for special items which can be used to confer augments, insignias, and other rewards.</div><div><br></div><div>Notes:</div><div>1. Players must have completed up to Chapter 2 / 2-1 (Normal) of the main campaign to participate in Astral Raids.</div><div>2. Players must have completed up to Chapter 2 / 2-1 (Normal) of the main campaign in order to play co-op.</div><div>3. Astral Pieces will not be consumed if you fail or give up from an Astral Raids quest.</div><div>4. If not used to challenge the current Astral Raids quest, Astral Pieces you have obtained will be maintained for use in Astral Raids quests the next week and onward. These Astral Pieces can be used in future Astral Raids quests.</div><div>5. For more information about Astral Raids, tap Help on the Astral Raids event page in-game.</div><div><br></div><div>Thank you for playing Dragalia Lost.</div>,start_time:1564207200,update_time1569485649