article_id:792,category_name:Events,title_name:Astral Raids Are Starting Soon!,image_path:https://dragalialost.akamaized.net/attached/information/images/011f0d1be28deb9ad8be621a29e7529a.png,message:<div>Astral Raids will arrive in Event Quests starting <span class="local_date" data-local_date="1571464800"></span>!</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/011f0d1be28deb9ad8be621a29e7529a.png"></div><div>The Astrals.</div><div>They are the culmination of countless memories amassed from the corners of the world.</div><div>They are the recollection of past ruin on the constant brink of reemergence.</div><div>They are the calamities that descended upon the world in bygone days.</div><div>Cleanse a world scourged by the flames of catastrophe!</div><div><br></div><div>See below for more information on Astral Raids.</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/8e13179b3e0fb6c4bc10c89a2cf7db5e.png"></div><div>■Featured Boss</div><div>Sabnock</div><div><br></div><div>■Astral Raids Overview</div><div>・Astral Raids are event quests where you can fight against past raid bosses, but they are only available on the weekends.</div><div>・To challenge Astral Raids quests, you will need to use astral pieces.</div><div>・You can spend astral pieces for multiple battles in a single go, allowing you to claim rewards for multiple raids in a single raid battle.</div><div>Example: If you use the number of astral pieces required for three battles, you will receive three times the rewards.</div><div><br></div><div>■Astral Pieces</div><div>・Astral pieces can be obtained by clearing main campaign quests and event quests.</div><div>・You will not receive astral pieces for clearing The Mercurial Gauntlet quests.</div><div>・You will not receive astral pieces for clearing quests while Astral Raids are active.</div><div>・The maximum number of astral pieces you can hold is 300.</div><div>・If you obtain astral pieces after reaching the limit, those astral pieces will be lost.</div><div>・You can purchase astral pieces from the shop while Astral Raids are active. If you have insufficient astral pieces when attempting to challenge a quest, you can also purchase them at that time.</div><div><br></div><div>Notes:</div><div>1. Players must have completed up to Chapter 2 / 2-1 (Normal) of the main campaign to participate in Astral Raids.</div><div>2. Players must have completed up to Chapter 2 / 2-1 (Normal) of the main campaign in order to play co-op.</div><div><br></div><div>Thank you for playing Dragalia Lost.</div>,start_time:1571032800,update_time1570419960