article_id:862,category_name:News,title_name:This Month in Dragalia Lost,image_path:,message:<div>Hello, everyone! Yuji Okada here, director of Dragalia Lost.</div><div><br></div><div>We saw a lot of people sharing their thoughts on the first anniversary raid event, and I wanted to thank you all for being so enthusiastic about the game!</div><div>I know the story might have lacked a certain celebratory flair you&#39;d expect from the game&#39;s first anniversary, but we hope that you enjoyed playing the event nonetheless.</div><div><br></div><div><strong>■Regarding the Mega Man Event</strong></div><div>I plan on sharing more information about the Mega Man event coming at the end of this month via notifications and social media.</div><div>The first thing I&#39;d like to share is that Mega Man is the only adventurer you&#39;ll be able to add to your team during this event. There won&#39;t be a summon showcase where you can get adventurers other than Mega Man, but the good news is that all players who participate in the event and fulfill certain conditions will be able to get him!</div><div>This news may be a little disappointing to some players, but we&#39;re working hard to make sure Mega Man&#39;s actions are true to the source material.</div><div>Mega Man&#39;s skills allow him to switch to weapons with special functions and use those weapons a certain number of times. The way he controls is also unique. In terms of his Dragalia Lost weapon type, he&#39;ll be a wand user, but he moves differently from other wand users and he can fire off shots in rapid succession.</div><div>He is also capable of using his Charge Shot by doing a force strike. And while swiping normally causes an adventurer to roll, Mega Man will actually use his Sliding move!</div><div>When Mega Man hits 0 HP, a special animation will play, causing him to disappear like he does in the Mega Man games. Don&#39;t worry, though! He&#39;ll come back without issue if you use a continue.</div><div>Finally, when he shapeshifts, Mega Man will summon Rush and ride on him, doing his famous Rush Jet move. And he&#39;s able to attack in multiple directions, which makes it easy to take on hordes of enemies.</div><div>We&#39;ll put out a video explaining how Mega Man controls in mid-November, so keep an eye out!</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/31acfd0a0f1d3f10ebd656d3f8d95394.png"></div><div><br></div><div>The event will also feature some Mega Man event-specific weapons. By equipping these weapons, any adventurer will be able to fire the Mega Buster&#39;s Charge Shot. You&#39;ll also be able to get some event-specific wyrmprints, and some of these can be arranged to form one big picture.</div><div>We&#39;re also preparing a number of songs with special arrangements, including Dr. Wily Stage 1 from Mega Man 2, and you&#39;ll be able to hear the original songs by meeting certain conditions!</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/92ddf58e8d388e2eaf64818e3c0793a9.png"></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/b26c9f2fafd2050960ba95e166dcbeba.png"></div><div><br></div><div><strong>■Regarding Events in November</strong></div><div>What do you think of the current Stirring Shadows story event? If you haven&#39;t played it yet, I&#39;d recommend playing The Accursed Archives facility event revival first, which is live at the same time.</div><div>A new wind-attuned 5★ adventurer, Akasha, will be added via summon showcase starting <span class="local_date" data-local_date="1572847200"></span>. She&#39;ll be the first wind-attuned 5★ staff user.</div><div>The 5★ dragon Hastur will also be added at the same time. This will be the first time a dragon has had a Primed ability, and the adventurer you&#39;re controlling will receive a buff effect when their skill gauge fills.</div><div>After the Stirring Shadows event ends, we&#39;ll be bringing the Kindness and Captivity raid event back. Like the Fractured Futures event, this raid event will use the raid boost system. We received a lot of feedback about the chances of receiving raid boosts, so we&#39;ll be adjusting them so they drop a little more frequently this time around. We plan to use raid boosts in all raid events going forward.</div><div>There are adventurers who will be added to the game via summon showcase at the same time as this revival event, but you&#39;ll have to wait for a future notification for more information on that. We&#39;re planning on adding some really unique adventurers this time!</div><div>We&#39;ll be running weekly increased drops events for the various elements of The Imperial Onslaught in November.</div><div>Qitian Dasheng and Barbary will be making their first appearances in Astral Raids.</div><div>We&#39;re also planning to add new Void enemies at the end of November, and we&#39;ll share more information about events in future notifications.</div><div><br></div><div><strong>■Regarding New Difficulty Levels in Advanced Dragon Trials</strong></div><div>The remaining dragons will be added to Advanced Dragon Trials: Master very soon. This is the most difficult content in the game! High Mercury will be added at <span class="local_date" data-local_date="1572847200"></span>, and High Zodiark will be added at <span class="local_date" data-local_date="1573452000"></span>. From then on, the Advanced Dragon Trials: Master quests that are available will rotate daily starting <span class="local_date" data-local_date="1574056800"></span>. The weapons that were added with the addition of these new difficulties are extremely powerful, so be sure to check them out.</div><div>The Mercurial Gauntlet will be designed around those weapons from level 51 onward. That said, we don&#39;t plan to take the stats for the high dragon weapons into consideration for the main campaign and limited-time events, with the exception of certain special difficulty levels. We&#39;ll continue to monitor the overall status of all players and adjust the game accordingly.</div><div>At the time of writing, the results of the time attack rankings for the Advanced Dragon Trials are not in yet, but I want to thank you all for participating! We unlocked Expert difficulty for all five elements at the same time, and were performing rankings on top of that, so I was a little worried how things might go, but the development team was astounded by all of your incredible clear times! However, with the release of Master difficulties, the schedule did become rather crowded, so I apologize for that. Since we still haven&#39;t provided players with enough ways to power up via augments, it seems that made things a little difficult for all of you.</div><div>We will continue to adjust the game, and balance how many augments and rupies are provided, to make it a little easier for you to challenge these higher difficulty levels.</div><div><br></div><div><strong>■Regarding Future Updates</strong></div><div>We plan to update the game about two more times this year. It&#39;s still a work in progress, but one of the updates we&#39;re planning affects the home screen. I&#39;ll include an image of the screen here to give you an idea of what we have planned.</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/a5333b380234b2ebb9fce14c6925b922.png"></div><div><br></div><div>We&#39;re adding a Quests button to the in-game footer menu to make it easier to get to quests from other screens. We&#39;ll also be making it easier to see information not related to the main event, such as event and summoning information, on the home page.</div><div>We also plan to add a feature that lets you change just the appearance of a weapon in the next update, but in co-op rooms it will be clear that the weapon&#39;s appearance has been altered.</div><div>The boss enemies we announced in the Dragalia Digest at the first anniversary will make their debut at the end of the year. This group has banded together in opposition against the prince for some reason, so make sure you play to learn more! As with Advanced Dragon Trials, this will be extremely difficult content, so I hope you keep building up your teams in preparation!</div><div>Finally, with the addition of this content, we are planning to adjust the overall game balance. We are doing this with the hope that more players will be able to enjoy playing it. As we make adjustments to things like item drop rates and difficulty, we&#39;ll be sure to let you know via notifications.</div><div><br></div><div><strong>■In Conclusion</strong></div><div>We&#39;re giving all players the following items to help upgrade your facilities and adventurers:</div><div><br></div><div>Dyrenell Aureus x500</div><div>Dyrenell Argenteus x500</div><div>Dyrenell Aes x500</div><div>Fortifying Crystal x100</div><div>Amplifying Crystal x100</div><div>Rupies x5,000,000</div><div><br></div><div>The next installment of This Month in Dragalia Lost will be posted around 12/1, and it will be the last one for this year.&nbsp;</div><div>The Mega Man event will already be live at that point, and we&#39;re working hard on development to make sure it&#39;s an event that you all will enjoy.</div><div><br></div><div>Thanks for reading, and thank you for playing Dragalia Lost!</div><div><br></div><div>Yuji Okada</div><div>Director, Dragalia Lost</div><div><br></div><div>Notes:</div><div>・The gift can be claimed from your goodie box for up to seven days after logging in. If the gift isn&#39;t retrieved within seven days, it will be lost.</div><div>・Summon showcase, event, and update content may change without notice.</div><div>・Any adventurers and game screenshots shown are still in development.</div>,start_time:1572588000,update_time1572573382