article_id:1286,category_name:お知らせ,title_name:今月の『ドラガリアロスト』,image_path:,message:<div>『ドラガリアロスト』ディレクターの岡田です。</div><div>いつも『ドラガリアロスト』をプレイしていただき誠にありがとうございます。</div><div>『ファイアーエムブレム ヒーローズ』イベントはお楽しみいただけていますでしょうか。</div><div>メインストーリーは13章も追加しておりますのでそちらもぜひ楽しんでいただけますと幸いです。</div><div>なお、メインストーリーの難易度Normalは、初回のみスタミナ0で遊べたり、クリアしていくと育成に必要なアイテムがもらえたり、特別なミッションなども発生します。</div><div>新規に始められた方や久しぶりにプレイされる方はイベントの合間などに遊んでいただけますと、今後の冒険が有利になると思いますので、メインストーリーもぜひプレイしてみてください。</div><div><br></div><div>■『ファイアーエムブレム ヒーローズ』イベントに関して</div><div>・次の2つのイベントが5月12日まで開催中です。</div><div>イベント【復刻】「FIRE EMBLEM つながる世界」</div><div>イベント「FIRE EMBLEM 新たなる扉」</div><div>まだプレイされていない方はイベント【復刻】「FIRE EMBLEM つながる世界」が第1弾なので、まずそちらからプレイしていただければと思います。</div><div>イベント【復刻】「FIRE EMBLEM つながる世界」では「アルフォンス」が、イベント「FIRE EMBLEM 新たなる扉」では「シャロン」が、クエストをプレイすることにより仲間になります。</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/030cbab476cb576a562e97085b9d3a0b.png"></div><div>またイベント【復刻】「FIRE EMBLEM つながる世界」の防衛戦はソロプレイのみとなりますが、イベント「FIRE EMBLEM 新たなる扉」の防衛戦ではマルチプレイも可能となっています。</div><div><br></div><div>今回、防衛戦が遊びやすくなるようにいくつか調整を行いました。</div><div>　1. ダッシュ時の速度を上げて、広いマップを移動しやすくしました。</div><div>　2. 1クエスト3回まで発動できるクエストスキルを導入しました。</div><div>このクエストスキルを発動すると、空から大量の矢が降り注ぎ、広範囲の敵にダメージを与えられます。</div><div><br></div><div>・ストーリーや試練クエストなどの一部クエストでは、今回のイベント「FIRE EMBLEM 新たなる扉」のテーマ曲「Dawn Song」が流れます。</div><div>　井上拓さんに作曲していただき、宮原ひとみさんに歌っていただきました。</div><div>　曲名の通りとても元気の出る曲に仕上がっていると思います。</div><div><br></div><div>・イベント「FIRE EMBLEM 新たなる扉」では、5月4日から後編が開始されます。</div><div>　後編で開催される召喚では「チキ」が登場します。</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/3a29a0cae61d9a9b025d023e39a0acaa.png"></div><div>　「チキ」ならではの戦い方ができるキャラになっていますので、どうぞ楽しみにお待ちください。</div><div><br></div><div>・また後編からは「闘技場」という新コンテンツが追加されます。</div><div>　『ドラガリアロスト』のキャラと連戦していき、勝ち進んだところまでの報酬が貰えるクエストです。5属性分のクエストと難易度もいくつか用意しております。</div><div>　なお、最も高い難易度であるインファナルは非常に高い戦力を求められます。</div><div>　特別な報酬はありませんが、腕に自信のある方はぜひ挑戦してみてください。</div><div><br></div><div>■今月の予定に関して<br>・『ファイアーエムブレム ヒーローズ』イベント終了後に、レイドイベント「忠竜が願うは果てし王の魂葬」の復刻を予定しています。<br>　リリース以降一番初めのイベントでしたが、これが初めての復刻となります。</div><div>　みんなの教官である★4(水)「セリエラ」やドラゴン「ペレ」を仲間にすることができます。<br>　また、同じタイミングで★4(水)「セリエラ」、★4(風)「ランザーヴ」のマナサークル第6層の解放を予定しております。<br>　★4(風)「ランザーヴ」はスキルで相手のバフ効果を消すことができるようになり、水属性のアギト「シェルシエル」にて有効なキャラとなります。<br><img src="https://dragalialost.akamaized.net/attached/information/images/5df7e5f2618f90b0cb0b34db9cba585b.png"></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/3e084347c03a00d462b9a558b6ea0c80.png"></div><div><br></div><div>・5月の下旬には13章のストーリー追加と、施設イベント「サーカステントで夢の時間を」のメモリーイベント化を予定しています。<br><img src="https://dragalialost.akamaized.net/attached/information/images/b2e67bb8ab400c94569ba2e92a0a1aaa.png"></div><div><br></div><div>・5月末に、アギト叛逆戦の「ルヴ・トシュカトル」に難易度「超級」を追加予定です。<br>　新たに火属性★6武器のグレードⅡが作成できるようになります。<br>　超級でしか見られないアクションなども用意していますので、ぜひ攻略してみてください。<br>　他のアギト叛逆戦でも「超級」の追加は予定していますが、まず「中級」と「上級」を用意し、「超級」は順次追加していく予定です。<br><img src="https://dragalialost.akamaized.net/attached/information/images/53dcf6936d17c41af8f0598f8aa3a5ef.png">　</div><div>先日追加されました水属性のアギト「シェルシエル」もぜひ挑戦してみてください。</div><div>これまで同様、中級クリアで★6武器が作れる素材が獲得できます。<br>キャラのパラメータをアップさせる強力な施設も交換所で交換できるようになっています。<br><img src="https://dragalialost.akamaized.net/attached/information/images/76b78baac2b15e2ce278f56a941b2924.png"></div><div><br>■今後のアップデートに関して<br>・以前に「ナームちゃんねる」でもお伝えさせていただきましたが、今後のアップデートで、1人のキャラが他キャラの一部のスキルを最大2つまで使用できるようになります。<br>　その仕組みの一部をお伝えさせていただきます。<br>　・1人のキャラに他のキャラのスキルを2つまで設定できます。<br>　・設定したスキルを使用できるのは1パーティにつきリーダーキャラ1人のみです。<br>　・スキルを設定するには、そのスキルを元々持つキャラがレベル80以上かつマナサークルを50ピース以上解放した状態で、専用のアイテムを使う必要があります。<br>　・メインストーリーで加入するキャラのスキルは、上記のスキルを設定するための条件を満たさずとも、設定することが可能です。<br>　・すべてのスキルが設定可能なのではなく、一部設定できないスキルもあります。<br>　なお、上記は現在開発中の内容のため、リリース時には変更となる可能性があります。<br>　さらに詳細な仕組みに関しては、アップデートのお知らせなどでご連絡いたします。<br><br>・メインストーリーに関して<br>　こちらも「ナームちゃんねる」でお伝えさせていただきましたが14章の公開は6月を予定しております。<br>　14章では、新たにキャラが仲間になります。<br>　誰が仲間になるかについては6月に実際にプレイしていただき、確かめていただければと思います。<br>　<br>■最後に<br>再度『ファイアーエムブレム ヒーローズ』イベントを開催できて大変嬉しく思います。<br>後編も開催されますし、その後はレイドボス「フレガノス」が登場するイベントの復刻と、「セリエラ」のマナサークル第6層解放もあります。<br>また、5月末には新規のレイドイベントの開催も予定しておりますので、引き続き『ドラガリアロスト』をよろしくお願いいたします。<br><br>今月は下記のアイテムをプレゼントさせていただきます。</div><div><br>・霊鳥の聖灰&times;30　<br>・竜輝晶&times;1,200</div><div><br>次回の「今月の『ドラガリアロスト』」は6月1日の掲載を予定しています。<br><br>&nbsp;『ドラガリアロスト』<br>ディレクター 岡田佑次<br><br>※お贈りしたアイテムの受け取り期限は、「プレゼント」にアイテムが贈られてから7日間です。<br>※召喚やイベント、ゲームの調整内容などの予定は、予告なく変更する場合があります。<br>※掲載されている、キャラやゲーム画面は開発中のものです。<br><br></div><div><br></div>,start_time:1588312800,update_time1588302661