article_id:1318,category_name:お知らせ,title_name:ラジオのお庭「ご意見ボックス」返答(5/3放送),image_path:,message:<div>5月3日に、文化放送にて放送中のラジオ番組「内山夕実 朝井彩加のドラガリアロスト ラジオのお庭」でディレクター岡田がゲームの「ご意見ボックス」に寄せられた皆様からのご意見に返答しました。</div><div><br></div><div>本お知らせでは番組内のインタビュー内容と、皆様からのご意見などに対するディレクター岡田からの返答をお知らせします。</div><div><br></div><div>※「ご意見ボックス」はゲームのタイトル画面よりご利用いただけます。</div><div>※番組内の内容を本お知らせ用に編集しておりますので、放送の際の表現と異なる箇所がございます。</div><div>※回答内容は放送時点のものであり、開発中の内容は実際の仕様とは異なる可能性がございます。</div><div><br></div><hr><div>■「ご意見ボックス」への回答</div><div>ーまず、初めに「ご意見ボックス」は『ドラガリアロスト』のプレイヤーなら誰でも送れるのでしょうか？</div><div>岡田：はい、タイトル画面の右下のボタンから誰でも送れます。今日は皆様から多く寄せられているご意見を中心にいくつかピックアップしてお答えできればと思います。</div><div><br></div><div>ーでは、早速取り上げていきます。武器の作成・分解の手間がかかるなどのご意見が多いようですが、今後何か変更などはあるのでしょうか？</div><div>岡田：はい。現在開発中なのですが、武器自体の作成・グレードアップ・分解などの仕組み自体を抜本的に変えていくつもりで考えています。</div><div>今、武器の種類がかなり多くなっていて、今からプレイされる方はどれを作れば良いかわからないと思っています。まだ詳細はお伝えできないのですが、どれを作れば良いのかわかるようにしたり、もっとカスタマイズ性を上げたりしていこうと思っています。大幅に変わっていくのでそれまでお待ちいただければと思います。既に作成された武器や入手した素材は無駄にならないようにします。</div><div><br></div><div>ーちなみに武器は分解と売却のどちらもできると思うのですが、どちらの方がおすすめですか？</div><div>岡田：プレイヤーによって変わりますが、ルピを多く持っていたら分解して素材にする。ルピを持っていなかったら売ってしまっても良いかなと思います。</div><div><br></div><div>ープレイヤーによりけりということですね。ありがとうございました。</div><div><br></div><div>ー続いての質問です。パーティ編成の枠数は増えませんか？</div><div>岡田：こちらも抜本的に変えていこうと思っています。もっと詳細にカスタマイズできるように開発中です。枠数も今より増やしたり、細かく設定できるようにしたりしたいと思います。最近追加したリンクEXアビリティといった要素がそうですが、色々な編成を楽しんでいただきたいのですが、現状の枠数や管理方法だと大変になってきますので、そのあたりを変えるように開発中です。</div><div><br></div><div>ーキャラごとに竜輝の護符や武器などを紐付けられるようになったら嬉しいです。</div><div>岡田：なるほど。ちょっとチームに持ち帰ります（笑）</div><div><br></div><div>ーありがとうございます！</div><div><br></div><div>ーさて次は難易度についてです。もっと難易度を下げてほしいといったご意見や、逆に難易度を上げてほしいというご意見もあるそうですが、こちらはいかがでしょうか？</div><div>岡田：そうですね、これは本当に色々な意見が来ていて、物足りないので歯ごたえがあるものがほしいというご意見や、今でも大変だから手軽にできるものが欲しいというご意見もあり、いろんなレベルの方々に向けてコンテンツを増やしていけるよう準備中です。</div><div><br></div><div>ー始めた時期が人によって違うので、始めたばかりの方だと難しいと思われるかもしれませんね。</div><div>岡田：リリース時から遊んでいただいている方や、熱心に遊んでいただいている方には物足りないというように思われているのもあると思います。今解放しているクエストの難易度も増やしていったり、少し時間はかかっているのですが他のコンテンツを増やしたりする準備もしている最中なので、高い難易度もあればやりやすい難易度もある、という状況にしていきたいと思います。</div><div><br></div><div>ー続いてゲームの容量についてのご意見で、もう少し小さくなりませんかといただいていますね。</div><div>岡田：これも以前から言われていますので、実は今までも何度か調整させていただきましたが、どんどんイベントも増えていくので容量が増えていってしまっているのはあります。それでも、少しでも減らしていけるように調整中です。</div><div><br></div><div>ーマナサークルの画面が2Dになるなどもありましたね。</div><div>岡田：マナサークルについては、最初に見たときは良いのですが、何度か見ていると画面遷移が遅く感じてしまったり、古い端末では処理が遅くなってしまったりということもあるので、サクサク動かせるように2D画面を用意させていただきました。</div><div><br></div><div>ー続いてですが、教官ボーナスについても様々なご意見をいただいているようですね。</div><div>岡田：教官ボーナスについては、色々なご意見をいただいており、例えばマッチングがうまくいかなかったり、毎週のノルマのようなものがあるのですがそれを埋めるのに時間がかかったり、そういった意見をいただいています。アップデートで教官ボーナスを条件にしたルームを作れるようにしたのですが、今後も状況を見て調整をしていきたいと思っています。</div><div>ただ、まだ「真ドラゴンの試練」をクリアされていない方はデータ上まだまだ多くいるということがわかっていますので、そういったクエストをクリアできるような導線をしっかり作ったり、今何をしたら良いかというのをサポートしたりするというのが必要かなと思っています。</div><div><br></div><div>ーせっかくなので、ここからは番組のリスナーや私たちからの質問も取り上げてよいでしょうか。施設のLvの上限を解放してほしいです。</div><div>岡田：これはホットな話題で、4月のアップデートでルピ鉱山と属性施設のLv上限を解放して40まで上げられるようにしました。今後も状況を見ながら施設のLv上限の解放は検討していきます。</div><div><br></div><div>ーレア度の高いオーブも交換できるようにしてほしいです。</div><div>岡田：持ち帰って検討します（笑）こちらも状況を見ながら対応していきたいと思います。</div><div><br></div><div>ーもう一つ、パーティ編成の４キャラ並びは何か気をつけた方が良いポイントなどあるのでしょうか？</div><div>岡田：並びは今のところそれほど影響はないですが今後のアップデートにて、１番目のリーダーキャラに他のキャラのスキルを装備できるようになりますので、今後は１番目に編成するキャラが重要になってくると思います。</div><div><br></div><div>ーメインストーリーについても聞かせてください。今後の見どころなどはありますか？</div><div>岡田：14章は節目のストーリーになってきます。６月に配信予定なので是非チェックしていただけたらと思います。「今月の『ドラガリアロスト』」でもお伝えしましたが、14章では1人仲間が増えます。</div><div><br></div><hr><div>今回のみではなく、今後も「ご意見ボックス」へ寄せられた皆様からのご意見にディレクター岡田より回答をしていく予定です。皆様からのご意見をお待ちしております。</div><div><br></div><div>今後とも『ドラガリアロスト』をよろしくお願いいたします。</div>,start_time:1589436000,update_time1589417983