article_id:1375,category_name:お知らせ,title_name:ラジオのお庭「ご意見ボックス」返答(5/31放送),image_path:,message:<div>5月31日に、文化放送にて放送中のラジオ番組「内山夕実 朝井彩加のドラガリアロスト ラジオのお庭」でディレクターの岡田がゲームの「ご意見ボックス」に寄せられた皆様からのご意見に返答しました。</div><div><br></div><div>本お知らせでは番組内のインタビュー内容と、皆様からのご意見などに対するディレクターの岡田からの返答をお知らせします。</div><div><br></div><div>※「ご意見ボックス」はゲームのタイトル画面よりご利用いただけます。</div><div>※番組内の内容を本お知らせ用に編集しておりますので、放送の際の表現と異なる箇所がございます。</div><div>※回答内容は放送時点のものであり、開発中の内容は実際の仕様とは異なる場合がございます。</div><div><br></div><hr><div>■「ご意見ボックス」への回答</div><div>ー「虹のオーブ」が足りないというご意見と、「遺跡の試練」の超級が欲しいというご意見が届いております。</div><div>岡田：「虹のオーブ」が足りないというご意見は、今回1番多く来ていました。育成に必要な素材も増えてきていますし、施設のレベルが解放されて「虹のオーブ」が結構必要になってきているというのがあるのですが、「虹のオーブ」に関してはイベントで定期的に入手できるようにしていきますので、イベントをしっかりプレイしていただければと思います。</div><div>「遺跡の試練」の超級に関しては直近では予定していませんが、検討していきたいと考えております。</div><div>また、マナサークル第6層解放に必要なオーブは、現在メインストーリーの難易度「Very Hard」をプレイすると入手できまして、クエストのドロップアップキャンペーンなどを今後やっていこうと考えていますので、よろしくお願いいたします。</div><div><br></div><div>ーレイドイベントの「銀の祝章」を集めやすくしてほしいとのご意見がありました。</div><div>岡田：レイドの初級をプレイしてほしいという形ではあるのですが、イベントのあり方や難易度もリリース当初からかなり変わってきているので、現在の状況に合わせて内容を変更していけるよう徐々に調整していこうと思っています。</div><div><br></div><div>ー現在の状況に合わせた内容に調整していくということなので、楽しみにしています。</div><div><br></div><div>ーストーリーのノーマルミッションを達成できませんというご意見が来ています。</div><div>岡田：ご意見として結構多いのが、作る武器がわかりづらいというのがありました。メインストーリー12章から&rdquo;このミッションをクリアしてください&rdquo;というミッションが発生して、ミッションの通り進めていくと一応は武器を作れるようになるのですが、ミッションを完了して報酬を受け取るところまでやらないと、ストーリーを解放できません。わかりづらい部分もあるかとは思いますが、注意して進めていただけたらと思います。こちらに関しても改善予定です。</div><div><br></div><div>ー報酬を受け取るところまで忘れずにということですね。改善予定もあるそうですので、よろしくお願いいたします。</div><div><br></div><div>ー「おまかせ」や「倍速」が使えるクエストを増やしてほしい、『ファイアーエムブレム ヒーローズ』のイベントでは防衛戦や闘技場のおまかせ設定をもう少し対応させてほしかった、こちらのご意見に関してはいかがでしょうか。</div><div>岡田：防衛戦に関しては申し訳ございません。開発の都合によりおまかせ対応が間に合わなかったのですが、防衛戦は今後のイベントでも取り入れていきたいので、どこかのタイミングでおまかせ対応を入れていきたいと思っています。ただ、運営チームとしては「おまかせ」だけでなく、実際に触ってほしいクエストもあるので、バランスを取っていきたいと考えています。</div><div><br></div><div>ー確かに、皆で一丸となってスタンプを使いながら戦いたいですよね。</div><div>岡田：そうですね。あとは、「おまかせ」でプレイしながら大事なところは(ご自身で)操作したい方もいらっしゃると思いますので、調整していきたいと考えています。</div><div><br></div><div>ー「シェルシエル叛逆戦」のクエストについて、ちょうどいい難易度という声が多かったそうですね。</div><div>岡田：新しく4月末に新設された「アギト叛逆戦」の水属性のボスですが、毎回こういった高難易度のボスを追加する時は、クリア率、クリアタイム、クリアした時の戦力、そして皆さんからのご意見などを見て、次はどういう感じに調整していこうか考えています。今回に関しては、今まで出た「真ドラゴンの試練」や、「ルヴ・トシュカトル叛逆戦」「ガイエン叛逆戦」などを見て調整し、「シェルシエル叛逆戦」は概ね良い評価をいただいておりました。</div><div>マルチプレイではなくソロプレイでクリアされている方もいらっしゃり、一方ではやりごたえもあってちゃんとクリアもできるちょうどいい難易度だったというご意見も結構多かったので、今後も皆さんのプレイ状況を見つつ調整をしていこうと思っています。</div><div>「アギト叛逆戦」に関しては、先日もう一つ上の難易度、「ルヴ・トシュカトル叛逆戦」の超級を追加しています。そういった形でいろんな方が楽しめるようにしていきたいなと考えています。ちょっと難しいかもしれませんが、頑張ってクリアしていただければと思います。</div><div><br></div><div>ー今回も、私たちからの質問です。パーティ編成で護符を選ぶ時にたくさん種類があって悩むのですが、どういった基準で選ぶといいでしょうか。</div><div>岡田：高難易度をクリアされている方は、最初の基準としてスキルダメージが上がる護符を付けていることが多いです。例えば、剣のスキルダメージが40％上がると(護符のアビリティに)書いてあったら武器種が剣のキャラに付ける、そうすることでスキルが大幅に強化されます。スキルダメージが強化される護符は色々あるのですが、どれも結構強いのでそれをまず付けていただくのがいいと思います。護符の2枚目には、例えば毒状態の敵に対して強いキャラクターでしたら毒特効の効果を持つ護符を付けてあげると、敵が毒状態の時に攻撃力が上がるのでより強くなります。</div><div><br></div><div>ーそれは耐性が付いている敵でも発動するのでしょうか。</div><div>岡田：耐性が付いている敵には発動しませんが、火傷や麻痺、毒に関しては、結構多くの敵に付与できるようになっていますので、そういったところに合う護符を付けると強くなれるという感じです。</div><div><br></div><div>ー1枚1枚ちゃんと護符と向き合わないといけないですね。大事ですね(笑)。皆さんも参考にしてみてください！</div><div><br></div><hr><div>引き続き「ご意見ボックス」へ寄せられた皆様からのご意見にディレクター岡田より回答する予定です。</div><div>皆様からのご意見をお待ちしております。</div><div><br></div><div>今後とも『ドラガリアロスト』をよろしくお願いいたします。</div>,start_time:1591768800,update_time1591674588