article_id:1562,category_name:お知らせ,title_name:ラジオのお庭「ご意見ボックス」返答（8/30放送）,image_path:,message:<div>8月30日に、文化放送にて放送中のラジオ番組「内山夕実 朝井彩加のドラガリアロスト ラジオのお庭」でディレクターの岡田がアプリ内の「ご意見ボックス」に寄せられた皆様からのご意見に返答しました。</div><div>※7/6～7/31の期間にいただいたご意見からピックアップして回答しております。</div><div><br></div><div>本お知らせでは番組内のインタビュー内容と、皆様からのご意見などに対するディレクターの岡田からの返答をお知らせします。</div><div><br></div><div>※「ご意見ボックス」はアプリ内のタイトル画面よりご利用いただけます。</div><div>※番組内の内容を本お知らせ用に編集しておりますので、放送の際の表現と異なる箇所がございます。</div><div>※回答内容は放送時点のものであり、開発中の内容は実際の仕様とは異なる場合がございます。</div><div><br></div><hr><div>■「ご意見ボックス」への回答</div><div>─「新しく追加されたキャラやマナサークル第6層を解放したキャラを使っていますが、敵の強さとキャラの性能が噛み合っていない気がします。マルチプレイでは特定のキャラばかり使われていて、参加出来ないキャラ、ドラゴンが多いです。バランスの調整をしてほしいです。」とのご意見が来ています。</div><div>岡田：クエストは色々なキャラでクリアできるバランスで作っているのですが、マルチプレイではルームに入っているプレイヤーがクリアしやすいキャラが使用される傾向にあると思っております。</div><div>運営チームとしては、なるべくそういうことがないようにバランスを組んでいきたいです。</div><div>もう少しフォローできるような改善を近いアップデートで入れていきたいと考えていますのでお待ちください。</div><div><br></div><div>─「最近のマナサークル第6層解放で★5キャラが★4キャラより弱い印象を受ける時があります。★4キャラより貴重な強化素材を使用しているのに残念です。★4キャラが強くなるのは良いですが、マナサークル第6層解放キャラのバランスに疑問を感じます。」とのことです。</div><div>岡田：一部のキャラについては、マルチプレイで挑んだ際に連携することによって非常に強くなります。</div><div>しっかり連携をしないと強さは発揮できませんが、使いこなしているプレイヤーもいらっしゃいます。</div><div>話はずれますが、現状、闇属性のキャラ・ドラゴンは他の属性よりも大きなダメージを出せます。</div><div>属性ごとに出せる最大ダメージ値はリリース時から変更しております。</div><div>しかしながら、闇属性以外のキャラと闇属性のキャラを比較すると、少し物足りなさを感じる部分はあるかもしれません。</div><div>こちらも近々のアップデートでバランス調整することを検討しています。</div><div><br></div><div>─レイドイベント「デッドエンドアイランド」について、「とても面白いです！ストーリーが毎日更新されるのでログインするのが楽しみです。ただ、ボスの開幕攻撃で1枠目のキャラが使用できなくなる仕様が分からず困ったので、ボスがどういう攻撃をしてくるかなど、Tips（ティップス）のような感じで情報がほしかったです。」とのご意見がありました。</div><div>岡田：当該イベントのレイドバトルに挑んだ際、クエスト開始直後にボスが使用する攻撃で操作キャラが人形になり操作できなくなるギミックが入って、当初の操作キャラとは異なるキャラを操作することになっておりました。</div><div>今後はゲーム内の情報や画面などでフォローできるよう調整していきたいです。</div><div><br></div><div>─「アギト叛逆戦」の「ガイエン叛逆戦」や「アヤハ&amp;オトハ叛逆戦」に関して、「範囲攻撃の赤いアクションマーカーと紫のアクションマーカーの見分けがつきにくいので、別の色にするか設定で色を変えられるようにしてほしいです。」とのご意見が届いています。</div><div>岡田：地面の色と赤や紫のアクションマーカーの色が多少似ていることがあり、見分けにくくなっているかもしれません。</div><div>開発時に見やすいかどうかをチェックして調整していますが、より注意してチェックしてまいります。</div><div><br></div><div>─今回も、私たちからの質問です。前回の放送でもお伺いしたのですが、2周年までいよいよ1か月を切ったので、2周年について答えられる範囲で情報をいただけますか。</div><div>岡田：現在2周年に向けて準備中です。</div><div>さきほどお答えした通り、2周年に向けて様々なバランス調整をしていくつもりです。</div><div>キャラやドラゴンの調整と併せてエネミーについてもより遊びやすくなるよう、かつこれまでと同じく歯ごたえを感じられるように調整を行っています。</div><div>こちらに関してはとても大がかりな調整となっており対象も多いので、続報をお待ちいただけますでしょうか。</div><div>また、昨年の1周年のタイミングで開催したレイドイベント「クロノス～廻る運命の針～」の復刻を今月の中旬以降に予定しております。</div><div>メインストーリーやレイドイベント「クロノス～廻る運命の針～」のイベントストーリーを読むと、今月開催予定の2周年の特別なイベントのストーリーにより一層のめり込めると思いますので、前回プレイできなかったプレイヤーをはじめ皆様にプレイしていただけますと幸いです。</div><div>その他にも機能追加など色々なアップデートを予定しております。</div><div>2周年はこれまでの中でもかなり大きなアップデートとなっておりますので、ぜひとも楽しみにお待ちください。</div><div>続報は、9月中旬以降にお知らせする予定です。</div><div><br></div><hr><div>引き続き「ご意見ボックス」へ寄せられた皆様からのご意見にディレクター岡田より回答する予定です。</div><div>皆様からのご意見をお待ちしております。</div><div>※次回の放送では8/1～8/31の期間にいただいたご意見からピックアップ予定です。</div><div><br></div><div>今後とも『ドラガリアロスト』をよろしくお願いいたします。</div>,start_time:1599199200,update_time1599105059