article_id:1603,category_name:お知らせ,title_name:武器・クラフト機能の仕様変更に関するお知らせ【更新】,image_path:,message:<div><span style="color: rgb(41, 105, 176);"><strong>【<span class="local_date" data-local_date="1600858200"></span>追記】</strong></span></div><div><span class="local_date" data-local_date="1600840800"></span>ごろに更新したお知らせの一部に誤りがございましたので修正を行いました。<br>プレイヤーの皆様には、ご迷惑をおかけしましたことをお詫び申し上げます。<br><br></div><hr><div>次回アップデートにて、武器・クラフト機能の大幅な仕様変更を行います。</div><div>本お知らせでは武器・クラフト機能の次回アップデートにおける新仕様についてご説明いたします。</div><div><br></div><div>新仕様への移行に伴う武器の補填については、後日掲載するお知らせをご確認ください。</div><div>また販売アイテムの補填に関しては、下記のお知らせをご確認ください</div><div><a href="https://dragalialost.com/jp/news/detail/1572">【重要】＜※要ご確認＞仕様変更に伴う、販売アイテムの補填に関して</a></div><div><br></div><div>次回アップデートでは、従来の武器の本数を減らし、生産する武器をわかりやすくする対応を行います。</div><div>Ver.1.23.1以前は「クラフト」から各シリーズの武器を生産し、最大上限解放した後に武器をグレードアップしておりましたが、 次回アップデート以降では「クラフト」と「グレード」を廃止し、新たに「武器生産＆強化」にて各シリーズの一覧から武器を選択し生産することになります。</div><div>また、新たな機能として、それぞれの武器を強化していくことにより解放できる「武器種ボーナス」を追加しました。</div><div>Ver.1.23.1以前は武器ごとについていたアビリティも、次回アップデート以降では「武器種アビリティ」として統合し、一度解放すると対象の武器種であればどの武器でもその効果が発動するようになりました。</div><div>他にも、武器に竜輝の護符を装備できるようにするなど、機能や強化方法についても変更を加えております。</div><div><br></div><div>主な変更点は下記の通りです。</div><div>・ステータス（HP＆攻撃力）の強化方法をVer.1.23.1以前のレベルアップ方式からピース解放方式に変更します。</div><div>・上限解放を同一の武器を使用して解放するのではなく、必要素材を使用してピース解放する方式に変更します。</div><div>・武器を1本生産し、武器の所持数を解放することで、同じ武器を自身のパーティメンバー複数に装備することができるようになります。</div><div>・武器に新しくスロット機能を追加し、武器に竜輝の護符を装備する方式に変更します。</div><div>最大で武器に5つの竜輝の護符を装備することが可能です。</div><div>※なお、竜輝の護符は原則1枚につき1アビリティという仕様に変更します。</div><div>・武器種ボーナスを獲得することで、さまざまな武器を生産して強化した分だけ、キャラの武器種に応じてHPや攻撃力にボーナスがかかるようにします。</div><div>・ヴォイド討伐戦や真ドラゴンの試練などの武器に備わっていた「〇〇キラー」などの武器種アビリティは、一度解放すればどの武器を装備していても武器種アビリティが発動するようにします。</div><div><br></div><div>それぞれの変更点の詳細については、下記にてご確認ください。</div><div><br></div><hr><div><br></div><div><strong>武器の生産</strong></div><div>1. 各シリーズの武器の生産</div><div>武器種ごとに下記の武器が生産できます。</div><div>・オリジンシリーズ：★3無属性武器、★4無属性武器、★5無属性武器、★5各属性（火・水・風・光・闇）武器 計8本</div><div>・ヴォイドシリーズ：★5各属性武器 計5本</div><div>・キマイラシリーズ：★5各属性武器 計5本</div><div>・真ドラゴンシリーズ：★5各属性武器 計5本</div><div>・アギトシリーズ：★6各属性武器 計5本</div><div><br></div><div>※各武器は1本のみ生産できます。後述する強化によって、自身のパーティメンバーが装備できる武器の本数を増加させることが可能です。</div><div>※一部の既存武器は次回アップデート以降に廃止するため、生産できなくなります。</div><div>※廃止する既存武器の一部は、各シリーズ武器を強化することによって武器スキンとして獲得できます。</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/4e1679bf4361299f7d70f1e3d4966268.png"></div><div><br></div><div>2. 武器の解放条件<br>下記の順番で武器の生産が解放されます。<br>[1] オリジンシリーズ★3無属性武器<br>[2] オリジンシリーズ★4無属性武器<br>[3] オリジンシリーズ★5無属性武器<br>[4] 各シリーズの★5各属性武器<br><br>各シリーズ武器の解放条件は下記の通りです。<br>・オリジンシリーズ<br>★3無属性武器：鍛冶屋Lvなどの条件なし<br>★4無属性武器：★3無属性武器がComplete状態、かつ鍛冶屋Lv4以上<br>★5無属性武器：★4無属性武器がComplete状態、かつ鍛冶屋Lv5以上<br>★5各属性武器：★5無属性武器がComplete状態、かつ鍛冶屋Lv6以上<br>・ヴォイドシリーズ：オリジンシリーズ★5無属性武器がComplete状態、かつ鍛冶屋Lv7以上<br>・キマイラシリーズ：オリジンシリーズ★5無属性武器がComplete状態、かつ鍛冶屋Lv8以上<br>・真ドラゴンシリーズ：オリジンシリーズ★5無属性武器がComplete状態、かつ武器種・属性が一致したヴォイドシリーズ武器を所持、かつ鍛冶屋Lv7以上<br>・アギトシリーズ：オリジンシリーズ★5無属性武器がComplete状態、かつ武器種・属性が一致したキマイラシリーズ武器を所持、かつ鍛冶屋Lv8以上<br>※「Complete状態」とは、後述するステータス強化、および性能強化のピースをすべて解放した状態のことです。<br><br>3. 「その他」の武器<br>「その他」に分類される下記の武器については、武器を所持している場合、強化や装備が可能です。<br>・ソルジャーソード<br>・福招きの羽子板<br>・ロックソード、ロックブレード、ロックダガー、ロックアックス、ロックスピア、ロックボウ、ロックロッド、ロックスタッフ<br><br>なお、下記の武器については装備のみ可能で、「その他」の一覧には表示されません。<br>・使い古された剣、使い古された刀、使い古された短剣、使い古された斧、使い古された槍、使い古された弓、使い古されたロッド、使い古された杖</div><div><br></div><hr><div><br></div><div><strong>武器のステータス強化</strong></div><div>1. 武器のステータス強化<br>次回アップデート以降では、研磨石を使って武器の「HP＆攻撃力」のピース解放をすることで、武器のステータスが強化されます。<br>なお、「HP＆攻撃力」を最大まで強化するためには、後述する上限解放や武器精錬が必要です。<br><br>2. 武器の上限解放<br>武器の「上限解放」のピースを解放すると、「HP＆攻撃力」のピースの最大解放数をアップすることができます。<br>Ver.1.23.1以前の上限解放は同一の武器を素材にして上限解放を行っていましたが、次回アップデート以降では必要素材を使用して武器の上限解放を行います。<br>また、武器スキルを持つ武器については、上限解放段階を一定まで上げると、武器スキルのレベルが上昇します。<br>上限解放には、引き続き「玉鋼」「ダマスカス鋼」「アダマント」を使用することが可能です。<br>武器によっては上限解放により武器スキンを獲得できることがあります。<br><br>3. 武器精錬<br>武器の「武器精錬」のピースを解放すると、上限解放の最大解放数をアップすることができます。<br>武器精錬は必要素材を消費して行います。<br>武器精錬を行うことで、武器スキルやアビリティが別のスキルやアビリティに変化することがあります。<br><img src="https://dragalialost.akamaized.net/attached/information/images/ed5c20f0e642a554786c9f14caf39062.png"><br>4. プラス値強化<br>次回アップデート以降は武器のプラス値による強化を廃止します。<br>Ver.1.23.1以前に獲得した、武器のHPにプラス値を付与できる専用の素材アイテムである「ライフストーン」は破棄されます。<br>なお、上記のプラス値による強化の廃止に伴い、過去に今後のアップデートにて追加予定であることをご案内したまま、現在まで追加していなかった武器の攻撃力にプラス値を付与できる専用の素材アイテム「オーラストーン」については、追加予定を取り止めます。</div><div><br></div><hr><div><br></div><div><strong>武器の性能強化</strong></div><div>1. 武器の所持数<br>Ver.1.23.1以前は同じ武器を複数所持することができましたが、次回アップデート以降では1本のみ所持できます。<br>また、武器の「所持数追加」を解放することにより、解放した所持数分、最大4本まで同じ武器を自身のパーティメンバーが装備できます。<br><br>※武器の所持枠は廃止されます。<br>※一部の武器は、所持数を追加するために一定の上限解放段階が必要になります。<br>※すでに所持している武器を入手した場合は、素材アイテムなどに変換されます。<br><img src="https://dragalialost.akamaized.net/attached/information/images/206abc1b4952aff2301b95c95451b8eb.png"></div><div>2. 武器のスロット<br>新たに武器の「スロット」機能を追加します。<br>Ver.1.23.1以前はキャラ1人につき2枚の「竜輝の護符」を装備できましたが、次回アップデート以降では武器のスロットの数だけ「竜輝の護符」を装備できるようになります。<br>スロットの数は武器によって異なり、スロットの追加を行うことで、最大5つまで竜輝の護符を装備することができます。<br><br>スロットには下記の2種類があります。<br>・★5の竜輝の護符を装備可能なスロット（最大3つまで）<br>・★2～★4の竜輝の護符を装備可能なスロット（最大2つまで）<br><img src="https://dragalialost.akamaized.net/attached/information/images/e8157e1cd5742f8777fcd36e7abea155.png"><br>3. 武器種ボーナス<br>各シリーズの属性武器の「武器種ボーナス獲得」を解放すると、「武器種ボーナス」が獲得できます。<br>「武器種ボーナス」の獲得により、キャラの武器種に応じて能力が上昇します。<br>また聖城の城情報にも効果が反映されます。<br>なお、アギトシリーズの一部の武器における武器種ボーナスは今後追加予定です。</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/d7aa0163082aa064ab05bf53f5cd21e2.png"></div><div><br></div><div>4. 武器種アビリティ<br>Ver.1.23.1以前はヴォイド討伐戦やアストラルレイド解放戦、真ドラゴンの試練に有効なアビリティは各武器が持っていましたが、次回アップデート以降は「武器種アビリティ」として特定の武器を強化することにより同様のアビリティを獲得できます。<br>各武器によって、獲得できる「武器種アビリティ」は異なります。<br>「武器種アビリティ」は装備するキャラに対して、武器種と属性が一致していれば、装備する武器に関わらず効果があります。<br>そのため、「武器種アビリティ」を獲得した武器種で特定のエネミーに挑むと、武器に関わらず自動的に「武器種アビリティ」が発動します。<br>また武器によっては「武器種アビリティ」を獲得すると、武器スキンが獲得できます。<br>獲得した「武器種アビリティ」は武器種アビリティ一覧で確認可能です。</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/d31031b8d28ee382381d6602432c4402.png"></div><hr><div><br><strong>その他の変更</strong></div><div>1.武器に関するミッション<br>武器の仕様変更に伴い、いくつかのミッションを終了、もしくは内容や報酬を変更します。<br>また新規ミッションを追加します。<br>対象となるミッションは下記の通りです。<br><br>・ノーマルミッション<br>一部ミッションを終了し、新規ミッションを追加します。<br>一部ミッションの報酬を変更します。<br>一部ミッションの内容を変更します。<br><br>・メインストーリーミッション<br>一部ミッションを終了します。<br>一部ミッションの内容を変更し報酬を変更します。<br><br>・王子育成ドリル<br>一部ミッションの内容を変更します。<br><br>・各メモリーイベントにおけるミッション<br>メモリーイベント「雪降る夜、星竜樹の下で」のミッションにおいて、獲得できる武器を武器スキンに変更します。<br><br>2.その他新仕様への移行に伴う変更<br>・メインストーリー第2章 5-3「失われた象徴」をクリアした後の「武器強化」に関するチュートリアルを廃止し、メインストーリー第2章 6-2「新しい力」をクリアした後で、「武器生産＆強化」のチュートリアルが解放されるようにします。<br>・メインクエスト用マップの宝箱から「武器所持枠」がなくなり、ドラゴン所持枠やプラス値を付与できる専用の素材アイテムに変更されます。<br><br>■注意事項<br>掲載されている、キャラやゲーム画面は開発中のものです。</div><div><br>今後とも『ドラガリアロスト』をよろしくお願いいたします。</div>,start_time:1600840800,update_time1600858498