article_id:1605,category_name:お知らせ,title_name:竜輝の護符仕様変更についてのお知らせ,image_path:,message:<div>次回アップデートにて、竜輝の護符の仕様変更を行います。</div><div>本お知らせでは竜輝の護符の新仕様についてご説明いたします。</div><div><br></div><div>新仕様への移行に伴う竜輝の護符の補填については後日掲載するお知らせをご確認ください。</div><div>また販売アイテムの補填に関しては、下記のお知らせをご確認ください。</div><div><a href="https://dragalialost.com/jp/news/detail/1572">【重要】＜※要ご確認＞仕様変更に伴う、販売アイテムの補填に関して</a></div><div><br></div><div>主な変更点は下記の通りです。</div><div>・竜輝の護符が持つ機能</div><div>・竜輝の護符の強化システム</div><div>・竜輝の護符交換所、ディアネル帝国迎撃戦交換所で交換できる竜輝の護符</div><div>・竜輝の護符に関するミッション</div><div><br></div><div>それぞれの変更点の詳細については、下記にてご確認ください。</div><div><br></div><hr><div><br></div><div><strong>竜輝の護符が持つ機能</strong></div><div>1. アビリティ</div><div>Ver.1.23.1以前では、竜輝の護符は1枚につきアビリティを最大2つまで（一部イベントボーナスを持つ竜輝の護符は最大3つ）持っていましたが、次回アップデート以降では原則、竜輝の護符1枚につきにアビリティは1つです。</div><div>ただし、イベントボーナスを持つ竜輝の護符については、2つのアビリティを持つ場合があります。</div><div>上記の仕様変更に伴い、従来の竜輝の護符と同じ名前の竜輝の護符でも、アビリティが変更されている場合があります。</div><div>また、同じレアリティでも異なる名前の竜輝の護符が、同じアビリティを持つ場合があります。</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/2a2e0433ea0d21df9068211761e20ea5.png"></div><div><br></div><div>2. 装備できる枚数</div><div>竜輝の護符は、武器が持つ「スロット」の数に応じて、装備できる枚数とレアリティが決まっています。</div><div>武器1本につき、★5竜輝の護符は最大3つまで、★2～★4の竜輝の護符は最大2つまで装備できます。</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/0a02e2d07148ef903993c0821191ed17.png"></div><div><br></div><div>3. 所持数</div><div>Ver.1.23.1以前は、同じ竜輝の護符を複数所持することができ、それぞれを自身のパーティメンバーに装備することができました。</div><div>次回アップデート以降は、竜輝の護符の強化画面から所持数追加を解放することにより、解放した回数分、自身のパーティメンバーに装備できるようになります。</div><div><br></div><div>同じ竜輝の護符の所持数は最大4つで、一部の竜輝の護符を除いて覚醒の雫を使用して解放することができます。</div><div>所持数追加を解放しない限り、同じ竜輝の護符を複数のパーティメンバーに装備することができません。</div><div><br></div><div>なお、すでに所持している竜輝の護符を入手した場合は、覚醒の雫やルピに変換されます。</div><div>また、上記の仕様変更に伴い、竜輝の護符の所持枠は廃止します。</div><div><br></div><div>4. ユニオンボーナスについて</div><div>一部の竜輝の護符に、ユニオンが設定されます。</div><div>ユニオンは全部で11種類あり、同一のユニオンを持つ竜輝の護符を複数装備することによって、「ユニオンボーナス」が発動し、様々なアビリティ効果を獲得できます。</div><div>ユニオンボーナスのアビリティ効果は竜輝の護符のアビリティの効果と重複しますが、上限は共有しません。</div><div><br></div><div>例）「宝冠の誓い」のユニオンを持った護符を4つ装備している場合、「スキルダメージ＋10％」のアビリティ効果が発動</div><div><br></div><div>※ユニオンボーナス発動に必要なユニオンの個数やユニオンボーナスの効果は、ゲーム内のパーティ編成で竜輝の護符を選択する画面にて、「ユニオンボーナス一覧」からご確認ください。</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/5500cc7077eed1423628f2eb037a0f94.png"></div><div><br></div><hr><div><br></div><div><strong>竜輝の護符の強化システムについて</strong></div><div>1. HP＆攻撃力<br>Ver.1.23.1以前は、竜輝の護符のLvを上げることでステータスが強化されましたが、次回アップデート以降では「HP＆攻撃力」のピースを解放するとステータスが強化されます。<br>なお、「HP＆攻撃力」を最大まで強化するためには、上限解放が必要です。<br><br>2. 上限解放<br>竜輝の護符の「上限解放」のピースを解放すると、「HP＆攻撃力」の最大解放数をアップすることができます。<br>Ver.1.23.1以前は、上限解放は同じ竜輝の護符を素材にして行っていましたが、次回アップデート以降では同じ竜輝の護符を複数所持できないため、一部の竜輝の護符を除き覚醒の雫を使用して上限解放を行います。<br>また、上限解放数に応じてアビリティ効果が強化されます。2段階目では従来通りメモリアルライズが発生し、護符のイラストが変化します。<br>上限解放には、引き続き「想いの鍵」「夢想の聖鍵」を使用することが可能です。<br><br>3. プラス値強化<br>Ver.1.23.1以前は、HP、攻撃力ともにプラス値を付与することで＋100まで強化することができましたが、次回アップデート以降ではそれぞれ＋50まで強化できるようになります。<br>なお、Ver.1.23.1以前に使用したプラス値アイテムは補填時に返還されます。</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/16610125ab0fc5f4d7688998838af05f.png"></div><hr><div><br></div><div><strong>竜輝の護符交換所、ディアネル帝国迎撃戦交換所で交換できる竜輝の護符</strong></div><div>竜輝の護符の交換上限が1枚までになります。<br>すでに該当の竜輝の護符を所持している場合、交換することはできません。<br>また、下記の竜輝の護符の上限解放および所持数追加には、覚醒の雫ではなく各素材が必要となります。<br>・五竜の咆哮ミドガルズオルム<br>・五竜の咆哮マーキュリー<br>・五竜の咆哮ブリュンヒルデ<br>・五竜の咆哮ユピテル<br>・五竜の咆哮ゾディアーク<br>・テンペストグローリー<br>・蒼海の女王<br>・ヴォルカニッククイーン<br>・万雷の王<br>・ダークネスルーラー<br><br>なお、テンペストグローリー、蒼海の女王、ヴォルカニッククイーン、万雷の王、ダークネスルーラーの交換には、それぞれに対応する五竜の咆哮：ミドガルズオルム、五竜の咆哮：マーキュリー、五竜の咆哮：ブリュンヒルデ、五竜の咆哮：ユピテル、五竜の咆哮：ゾディアークを最大まで上限解放した状態のものを所持している必要があります。</div><div><br></div><hr><div><br></div><div><strong>竜輝の護符に関するミッション</strong></div><div>竜輝の護符の仕様変更に伴い、いくつかのミッションを終了、もしくは内容や報酬を変更します。<br>対象となるミッションは下記の通りです。<br><br>・ノーマルミッション<br>一部ミッションを終了し、新規ミッションを追加します。<br>一部ミッションの内容を変更します<br><br>・王子育成ドリル<br>一部ミッションの報酬を変更します。<br><br>・各メモリーイベントにおけるミッション<br>イベントボーナスを持つ竜輝の護符が獲得できるミッションを追加します。<br><br>その他、新仕様移行に伴う変更<br>・メインストーリー第4章 5-4「英雄の条件」をクリアした後の「竜輝の護符の2枚装備」に関するチュートリアルを廃止します。<br>・一部チュートリアルの内容を変更します。それに伴い、メインストーリー第1章のクエストのドロップ報酬を「マナスポット」から「古びたハープ」に変更します。<br>・一部メインストーリーのクリア報酬である「竜輝の護符所持枠」がなくなり、ドラゴン所持枠やプラス値を付与できる専用の素材アイテムに変更にされます。<br><br>■注意事項<br>掲載されている、キャラやゲーム画面は開発中のものです。<br><br>今後とも『ドラガリアロスト』をよろしくお願いいたします。<br><br></div>,start_time:1600840800,update_time1600829618