article_id:1622,category_name:お知らせ,title_name:竜輝の護符仕様変更に伴う補填のお知らせ,image_path:,message:<div><span class="local_date" data-local_date="1601002800"></span>に実施したVer.2.0へのアップデートにて、竜輝の護符の仕様変更を行いました。</div><div>本お知らせでは、新仕様への移行に伴う実施済みの補填についてご案内いたします。</div><div><br></div><div>改修後の新仕様に関しては、下記のお知らせをご確認ください。</div><div><a href="https://pretest05.dragalialost.com/jp/news/detail/1414-nIG5n987EAbs7NVFJE49wIKtiVhq563uXQTiDc6foGmBYQ3ekWHUazphwrSaHS1uFKZBPftekdYjqJ1XMv4D0PlNR2bv8xgy0cOj">竜輝の護符仕様変更についてのお知らせ</a></div><div>また販売アイテムの補填に関しては、下記のお知らせをご確認ください。</div><div><a href="https://dragalialost.com/jp/news/detail/1572">【重要】＜※要ご確認＞仕様変更に伴う、販売アイテムの補填に関して</a></div><div><br></div><div>＜Ver.2.0の竜輝の護符に関する新仕様の概要＞</div><div>Ver.2.0以降は原則、竜輝の護符1枚につきにアビリティは1つです。</div><div>ただし、イベントボーナスを持つ竜輝の護符については、2つのアビリティを持つ場合があります。</div><div>上記の仕様変更に伴い、従来の竜輝の護符と同じ名前の竜輝の護符でも、アビリティが変更されている場合があります。</div><div>また、同じレアリティでも異なる名前の竜輝の護符が、同じアビリティを持つ場合があります。</div><div><br></div><div>＜Ver.2.0の竜輝の護符の仕様変更に伴う補填についての概要＞</div><div>Ver.2.0以前に所持していた竜輝の護符については、所持数や上限解放段階、強化段階に応じて強化された状態の、Ver.2.0以降に同じアビリティを持つ竜輝の護符を補填しております。</div><div>対象の竜輝の護符によっては、異なるアビリティを持つ竜輝の護符や、異なるレアリティの竜輝の護符での補填となっている場合がございます。</div><div>上記補填の際に発生する差分は、覚醒の雫に変換して補填しております。</div><div>また、所持していた竜輝の護符の獲得経験値が補填後の護符の獲得経験値を上回っていた場合、差分を「祝福の聖水」にて補填いたします。</div><div>護符を強化していたプラス値については、HP、攻撃力、それぞれのプラス値分の「スピリットジェム」「フォースジェム」に変換して補填しております。</div><div>※覚醒の雫はVer.2.0以前に売却を行った際に獲得できる数をもとに補填しております。</div><div><br></div><div>各竜輝の護符の補填については下記の通りです。</div><div><br></div><hr><div><strong>■補填の手順</strong></div><div>下記の竜輝の護符について、1～6の手順にて補填いたしました。</div><div><br></div><div>1. Ver.2.0以前に所持していた竜輝の護符と同じ名称・イラストを持つ竜輝の護符を補填</div><div><br></div><div>2. Ver.2.0以前に所持していた竜輝の護符の1つ目アビリティの効果が、手順1で補填する竜輝の護符の1つ目のアビリティの効果と異なる場合、所持していた竜輝の護符の1つ目のアビリティと同等の効果を持つ竜輝の護符を追加で補填</div><div><br></div><div>3. Ver.2.0以前に所持していた竜輝の護符の2つ目のアビリティの効果が、手順1で補填する竜輝の護符の1つ目のアビリティの効果と異なる場合、所持していた竜輝の護符の2つ目のアビリティと同等の効果を持つ竜輝の護符を追加で補填</div><div><br></div><div>4. Ver.2.0以前に所持していた竜輝の護符の枚数および上限解放段階をもとに、手順1、手順2、手順3で補填される竜輝の護符ごとに枚数を換算</div><div>対象の竜輝の護符が上限解放されている場合は、下記の通り上限解放段階に応じて枚数を換算します。</div><div>上限解放段階0 &rarr; 1枚</div><div>上限解放段階1 &rarr; 同一竜輝の護符を2枚所持している状態</div><div>上限解放段階2 &rarr; 同一竜輝の護符を3枚所持している状態</div><div>上限解放段階3 &rarr; 同一竜輝の護符を4枚所持している状態</div><div>上限解放段階4 &rarr; 同一竜輝の護符を5枚所持している状態</div><div><br></div><div>例）所持していた竜輝の護符が上限解放4段階の「ブレイジング・クラウン」を2枚の場合</div><div>換算時の枚数：10枚</div><div>※換算時の枚数が20枚で、上限解放段階および所持数追加のピースが最大まで解放された状態の竜輝の護符が補填されます。</div><div><br></div><div>5. 手順4にて換算された竜輝の護符の枚数が合計20枚未満の場合</div><div>・換算枚数5枚まで：上限解放のピース解放に使用<br>・換算枚数6枚～換算枚数20枚まで：5枚まで上限解放のピース解放に使用後、残り枚数5枚ごとに所持数追加のピース解放に使用<br>※所持数追加のピース解放ができない枚数分は覚醒の雫に変換<br>・獲得経験値をもとにHP＆攻撃力強化のピースを解放し、余剰経験値が発生した場合は「祝福の聖水」にて補填</div><div><br></div><div>6. 手順4にて換算された竜輝の護符の枚数が合計20枚以上の場合</div><div>・補填される竜輝の護符の上限解放数および所持数追加のピースを最大で解放</div><div>・獲得経験値をもとにHP＆攻撃力強化のピースを解放し、余剰経験値が発生した場合は「祝福の聖水」にて補填</div><div>・20枚を超える換算された竜輝の護符の余剰枚数分の覚醒の雫を補填</div><hr><div><strong>例）所持していた竜輝の護符が「ブレイジング・クラウン」Lv.1、上限解放段階4を2枚の場合</strong></div><div>※アビリティ数値は上限解放段階0の状態の数値です。</div><div>・補填元の竜輝の護符</div><div>★5「ブレイジング・クラウン」</div><div>1つ目のアビリティ：スキルダメージ＋20％</div><div>2つ目のアビリティ：プロテクトリンク・攻＋5％</div><div><br></div><div>・新仕様への移行後に補填された竜輝の護符</div><div>A ★5「ブレイジング・クラウン」</div><div>1つ目のアビリティ：スキルダメージ＋20％</div><div>B ★4「鍛冶屋三姉妹の絆」</div><div>1つ目のアビリティ：プロテクトリンク・攻＋5％</div><div><br></div><div>・手順4で集計した竜輝の護符の換算枚数</div><div>換算枚数：10枚</div><div><br></div><div>換算枚数が10枚のため、下記の強化状態で補填</div><div>A ★5「ブレイジング・クラウン」 Lv.1 上限解放段階：4、所持数追加：2</div><div>1つ目のアビリティ：スキルダメージ＋20％</div><div>B ★4「鍛冶屋三姉妹の絆」 Lv.1 上限解放段階：4、所持数追加：2</div><div>1つ目のアビリティ：プロテクトリンク・攻＋5％</div><hr><div><strong>例）所持していた竜輝の護符が「ブレイジング・クラウン」 Lv.1、上限解放段階4を5枚所持の場合</strong><br>※アビリティ数値は上限解放段階0の状態の数値です。<br>・補填元の竜輝の護符<br>★5「ブレイジング・クラウン」<br>1つ目のアビリティ：スキルダメージ＋20％<br>2つ目のアビリティ：プロテクトリンク・攻＋5％<br><br>・新仕様への移行後に補填された竜輝の護符<br>A ★5 「ブレイジング・クラウン」<br>1つ目のアビリティ：スキルダメージ＋20％<br>B ★4 「鍛冶屋三姉妹の絆」<br>1つ目のアビリティ：プロテクトリンク・攻＋5％<br><br>・手順4で集計した竜輝の護符の換算枚数<br>換算枚数：25枚<br><br>換算枚数が25枚のため、下記の強化状態で補填<br>A ★5「ブレイジング・クラウン\] Lv.1 上限解放段階：4、所持数追加：4<br>1つ目のアビリティ：スキルダメージ＋20％<br>B ★4「鍛冶屋三姉妹の絆」 Lv.1 上限解放段階：4、所持数追加：4<br>1つ目のアビリティ：プロテクトリンク・攻＋5％<br>残り5枚分を覚醒の雫で補填</div><hr><div><br><strong>■竜輝の護符「マナスポット」について</strong><br>「マナスポット」については新仕様の竜輝の護符での補填は行わず、全てルピと「祝福の聖水」にて補填します。<br><br><strong>■竜輝の護符「チョコレート・レッスン」について</strong><br>「チョコレート・レッスン」の最大上限解放時の効果を「開幕スキルゲージ＋100％」から「開幕スキルゲージ＋50％」に変更します。<br>上記変更に伴い、「チョコレート・レッスン」を所持しているプレイヤーには、同じ効果を持つ★4竜輝の護符「ならず者たちの宴」を補填しました。<br>なお、「ならず者たちの宴」は、「竜輝の護符交換所」内の★4のタブから交換できます。<br><br><strong>■上限解放アイテムについて</strong><br>Ver.2.0以前に、アプリ内のショップにて販売していた「竜輝の護符上限解放パック」などをご購入されて獲得した竜輝の護符の上限解放アイテムについては、使用していた場合に限り使用状況にあわせて対象アイテムを補填いたしました。<br>詳細は<a href="https://dragalialost.com/jp/news/detail/1572">【重要】＜※要ご確認＞仕様変更に伴う、販売アイテムの補填に関して</a>をご確認ください。<br>対象アイテム：夢想の聖鍵、想いの鍵<br><br>ショップにて販売していた商品を購入して獲得された以外の方法にて入手した、使用済みの竜輝の護符上限解放アイテムにつきましては、新仕様の竜輝の護符もしくは覚醒の雫に変換して補填しております。<br><br><strong>■竜輝の護符の所持枠について</strong><br>Ver.2.0以前に、「竜輝の護符所持枠＋5」や「所持枠拡張パック」を購入されている場合、無償ドラゴンダイヤ、もしくは竜輝晶にて補填しております。<br>詳細は<a href="https://dragalialost.com/jp/news/detail/1572">【重要】＜※要ご確認＞仕様変更に伴う、販売アイテムの補填に関して</a>をご確認ください。<br><br>各メインストーリーのクリア報酬にて獲得された竜輝の護符の所持枠につきましては、獲得状況に応じて、該当メインストーリーをクリアすると入手できる新たなアイテムにて補填いたしました。<br><br>今後とも『ドラガリアロスト』をよろしくお願いいたします。</div><div><br></div>,start_time:1601002800,update_time1600932904