article_id:1659,category_name:お知らせ,title_name:ラジオのお庭「ご意見ボックス」返答（9/27放送）,image_path:,message:<div>9月27日に、文化放送にて放送中のラジオ番組「内山夕実 朝井彩加のドラガリアロスト ラジオのお庭」でディレクターの岡田がアプリ内の「ご意見ボックス」に寄せられた皆様からのご意見に返答しました。</div><div>※8/1～8/31の期間にいただいたご意見からピックアップして回答しております。</div><div><br></div><div>本お知らせでは番組内のインタビュー内容と、皆様からのご意見などに対するディレクターの岡田からの返答をお知らせします。</div><div><br></div><div>※「ご意見ボックス」はアプリ内のタイトル画面よりご利用いただけます。</div><div>※番組内の内容を本お知らせ用に編集しておりますので、放送の際の表現と異なる箇所がございます。</div><div>※回答内容は放送時点のものであり、開発中の内容は実際の仕様とは異なる場合がございます。</div><div><br></div><hr><div>■「ご意見ボックス」への回答</div><div>―Ver.2.0のアップデートにて、今までいただいた多くのご意見にお応えできるような変更が入ったとのことなので、そのあたりを中心に取り上げていきます。</div><div><br></div><div>―まず、今回削除となった教官ボーナスについてはいかがでしょうか。</div><div>岡田：教官ボーナスに関しては以前より多くのご意見を賜りましたが、今回のアップデートで行った、一部クエストのソロプレイとマルチプレイを完全に別のクエストにして、報酬も分ける対応に伴い削除させていただきました。</div><div>ソロプレイとマルチプレイにて、ドロップするアイテムの種類は同じです。</div><div>ソロプレイでは今までの量の報酬を獲得でき、敵のバランスを調整しています。</div><div>マルチプレイで獲得できる報酬の量は、（ソロプレイと比較して）少し多いです。</div><div>本対応によってマルチでプレイするプレイヤーが少し減ってしまう可能性があり、教官ボーナスを獲得しにくくなるため、その分しっかりソロプレイができるように調整した上で、申し訳ないのですが今回教官ボーナスを削除しました。</div><div><br></div><div>最初からプレイされる方や、「真ドラゴンの試練」「アギト叛逆戦」をまだ攻略できていない方は、是非とも今回調整したソロプレイで挑戦していただければと思います。</div><div>もちろん、マルチプレイで他のプレイヤーや同盟メンバー達と一緒に、協力して戦っても攻略できるようになっています。</div><div><br></div><div>─今回追加された機能ではありますが、「いつも楽しくプレイしております。意見というか要望なのですが、召喚でピックアップされているキャラを必ず手に入れることができる機能をぜひ追加してほしいです。」というご意見がありました。</div><div>岡田：こちらについても多くのご意見をいただき、今回のアップデートで召喚を1回行うごとに「竜輝の印」というアイテムが手に入り、一定数集めるとその召喚で提供される特定のキャラ・ドラゴンの中から1つ選択して交換できる機能を追加しました。</div><div>なお、「竜輝の印」は、該当の召喚が終了すると「竜輝の証」というアイテムに変わり、ゲーム内で手に入る様々な素材アイテムと交換できます。</div><div><br></div><div>─「キャラとドラゴンのモーションや演出を眺めたり、攻撃やスキルを試したりできる練習場のようなものがほしいです。岡田さんどうかお願いします。」とのことです。</div><div>岡田：キャラやドラゴンが増えて、スキルやアビリティなども複雑化しており、色々と試行錯誤したいという方もいらっしゃると思います。</div><div>こちらも、少しずつ検討していければと考えております。</div><div><br></div><hr><div>引き続き「ご意見ボックス」へ寄せられた皆様からのご意見にディレクター岡田より回答する予定です。</div><div>皆様からのご意見をお待ちしております。</div><div>※次回の放送では9/1～9/30の期間にいただいたご意見からピックアップ予定です。</div><div><br></div><div>今後とも『ドラガリアロスト』をよろしくお願いいたします。</div>,start_time:1601618400,update_time1601536767