article_id:1800,category_name:お知らせ,title_name:今月の『ドラガリアロスト』,image_path:,message:<div>『ドラガリアロスト』ディレクターの岡田です。</div><div>いつも『ドラガリアロスト』をプレイしていただき誠にありがとうございます。</div><div><br></div><div>レイドイベント「プリンセスコネクト！Re:Dive新しい友だちと異世界ごはん」が開催中です。</div><div>「ペコリーヌ」と聖城のメンバーによるオリジナルストーリーをぜひ楽しんでいただければと思います。</div><div><br></div><div>今回、イベントの開催に合わせて書き下ろした新曲を「M・A・O」さんに歌っていただきましたので、そちらも聴いてみてください。</div><div>新曲はストーリー中に流れ、バトル中はそのギターアレンジ版を聴くことができます。</div><div><br></div><div>また、イベントに登場するキャラ「ペコリーヌ」「ミツバ（野食殿Ver.）」、ドラゴン「ルミエールパンドラ」がピックアップされているプライズレジェンド召喚を現在開催中です。</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/9d941d74d695d2183573e6ecf3a05fcd.png"></div><div><br></div><div>今回『プリンセスコネクト！Re:Dive』からは1キャラのみの登場ですが、その分「ペコリーヌ」のモーションや演出は原作を再現できるように作りこみました。</div><div>ゲーム中で、剣を片手ではなく両手で持つようにしたり、スキルは原作の動きを再現したりしつつも、アクションゲームとして手触りの良さを崩さないように注意しました。</div><div>スキル発動時のカットインは原作おなじみのアニメ―ションをいれています。</div><div>また、バトル中にも食べるしぐさをしますが、パーティ編成にてキャラを入れ替える際に上から降りてくる時は、おにぎりを食べていたりするのでぜひチェックしてみてください。</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/7260b6981505de70d57ba82d2e96e10a.png"></div><div>なお、キャラ「ペコリーヌ」は期間限定ではなく、今後のレジェンド召喚からも登場します。</div><div><br></div><div>■今月の予定について</div><div>・<span class="local_date" data-local_date="1607319600"></span>にキャラ「セレナ」「ユーヤ」のマナサークル第6層追加を予定しています。</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/17163554017d4d9e72852695a86d5d53.png"></div><div><br></div><div>・12月中旬より、星竜祭をテーマにした迎撃戦イベントを開催します。</div><div>また、それと同時期に新しい「星竜祭Ver.」のキャラがピックアップされる召喚も開催予定です。</div><div>女性キャラと男性キャラが1人ずつ登場します。</div><div>なお、昨年までの「星竜祭Ver.」のキャラが登場する召喚は、上記新規キャラ2人がピックアップされる召喚の後に開催予定です。</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/40816b4550ce76536918cf750f41eadb.png"></div><div><br></div><div>・12月中旬以降に、施設イベント「食宴！アミューズキュイジーヌ」を復刻いたします。</div><div>本イベントで入手できる施設のLvを上げることで、刀とロッドを持つキャラのパラメータを強化することができます。</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/18f697df78b9a3f3d53a597519d20e5a.png"></div><div><br></div><div>・メインストーリー第17章も12月中旬以降に追加予定です。</div><div>北グラスティア大陸で最初に向かう先は聖都グラムスという場所です。</div><div>新キャラも多数登場する章となりますのでお楽しみに。</div><div><br></div><div>・12月末には、イベント「タイムアタックチャレンジ」を開催します。</div><div>昨年よりも対象となるクエストの難易度の幅を広げ、ランキングは一部の高難易度クエストのみを対象とし、報酬も調整します。</div><div><br></div><div>対象のソロクエストを制限時間内にクリアすると、報酬を獲得することができます。</div><div>対象クエストは、「ディアネル帝国迎撃戦」、「ヴォイド討伐戦」、「真ドラゴンの試練」の中級、「アギト叛逆戦」の中級です。</div><div><br></div><div>ランキングはソロプレイとマルチプレイで分けて集計します。</div><div>ソロプレイは「アギト叛逆戦」の中級、マルチプレイは「アギト叛逆戦」の上級を対象として毎日ランキングを更新し、パーティ情報などが確認できるようにします。</div><div>ランキングで上位に入ったプレイヤーは、特別なアイテムなどは獲得できませんが、イベント限定の二つ名を獲得することができます。</div><div><br></div><div>■今後のアップデートについて<br>・年末に「アルべリアバトルロイヤル」のアップデートを予定しています。<br>マップ上のギミックを追加し、すでに仲間にしているキャラや、獲得済みの武器のスキンを「アルべリアバトルロイヤル」のスキンとして使用することが可能になります。<br>なお、すでに仲間にしているキャラのスキンは専用のアイテムを消費して入手できるほか、交換所から交換することで入手できますが、一部キャラは対象外です。<br>プレイ感も変わるかと思いますので、アップデート後もぜひ遊んでいただければ幸いです。<br><br>・新しい高難易度クエストについて<br>「アギト叛逆戦」に続く新しい高難易度クエストは、来年の公開を目指して現在制作中です。<br>登場するボスのデザインを1点先行公開いたします。<br><img src="https://dragalialost.akamaized.net/attached/information/images/cf8f5fb7a5c3f2fffa9ab57a11edfaf7.png"></div><div>・「アギト叛逆戦 絶級」について<br>次の絶級クエストは2021年1月下旬の追加を予定しております。<br>対象のボスなどの詳細については、後日お知らせやSNSで告知してまいります。<br><br>・年末年始について<br>昨年末に「ナームちゃんねる」を配信しましたが、今年は行いません。<br>しかしながら、昨年同様、「七福の便り」やログインボーナスなどさまざまなキャンペーンを予定しておりますので、そちらは追ってお知らせやSNSにて告知いたします。<br><br>また、今年の年末も「ヒノモト」を題材にしたイベントを開催します。<br>今回はこれまでに開催した2回のイベントと雰囲気が少し異なり、「十二竜氏」の敵となるような存在が見えてくるストーリーです。<br><br>なお、「ナームちゃんねる」とは別の発表を1月上旬に予定しておりますので、こちらは年が明けましたらあらためて告知いたします。<br><br>■最後に<br>今年の「今月の『ドラガリアロスト』」はこれで最後です。<br>今年も『ドラガリアロスト』をプレイしていただきありがとうございます。<br>くれぐれも体調に気を付けながら、ゆっくりと年末年始を過ごしていただければ幸いです。<br><br>今月は下記のアイテムをプレゼントいたします。<br>・10回召喚チケット 1枚<br><br>次回の「今月の『ドラガリアロスト』」は、<span class="local_date" data-local_date="1609480800"></span>に掲載予定です。<br><br>『ドラガリアロスト』<br>ディレクター 岡田佑次<br><br>※お贈りしたアイテムの受け取り期限は、「プレゼント」にアイテムが贈られてから7日間です。<br>※召喚やイベント、ゲームの調整内容などの予定は、予告なく変更する場合があります。<br>※掲載されているキャラやゲーム画面は開発中のものです。<br><br><br></div>,start_time:1606802400,update_time1606730943