article_id:1838,category_name:お知らせ,title_name:ラジオのお庭「ご意見ボックス」返答（11/29放送）,image_path:,message:<div>11月29日に、文化放送にて放送中のラジオ番組「内山夕実 朝井彩加のドラガリアロスト ラジオのお庭」でディレクターの岡田がアプリ内の「ご意見ボックス」に寄せられた皆様からのご意見に返答しました。</div><div>※10/1～10/31の期間にいただいたご意見からピックアップして回答しております。</div><div><br></div><div>本お知らせでは番組内のインタビュー内容と、皆様からのご意見などに対するディレクターの岡田からの返答をお知らせします。</div><div><br></div><div>※「ご意見ボックス」はアプリ内のタイトル画面よりご利用いただけます。</div><div>※番組内の内容を本お知らせ用に編集しておりますので、放送の際の表現と異なる箇所がございます。</div><div>※回答内容は放送時点のものであり、開発中の内容は実際の仕様とは異なる場合がございます。</div><div><br></div><hr><div>■「ご意見ボックス」への回答</div><div><br></div><div>【竜輝の印に関して】</div><div>─「楽しいゲームの提供ありがとうございます。以前のアップデートで召喚に天井ができて凄くありがたいのですが、ハロウィンや年末年始イベントなどの期間限定の★4キャラも「竜輝の印交換」の対象にしてほしいです。ご検討よろしくお願いいたします。」とのご意見が来ています。</div><div><br></div><div>岡田：「竜輝の印交換」というのは、召喚で手に入る「竜輝の印」を一定数消費すると対象のキャラやドラゴンと交換できるシステムですが、10月のハロウィンイベントに合わせて開催した「ドラガリアフェス　エクストラ」にて、過去のハロウィン召喚で登場した期間限定★4キャラが「竜輝の印交換」の対象に入っていない、というご意見を多数いただきました。</div><div>先日まで開催していたレジェンド召喚「新春にゃあちゅう大合戦 ピックアップ」に関しましては、期間限定★4キャラも交換対象に入れました。</div><div>今後も期間限定キャラの復刻や、過去のキャラがピックアップされる召喚では、★4キャラも交換対象にしていきたいと思っています。</div><div><br></div><div>【キャンペーン関して】</div><div>─「『真ドラゴンの試練』と『アギト叛逆戦』のドロップ2倍キャンペーンありがとうございます。報酬の多いクエストを絞ってもらえると、そのクエストにプレイヤーが集まって遊びやすいので、2周年終了後も『真ドラゴンの試練』と『アギト叛逆戦』のいずれかのクエストのドロップ2倍キャンペーンを頻繁に開催していただけると嬉しいです。」とのことです。</div><div><br></div><div>岡田：こちらのキャンペーンは好評をいただきました。</div><div>2周年のアップデートで武器の強化に必要な素材の数などが変わっていますので、「ヴォイド討伐戦」「真ドラゴンの試練」「アギト叛逆戦」に関しては、定期的にドロップアップキャンペーンを開催していきたいと考えています。</div><div><br></div><div>【クエスト中のおまかせ機能に関して】</div><div>─「おまかせの追加機能として、竜化ゲージが貯まったら自動的に竜化する機能を実装していただきたいです。エンハンスゲージを持つキャラや、竜化に重きを置くキャラはおまかせ使用時に実力を発揮しきれません。色々なキャラが広く活躍できるのが『ドラガリアロスト』の良い所だと思っていますので、ぜひ実装よろしくお願いいたします。」とのご意見をいただきました。</div><div><br></div><div>岡田：現在、おまかせにて自動で竜化するかどうかをON/OFFで選択できる機能の実装に向けて準備しています。</div><div>例えば、竜化せずにクリアできるのであれば、おまかせで竜化をOFFにして竜化しない方が早くクリアできる場合があると思います。</div><div>また、竜化した方が安定してクリアできるクエストなら、おまかせで竜化をONにするといった使い分けができるように制作を進めています。</div><div><br></div><div>【バランスに関して】</div><div>─「高難易度クエストのマルチプレイだと、高火力を出せる特定のキャラの募集ばかりで、自分の好きなキャラで参加できるルームがあまりありません。せっかく新しいキャラを獲得しても使えないです。他のキャラも活躍できるようにしてほしいです。」とのご意見です。</div><div><br></div><div>岡田：こちらは難しいところなのですが、ご意見いただいた状況は運営チームでも認識しています。</div><div>一部のキャラはかなり大きなダメージを与えることができて、マルチプレイではしっかりとした連携が求められ、動き方を把握しているプレイヤー同士でないとクリアが厳しいものの、短い時間でクエストクリアが可能です。</div><div>その条件にてマッチングの需要が高まると、他のキャラで参加しようとした際にルームへの参加が難しくなるということが起きています。</div><div>少しお時間をいただくかもしれませんが、様々なキャラが活躍できる場を用意していければと思っています。</div><div><br></div><hr><div>引き続き「ご意見ボックス」へ寄せられた皆様からのご意見にディレクター岡田より回答する予定です。</div><div>皆様からのご意見をお待ちしております。</div><div>※次回の放送では11/1～11/30の期間にいただいたご意見からピックアップ予定です。</div><div><br></div><div>今後とも『ドラガリアロスト』をよろしくお願いいたします。</div>,start_time:1607666400,update_time1607496558