article_id:1895,category_name:お知らせ,title_name:今月の『ドラガリアロスト』,image_path:,message:<div>『ドラガリアロスト』ディレクターの岡田です。</div><div>いつも『ドラガリアロスト』をプレイしていただき誠にありがとうございます。</div><div><br></div><div>明けましておめでとうございます 。</div><div>昨年は全世界において、環境の変化が激しい1年だったと思います。</div><div>『ドラガリアロスト』の開発チームの環境も大きく変わりましたが健康に気を配りつつ、アップデートの開発に取り組んでいるところです。</div><div>プレイヤーの皆様におかれましても、どうか体調に気をつけてお過ごしください。</div><div><br></div><div>現在、レイドイベント「新春陰陽役」が開催中です。</div><div>クエストを進め、親密度をあげることによってキャラ「クズハ」を仲間にすることができます。</div><div>昨年や一昨年と違い今回は少しシリアスなヒノモトイベントです。</div><div>イベントで登場する「骸衆」は今後のイベントでも登場するかもしれません。</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/a1e26e3422d3a8d3fa26d168cf8c4ad4.png"></div><div><br></div><div>また、十二竜氏の1人であるキャラ「セイメイ」や、ドラゴン「ゴズテンノウ」が登場するレジェンド召喚「新春陰陽役 ピックアップ Part1」を開催中です。</div><div>「セイメイ」は一見愛想がないキャラに見えますが、とても仲間想いの熱い心を持っており、イベントストーリーではそんな彼の一面を見ることができます。</div><div>「セイメイ」と行動を共にする「ゴズテンノウ」との関係性にも注目していただければと思います。</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/a5ee1ad7dd9dd0baa9beee463790b223.png"></div><div><br></div><div>1日1回無料「10回召喚」も開催中です。</div><div>ログインボーナス、七福の便りの抽選結果など、年の初めはお得なキャンペーンがたくさんありますので、欠かさずログインしていただければ幸いです。</div><div>今回は後日開催予定の「新春陰陽役 ピックアップ Part2」にも1日1回無料「10回召喚」を3日間実施します。</div><div><br></div><div>レジェンド召喚「新春陰陽役 ピックアップ Part2」では、もう1人の十二竜氏であるキャラ「ヨシツネ」が登場します。</div><div>属性や武器種に関しては、ゲーム内や公式サイトのお知らせ、SNSをご確認ください。</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/17998adaa892860e35c14b2211b29e0f.png"></div><div><br></div><div>■今月の予定に関して</div><div>・レイドイベント「新春陰陽役」後は、闘技場イベントの開催を予定しております。</div><div>イベントのスタイルとしては迎撃戦や防衛戦を踏襲していますが、ヒノモトのキャラ達と腕試しをする闘技場クエストに挑戦できます。</div><div>ヒノモトのキャラ達のストーリーが展開されますので、 こちらも楽しみにしていてください。</div><div><br></div><div>・1月中旬に、高難易度クエスト「モルトメサイア大討滅戦」を追加します。</div><div>このクエストでは、属性強化施設や武器強化施設をさらに強化する素材や、ドラゴンに「プラス値」を付与するアイテムを獲得することができます。</div><div>挑戦するためにはメモリーイベント「ロストヒストリア～失われし真実～」のエピローグを読了する必要があり、必要戦力はかなり高めのクエストです。</div><div>ゲームプレイの難易度としては「アギト叛逆戦」の絶級ほどではなく、パーティ編成に属性などの指定はありません。</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/7c4c0d5f6309fb829e492c88e31af211.png"></div><div><br></div><div>・メインストーリー17章に新たなストーリーを追加する予定です。</div><div><br></div><div>・1月下旬に、レイドイベント「咎人は巡る、竜眼の軌跡」を復刻します。</div><div>キャラ「アデルペイン」を仲間にすることができますので、未プレイの方はぜひこの機会にプレイしてみてください。</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/726e464baa60ce31afffaabdced53589.png"></div><div><br></div><div>・また、1月下旬に、施設イベント「コール・オブ・ビブリア」のメモリーイベント化も予定しております。</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/1792b05f4a9e1eb6d6e1c2c9af4e4279.png"></div><div><br></div><div>・さらに、アギト叛逆戦「ガイエン叛逆戦」に「絶級」を追加します。</div><div>「ルヴ・トシュカトル叛逆戦」の「絶級」と同様に、かなりの難易度を誇るクエストとなりますので、ぜひ腕試しに挑戦してください。</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/afd63a8ee14cf27251d57a29784ccfc4.png"></div><div><br></div><div>■今後のアップデートに関して<br>・先月お伝えした通り、1月上旬に新しいイベントの発表をライブ配信で実施しますので、楽しみにお待ちください。<br><br>・メインストーリーの更新に関してお知らせします。<br>今年も定期的にメインストーリーを配信する予定ですが、18章からは1ヶ月ごとに1章を前編と後編に分けて更新していきます。<br>そのため、18章前半を2月中に、18章後半を3月中に配信し、19章以降も同じペースで配信する予定です。<br>未開の北の大地を踏破しながら&hellip;&hellip;徐々に、主人公の核心へと迫っていくストーリーになっていきます。<br><br>・アギト叛逆戦に続くボスに関しては、3月頃の追加を予定しております。<br>新しいギミックも用意していますのでお楽しみに。<br><br>・少し先の話になりますが、半年ごとに節目として行っている「ナームちゃんねる」の配信を今年も予定しております。<br>次は3月下旬ごろで、その際は特別なイベントの発表を予定しています。<br>メインストーリーや、メモリーイベント「クロノス～廻る運命の針～」「ロストヒストリア～失われし真実～」をプレイしていただけると、よりイベントを楽しめると思います。<br><br>■最後に<br>今年も『ドラガリアロスト』をよろしくお願いいたします。<br>皆様に楽しんでいただけるよう、引き続き開発に取り組んでまいります。<br><br>今月は下記のアイテムをプレゼントいたします。<br>・金剛原石&times;3<br>・ダマスカス骸晶&times;3<br>・最高級はちみつ&times;30<br>・ルピ&times;10,000,000<br><br>次回の「今月の『ドラガリアロスト』」は、<span class="local_date" data-local_date="1612159200"></span>に掲載予定です。<br><br>『ドラガリアロスト』<br>ディレクター 岡田佑次<br><br>※お贈りしたアイテムの受け取り期限は、「プレゼント」にアイテムが贈られてから7日間です。<br>※召喚やイベント、ゲームの調整内容などの予定は、予告なく変更する場合があります。<br>※掲載されているキャラやゲーム画面は開発中のものです。</div>,start_time:1609480800,update_time1609138757