article_id:2027,category_name:お知らせ,title_name:ラジオのお庭「ご意見ボックス」返答（2/21放送）,image_path:,message:<div>2月21日に、文化放送にて放送中のラジオ番組「内山夕実 朝井彩加のドラガリアロスト ラジオのお庭」でディレクターの岡田がアプリ内の「ご意見ボックス」に寄せられた皆様からのご意見に返答しました。</div><div>※1/1～1/31の期間にいただいたご意見からピックアップして回答しております。</div><div><br></div><div>本お知らせでは番組内のインタビュー内容と、皆様からのご意見などに対するディレクターの岡田からの返答をお知らせします。</div><div><br></div><div>※「ご意見ボックス」はアプリ内のタイトル画面よりご利用いただけます。</div><div>※番組内の内容を本お知らせ用に編集しておりますので、放送の際の表現と異なる箇所がございます。</div><div>※回答内容は放送時点のものであり、開発中の内容は実際の仕様とは異なる場合がございます。</div><div><br></div><hr><div>■2月5日に放送したYouTube Liveの「教えてドララジ先生！出張版」にて紹介できなかった質問への回答</div><div><br></div><div>──「各イベントの内容にはメインストーリーだけでは説明しきれていないような、『ドラガリアロスト』の世界観の細かい部分を補完する意味合いがあるような気がしているのですが、考えすぎでしょうか？」</div><div><br></div><div>岡田：メインストーリーだけでは『ドラガリアロスト』の全体的な世界についてあまり語りきれない部分も多いので、例えばヒノモトなどイベントでしか語っていない地域や種族が存在します。</div><div>北グラスティア大陸についてはさらにずっと北の方に軍隊がいて、そこでの活動を紹介することでメインストーリーの根幹部分にどこかで触れていたり、その設定がメインストーリーのどこかに活きていたり、またイベントで出てきたキャラがメインストーリーに出てくるなどの展開も見据えてイベントを作成しております。</div><div>しかし、イベントであまりにも世界観の細かい部分を紐解くと、メインストーリーの定義が曖昧になってしまうので、そこは温度感を調整しながら考えております。</div><div>ただし、1周年と2周年で開催した「クロノス〜廻る運命の針〜」や「ロストヒストリア～失われし真実～」というレイドイベントは、メインストーリーの根幹にしっかり触れるようなイベントのため、メモリーイベントとしてプレイできるようにしております。</div><div><br></div><div>──「犬の実装はまだですか？」</div><div><br></div><div>岡田：昨年の4月1日に1日限定で公開した「聖城ワンダフルデイ！」というクエストに犬が出てきて、そのクエストで犬と散歩しつつ、カメラをぐるぐる回してキャラを見渡せるような撮影機能がついておりました。</div><div>こちらはもしかしたらなんらかの形で登場するかもしれません。</div><div><br></div><div><br></div><div>■「ご意見ボックス」への回答</div><div><br></div><div>【ロストヒストリア〜モルトメサイア大討滅戦〜に関して】</div><div>──「いつも運営お疲れ様です。新しく実装された『ロストヒストリア〜モルトメサイア大討滅戦〜』ですが、報酬が大幅な育成強化に関わるアイテムであるにも関わらず『アギト叛逆戦 絶級』と同じくらいの難易度に感じています。今回追加されたアイテムは強化に必要なものなので『ロストヒストリア〜モルトメサイア大討滅戦〜』をクリアできないカジュアルプレイヤーとしては辛いです。他のクエストでも獲得できるように検討していただきたいです。」</div><div><br></div><div>岡田：必要戦力が40000とかなり高く、戦力を強化していただいた皆さんに向けたクエストでしたが、追加されたアイテムは今後ほかのクエストでも獲得できるようにしていこうと考えております。</div><div><br></div><div>【アルベリアバトルロイヤルに関して】</div><div>──「『アルベリアバトルロイヤル』専用スキルについて。専用スキルを持った「セイメイ」と、その他の通常スキン2人の三つ巴になると分かっている人だと、「セイメイ」狙いの連帯が起きる場合があります。1人だけ強いキャラがいるというのは案外メリハリにはなるとは思いました。この先強い専用スキルを持ったキャラが増えれば、通常スキンを選ぶ自由はある意味制限され、武器種間バランスへの意見も意味が薄くなると思います。専用スキルは期間限定なのかなど不明なことも含め、この先の方向性を教えていただきたいです。」</div><div><br></div><div>岡田：3人それぞれの思惑が誰を優先して倒そうかという時に、2人の意識が一致した展開だと思います。</div><div>今回の「セイメイ」のように専用スキルを持つキャラは頻繁に追加しないようにしており、専用スキルが強くなりすぎないように調整しています。</div><div>また、日々どの武器種の勝率が良いかなどを見て、毎月どの武器種を調整するか検討しております。</div><div>色々な専用スキルが登場すると思いますが、バランスもしっかり見ていきますので、楽しんでいただけますと幸いです。</div><div><br></div><div>【キャンペーンに関して】</div><div>──「いつも楽しく『ドラガリアロスト』をプレイさせていただいております！キャンペーンについての提案です。「遺跡の試練」「ドラゴンの試練」「ディアネル帝国迎撃戦」などのキャラ育成ドロップ2倍キャンペーンを3倍に増加する、「オリハルコン」獲得の交換所やイベントを開催することについて、ゲーム開始直後に不足しがちなアイテムですので、特別な期間、限定的な開催で構いませんのでご検討よろしくお願いいたします。」</div><div><br></div><div>岡田：貴重なご意見ありがとうございます。</div><div>ドロップ3倍のキャンペーンに関しては、節目のタイミングなどで開催していきたいです。</div><div>現在の日替わりでのドロップ2倍キャンペーンのクエストもプレイしていただければと思います。</div><div>また、「オリハルコン」など一部のアイテムに関しては、最初は希少かつ難易度で限定されたアイテムですが、交換所やイベントの報酬に入れるなど獲得手段を調整していきたいと考えております。</div><div><br></div><hr><div>引き続き「ご意見ボックス」へ寄せられた皆様からのご意見にディレクター岡田より回答する予定です。</div><div>皆様からのご意見をお待ちしております。</div><div>※次回の放送では2/1～2/28の期間にいただいたご意見からピックアップ予定です。</div><div><br></div><div>今後とも『ドラガリアロスト』をよろしくお願いいたします。</div>,start_time:1614837600,update_time1614823402