article_id:2108,category_name:お知らせ,title_name:今月の『ドラガリアロスト』,image_path:,message:<div>『ドラガリアロスト』ディレクターの岡田です。</div><div><br></div><div>いつも『ドラガリアロスト』をプレイしていただき誠にありがとうございます。</div><div>おかげさまで『ドラガリアロスト』は、リリースしてから2.5周年を迎えることができました。</div><div><br></div><div>■レイドイベント「ドラガリア・デイブレイク」に関して</div><div>2.5周年ということで、現在レイドイベント「ドラガリア・デイブレイク」が開催中です。</div><div>イベントをプレイすることでキャラ「幻身ミドガルズオルム」を仲間にできます。</div><div>これまで1周年、2周年とメインストーリーにも関わるイベントを開催してきました。</div><div>2.5周年もせっかくなので記念となるイベントを組んでみてはどうかということで、300年前の「アルベリウス」が主人公のストーリーです。</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/58900128e09b7c01a3430efe58d12f3f.png"></div><div><br></div><div>また、現在キャラ「ナーム（ドラフェスVer.）」とキャラ「ムムジアンヌ」が登場する「ドラガリアフェス」が開催中です。</div><div>ついに「ナーム」がプレイアブルキャラとして登場しました。</div><div>キャラ「ナーム（ドラフェスVer.）」は、特殊な竜化ゲージを溜めることで「羽化の姿」になることが可能です。</div><div>小さい「ナーム」でも、羽化した大きな姿の「ナーム」でも、両方の姿で戦うことができるキャラです。</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/cbcc594069991e12c2e6755778b8d306.png"></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/d17c4a0f8e0943e8049a91bd99d1f75a.png"></div><div><br></div><div>■イベント「聖城ワンダフルデイ！」に関して</div><div><span class="local_date" data-local_date="1617256800"></span>から、イベント「聖城ワンダフルデイ！」が再び開催中です。</div><div>今回は1日限定ではなく、常設という形で開催しています。</div><div>子犬と一緒にキャラ4体、ドラゴン4体まで連れていくことができ、自分好みのキャラやドラゴンをマップ上に配置することができます。</div><div><br></div><div>フォトモードでは、「ぼかし機能」を新しく追加しました。</div><div>カメラのピンボケのような状態を再現できる機能で、スライドバーを移動させると背景やキャラをぼかすことができます。</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/1e81dabaff64e1abe6d8fc2e414de218.png"></div><div>『ドラガリアロスト』の3Dモデルをいろんな形で配置したり眺めたりするコンテンツはこれまでありませんでしたので、うまく調整してベストな角度でスクリーンショットを撮っていただければ幸いです。</div><div>公式Twitterにてキャンペーンを開催しておりますので、詳細は公式Twitterやゲーム内のお知らせをご確認ください。</div><div><br></div><div>■今月の予定</div><div>・<span class="local_date" data-local_date="1617343200"></span>から、「プライズレジェンド召喚」にてキャラ「アルベリウス」と、ドラゴン「真プルートー」が登場します。</div><div>詳細なパラメータはレジェンド召喚のお知らせでご確認ください。</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/8d2f192f5fca59ecfd1e7d0929b6c1bd.png"></div><div><br></div><div>・<span class="local_date" data-local_date="1617775200"></span>から新コンテンツ「強者の試練」を開催します。</div><div>指定された属性・武器種のパーティで挑戦するクエストです。</div><div>クリアするとデイリーボーナスで特定のキャラのマナサークル第6層解放に必要なアイテムや、大地の恵み、生命の竜鱗などが獲得できます。</div><div><br></div><div>このコンテンツのデイリーボーナスは3つまでストックすることができます。</div><div>当日に獲得を逃しても、翌日以降にプレイすることで獲得することができます。</div><div><br></div><div>なお、デイリーボーナスはその日に開催されているボスの報酬となりますのでご注意ください。</div><div>ボスは今後も追加していきますが、一度出現したボスも定期的に開催していきます。</div><div>4月はドラガリアフェス限定キャラのマナサークル第6層解放に必要なアイテムが獲得できますが、ドラガリアフェス限定以外のキャラも獲得できるように追加していく予定です。</div><div><br></div><div>・<span class="local_date" data-local_date="1618207200"></span>からは迎撃戦イベントが開催します。</div><div>今回はなんと学園が舞台ですが、このキャラは&hellip;&hellip;？</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/e6e6bc779230f1f4f21092e53a6c2ed8.png"></div><div><br></div><div>・4月下旬には闇属性の敵を対象とした「タイムアタックチャレンジ」を開催します。</div><div><br></div><div>・4月下旬にはメインストーリー19章前半を公開します。</div><div>妖精国に入り、19章は前半と後半で主人公の謎が明かされていきます。</div><div><br></div><div>・「ナームちゃんねる」でも告知させていただきましたが、4月末より「ヴァンピィ」が登場するイベントが開催する予定です。</div><div>「ヴァンピィ」以外にも神撃のバハムートからキャラ1体、ドラゴン1体が登場予定です。</div><div><img src="https://dragalialost.akamaized.net/attached/information/images/4e36f9f18c0a545d6153be78b320c3b3.png"></div><div><br>■今後のアップデートに関して<br>「ナームちゃんねる」で今後予定しているアップデート項目について触れさせていただきましたが、改めて説明させていただきます。<br><br>・マナサークルの第5層まで一気に「おまかせ」で解放できる機能と、さらに指定したピースまで解放できる機能を追加します。<br>これまでは各層ごとに「おまかせ」で解放し、そのたびに手動で次の層へのピースを解放する必要や、特定のピースまで解放したい場合は1つ1つ解放する必要がありました。<br>育成するキャラもどんどん増えておりますので、より快適に育成できるよう、今後のアップデートでもマナサークルの解放機能を強化していきます。<br><br>・施設の一覧からレベルアップ<br>現在、「聖城」の「建設」にて、レベルアップできる施設を探さなくても一覧からタップのみでレベルアップできる機能の実装を予定しております。<br>施設の数も増えており、配置した中から探すことが大変になってきたのでわかりやすい形でレベルアップできるようにしていきます。<br><br>・チャレンジクエストの一部クエストで他プレイヤーのクリアパーティを確認できるようにします。<br>真ドラゴンの試練やアギト叛逆戦などで他プレイヤーがどのようなパーティでクリアしているかを参照できるようになります。<br>キャラ、ドラゴン、竜輝の護符が参照でき、なるべく多くのクリアパーティが確認できるように開発中です。<br><br>・「ナームダイアリー」機能追加<br>「ナームダイアリー」は今後も機能を強化していきます。<br>予定としては、各キャラが高難易度のクエストをクリアした時に勲章をもらえるようにしたりストーリーを振り返れる機能の追加などを予定しております。<br><br>・メインストーリー<br>引き続きメインストーリーは21章までは1ヶ月に一回のペースで前半と後半にわけて配信していく予定です。<br>主人公の謎が明かされ、舞台は妖精の国へと移っていきます。<br>新たなキャラも登場していきますので、楽しみにお待ちください。<br><br>・「FIRE EMBLEM HEROES」イベントに関して<br>以前開催していたイベント「FIRE EMBLEM つながる世界」、「FIRE EMBLEM 新たなる扉」をソロでもプレイできるようにしてメモリーイベントとしていつでもプレイできるようにします。<br>過去にイベントをプレイされたことがない方はこの機会にぜひキャラ「アルフォンス」とキャラ「シャロン」を仲間にしていただけますと幸いです。<br>召喚の情報に関しては、お知らせをもってご連絡させていただきますのでもう少々お待ちください。<br><br>■最後に<br>・最後まで読んでいただきありがとうございます。<br>また、改めてリリースから2周年と半年間プレイしていただきありがとうございます。<br>引き続きさまざまなコンテンツや皆様が遊びやすくなるようなアップデートを提供していきますので、今後とも『ドラガリアロスト』をよろしくお願いいたします。<br><br>今月は下記のアイテムをプレゼントいたします。<br>・覚醒の雫&times;25,000<br>・英雄の証&times;2<br><br>次回の「今月の『ドラガリアロスト』」は、<span class="local_date" data-local_date="1619848800"></span>に掲載予定です。<br><br>『ドラガリアロスト』<br>ディレクター 岡田佑次<br><br>※お贈りしたアイテムの受け取り期限は、「プレゼント」にアイテムが贈られてから7日間です。<br>※召喚やイベント、ゲームの調整内容などの予定は、予告なく変更する場合があります。<br>※掲載されているキャラやゲーム画面は開発中のものです。<br><br></div>,start_time:1617256800,update_time1617187103