article_id:2264,category_name:アップデート,title_name:アップデートのお知らせ【更新】,image_path:,message:<div><span style="color: rgb(41, 105, 176);"><strong>【<span class="local_date" data-local_date="1623639600"></span>追記】</strong></span><br><span class="local_date" data-local_date="1623639600"></span>までにゲームを開始されたプレイヤーの皆様に、下記のアイテムをお贈りいたしました。<br>&nbsp;<br>・10回召喚チケット 1枚<br><br>10回召喚チケットの受け取り期限は、「プレゼント」に10回召喚チケットが贈られてから7日間です。<br><br>今後とも『ドラガリアロスト』をよろしくお願いいたします。</div><hr><div><span class="local_date" data-local_date="1623294000"></span>ごろに、下記不具合修正のため、Ver.2.8.1を公開しました。</div><div>また、強制アップデートを、<span class="local_date" data-local_date="1623639600"></span>ごろに実施する予定です。</div><div>&nbsp;</div><div>今回アップデートをしていただいたプレイヤーの皆様に、感謝の気持ちとして、10回召喚チケットをプレゼントいたします。</div><div>10回召喚チケットは、強制アップデート後にお贈りする予定です。</div><div>お贈りしましたら、本お知らせに追記いたします。</div><div>※強制アップデート前に、Ver.2.8.1へのアップデートが完了しても、10回召喚チケットは贈られません。</div><div><br></div><div>■修正した不具合</div><div>・「EXアビリティ」のいずれかのマナピースをすでに解放済みの状況で「おまかせ解放」を行う際、おまかせ解放の確認画面に記載された覚醒の雫の消費量が、実際に消費される覚醒の雫の消費量より少なく表示されてしまう場合がある。</div><div>・「EXアビリティ」のマナピースを指定して「まとめて解放」を行う際、選択した「EXアビリティ」のマナピースの位置によって、マナピースをタップした直後の必要素材の画面に記載された覚醒の雫の消費量より、「まとめて解放」をタップした後の確認画面における覚醒の雫の消費量が多く表示される場合がある。</div><div>・マナサークルを解放する際に必要な素材アイテムが不足している状態で「おまかせ」ボタンをタップすると、「サポートコード：60001」が表示されタイトル画面に戻される場合がある。</div><div>※本不具合にて、覚醒の雫が本来の必要数より多く消費されることはございません。覚醒の雫の必要数が多く表示された場合でも、実際はマナピースをタップした直後の必要素材の画面に記載された覚醒の雫を消費してマナピースが解放されます。</div><div>※本不具合により、「EXアビリティ」の解放に必要な覚醒の雫を所持していても、「まとめて解放」ができない場合があります。</div><div><br></div><div>・3D表示のマナサークルにおいて、「おまかせ解放」または「まとめて解放」を「上限解放」のマナピースを含んで実行した後に、解放済みの「上限解放」のマナピースをタップすると、「解放」のポップアップが表示され、そのポップアップが閉じると進行不能になる。<br>※本不具合は2D表示のマナサークルでは発生いたしません。</div><div><br></div><div>・マナサークルを解放する際、特定の条件下で「おまかせ解放」をすると、解放可能なピースの全てが解放されずに途中で解放が止まり、その後「おまかせ」をタップすると「覚醒の雫が不足しています。」というポップアップが表示される。</div><div><br></div><div>・「竜の庭」にて、図鑑ボーナスの対象外の「犬」に贈り物を贈り信頼度がMAXになった際、「図鑑ボーナス獲得」のポップアップが表示される。</div><div>※本現象は表示上の不具合です。実際は「犬」の信頼度がMAXになった場合、図鑑ボーナスを獲得することはできません。</div><div><br></div><div>・「ドラゴン強化」にて、上限解放によって図鑑ボーナスを獲得したドラゴンを再度4段階上限解放した際に、「図鑑ボーナス獲得」のポップアップが表示される。</div><div>※本現象は表示上の不具合です。上限解放によって図鑑ボーナスを獲得したドラゴンを再度4段階上限解放した場合でも、図鑑ボーナスを再度獲得することはできません。</div><div><br></div><div>本現象の修正に伴い、ドラゴンを4段階上限解放した場合のみ、「ナームダイアリー」へ遷移するポップアップの表示を一時的に停止いたします。</div><div>次回のアップデートにて、ドラゴンを4段階上限解放した際に、「ナームダイアリー」へ遷移するポップアップが表示されるようになります。</div><div><br></div><div>プレイヤーの皆様には、ご迷惑をおかけしましたことをお詫び申し上げます。</div><div><br></div><div>■注意事項</div><div>アップデート情報がストアに反映されるまで、時間がかかる場合があります。</div><div>また、端末本体内の一時保存データの蓄積を原因として、アップデートできない場合があります。</div><div>アップデートできない場合は、端末本体の電源を切り、1～2分お待ちいただいた後に、あらためて端末本体の起動とストアからのアップデートを行ってください。</div><div><br></div><div>今後とも『ドラガリアロスト』をよろしくお願いいたします。</div>,start_time:1623294000,update_time1623639617