article_id:2394,category_name:お知らせ,title_name:ラジオのお庭「ご意見ボックス」返答（7/25放送）,image_path:,message:<div>7月25日に、文化放送にて放送中のラジオ番組「内山夕実 朝井彩加のドラガリアロスト ラジオのお庭」でディレクターの岡田がアプリ内の「ご意見ボックス」に寄せられた皆様からのご意見に返答しました。</div><div>※6/1～6/30の期間にいただいたご意見からピックアップして回答しております。</div><div><br></div><div>本お知らせでは番組内のインタビュー内容と、皆様からのご意見などに対するディレクターの岡田からの返答をお知らせします。</div><div><br></div><div>※「ご意見ボックス」はアプリ内のタイトル画面よりご利用いただけます。</div><div>※番組内の内容を本お知らせ用に編集しておりますので、放送の際の表現と異なる箇所がございます。</div><div>※回答内容は放送時点のものであり、開発中の内容は実際の仕様とは異なる場合がございます。</div><div><br></div><hr><div>■「ご意見ボックス」への回答</div><div><br></div><div>【マナサークル解放に関して】</div><div>──「最近★5のマナサークル解放がとても多い気がします。バランス調整なのは理解していますが、本来★3キャラが日の目を見るための機会だったと思っています。まだ解放されていない★3キャラ達にも出番をあげてください。私みたいにファンがいるはずですのでよろしくお願いします。」</div><div><br></div><div>岡田：今後キャラを選定する際に参考にしてまいります。</div><div><br></div><div>【虚無に関して】</div><div>──「『虚無』の対象外となるバフ一覧をヘルプに載せてほしいです。虚無下でなければ強いけれど、虚無下では弱体化するキャラ・ドラゴンでマルチに参加してくるプレイヤーが今でもいるのでもっとわかりやすくしていただきたいです。」</div><div><br></div><div>岡田：「虚無」というのは「ディアボロス封滅戦」のボスなどが使用するデバフの一つです。</div><div>これにかかると一部のバフが無効化されてしまうのですが、「虚無」が適応されるバフと適応されないバフがあり、こちらに関してまとめている箇所がまだないため、ヘルプに掲載していくようにしたいと考えております。</div><div><br></div><div>【迎撃戦に関して】</div><div>──「迎撃戦『ブレス・ウィズ・ウイング』、本編にも関係あるストーリーが展開されそうで開催が楽しみです。と同時に迎撃戦や防衛戦は現状メモリーイベント化された前例が無いので、こういった本編にも関係ありそうなストーリーを後から読み返す機会がないのは残念に思います。本編と重要な関わりのあるレイドイベント『ドラガリア・デイブレイク』の方もメモリーイベント化を期待していますので何卒よろしくお願いします！」</div><div><br></div><div>岡田：施設は様々なパラメータと関係しておりますので、施設イベントのメモリーイベント化から率先して実装していますが、「迎撃戦」「防衛戦」「闘技場」イベントなどもメモリーイベント化に取り組んでいく予定です。</div><div>実装までしばらくお待ちいただけますと幸いです。</div><div><br></div><div>【背景に関して】</div><div>──「いつも楽しく遊んでいます。メインストーリー19章のHardとVery Hardをプレイしていたら、改めて妖精の国のマップのかわいさに癒されてたくさんスクショを撮ってしまいました。カラフルで細やかな飾りがメルヘンで、まさに妖精が住んでいそうで素敵です。グラムスの市街マップ新鮮でとても良かったです。こういった素敵な背景とともにお気に入りのキャラを撮りたいので、何か写真館みたいな機能があったら嬉しいです。」</div><div><br></div><div>岡田：メインストーリー19章だけでなく20章の「聖なる樹」でも同様の背景のクエストがありますが、背景は『ドラガリアロスト』の魅力の一つだと考えております。</div><div>クエストのステージでカメラ操作をするというのは難しいですが、近いところで「聖城ワンダフルデイ！」のステージを期間限定で砂浜にしております。</div><div>そこでまた色々なスクリーンショットを撮っていただければ幸いです。</div><div><br></div><div>【グッズに関して】</div><div>──「『DRAGALIA LOST SONG COLLECTION』届きました！大ボリュームで嬉しいです！ビジュアルブックもまだ見たことなかったイラストも載っていて嬉しくて死にそう&hellip;&hellip;ラトニーかわいかったです。ありがとうございました。また来年もドラガリCDの予約させてください！」</div><div><br></div><div>岡田：皆様、『DRAGALIA LOST SONG COLLECTION』をご購入いただき、ありがとうございました。</div><div>ビジュアルブックの中にはキャラの設定イラストも掲載されておりますので、ぜひ手に取って見ていただければと思います。</div><div><br></div><div>■前回の放送にてゲスト出演された福山潤さんからのご意見への回答</div><div>──「ソロでつまずいた時にステータスUPの救済手段を増やしてほしいです。またスタンプ案で『不束者（ふつつかもの）ですが』と『ご無礼』はいかがでしょうか。」</div><div><br></div><div>岡田：検討いたします。</div><div>また、福山さんがつまずかれているところは『ドラガリアロスト』の中で一番難易度の高い「アギト叛逆戦」の絶級と伺いました。</div><div>絶級は本当に難しいですが、ぜひとも挑戦していただきたいコンテンツですので、クリアした方のパーティ編成なども参考にしてみてください。</div><div><br></div><hr><div>引き続き「ご意見ボックス」へ寄せられた皆様からのご意見にディレクター岡田より回答する予定です。</div><div>皆様からのご意見をお待ちしております。</div><div>※次回の放送では7/1～7/31の期間にいただいたご意見からピックアップ予定です。</div><div><br></div><div>今後とも『ドラガリアロスト』をよろしくお願いいたします。</div>,start_time:1628229600,update_time1628126271