article_id:2440,category_name:お知らせ,title_name:ラジオのお庭「ご意見ボックス」返答（8/29放送）,image_path:,message:<div>8月29日に、文化放送にて放送中のラジオ番組「内山夕実 朝井彩加のドラガリアロスト ラジオのお庭」でディレクターの岡田がアプリ内の「ご意見ボックス」に寄せられた皆様からのご意見に返答しました。</div><div>※7/1～7/31の期間にいただいたご意見からピックアップして回答しております。</div><div><br></div><div>本お知らせでは番組内のインタビュー内容と、皆様からのご意見などに対するディレクターの岡田からの返答をお知らせします。</div><div><br></div><div>※「ご意見ボックス」はアプリ内のタイトル画面よりご利用いただけます。</div><div>※番組内の内容を本お知らせ用に編集しておりますので、放送の際の表現と異なる箇所がございます。</div><div>※回答内容は放送時点のものであり、開発中の内容は実際の仕様とは異なる場合がございます。</div><div><br></div><hr><div>■「ご意見ボックス」への回答</div><div><br></div><div>【強者の試練に関して】</div><div>──「強者の試練について要望です。予定表に解放対象のキャラも併記していただきたいです。現状、お知らせのスケジュールを探して確認しています。ご検討お願いいたします。」</div><div><br></div><div>岡田：「強者の試練」に関しては、ボスがいつ登場するかなどの開催スケジュールをクエストページにて確認できますが、ボスを倒すことによってどのキャラの解放素材が手に入るかまでは確認できないので、わかりやすくしていきたいと考えております。</div><div><br></div><div>【キャラに関して】</div><div>──「今月のアップデートからAIが自動でエンハンス、羽化する仕様になりましたが、ナームが自動で羽化する様になったため、バフ解除が遅れてしまい、アップデート前はクリアできていたクエストがクリアできなくなってしまいました。AIの自動エンハンス、羽化は場合によっては良いかもしれませんが、オン・オフ機能があると嬉しいです。ご検討よろしくお願いいたします。」</div><div><br></div><div>岡田：エンハンスや羽化をオートでできるようになり、火力や攻撃力が上がっていると思いますが、バトル中の状況によっては、タイミングがずれてバフ解除ができなくなってしまうなどの状況が発生するため、オプションで設定できるように検討いたします。</div><div><br></div><div>【竜輝の護符に関して】</div><div>──「竜輝の護符のユニオンでの状態異常耐性について要望です。睡眠、毒、暗闇耐性のユニオンを追加していただきたいです。『アギト叛逆戦』のボスが扱う2種類の状態異常のうち、片方の耐性しかないキャラの間で格差があるように感じます。」</div><div><br></div><div>岡田：状態異常については、キャラによって耐性が違い、特にドラフェスVer.のキャラなどは2つ耐性を持っていたりするので挑みやすいキャラになっていると思いますが、今回のVer.2.11.0のアップデートにていくつか状態異常耐性のユニオンを追加します。</div><div>また、ユニオンボーナスの新規追加に伴い、既存の竜輝の護符にも新しいユニオンを設定します。</div><div><br></div><div>【機能要望に関して】</div><div>──「いつも楽しく遊ばせていただいております。自分は『プリンセスコネクト！Re:Dive』のイベントから始めた比較的新規のプレイヤーなのですが、今までSNSなどでアニバーサリーやドラフェスに合わせて投稿された素晴らしいイラストを多く見逃してしまっていると感じました。過去に投稿されたイラストなどを「ゆるがりあ」のようにまとめていつでも閲覧できる機能があったら嬉しいなと思いました。参考にしていただけたら嬉しいです！」</div><div><br></div><div>岡田：Twitterでイベント開始時や終了時に掲載しているイラストや、アニバーサリー、カウントダウンのイラストなど、沢山のイラストがありますので、閲覧できるように検討いたします。</div><div><br></div><div>■朝井さんから『ドラガリアロスト』3周年に関してのご質問</div><div>──「あと1ヶ月で『ドラがリアロスト』は3周年ですが、今回はどのような内容か、言える範囲で構いませんので情報を皆さんにお届けできたらと思います。」</div><div><br></div><div>岡田：『ドラガリアロスト』の周年で行っているキャンペーンはしっかりご用意しておりますので、去年に遜色ないような形で開催したいと考えております。</div><div>また、3周年を記念とした大掛かりなイベントも開催します。</div><div>2周年では、過去へ行った「ゼシア」がレイドボスの「モルトメサイア」と戦うというイベントがありましたが、3周年は過去ではなく現在の話でメインストーリーとも少し繋がっており、テキストのボリュームも多くなっております。</div><div>9月にナームちゃんねるも配信予定ですので、ぜひご覧いただけますと幸いです。</div><div><br></div><hr><div>引き続き「ご意見ボックス」へ寄せられた皆様からのご意見にディレクター岡田より回答する予定です。</div><div>皆様からのご意見をお待ちしております。</div><div>※次回の放送では8/1～8/31の期間にいただいたご意見からピックアップ予定です。</div><div><br></div><div>今後とも『ドラガリアロスト』をよろしくお願いいたします。</div>,start_time:1630648800,update_time1630460142