article_id:2455,category_name:イベント,title_name:施設イベント【復刻】「悪魔が誘う偽りの楽園」開催！,image_path:https://dragalialost.akamaized.net/attached/information/images/a7a74fff80df66d782843626f90236b7.png,message:<div><span class="local_date" data-local_date="1631685600"></span>から、施設イベント【復刻】「悪魔が誘う偽りの楽園」を開催中です！</div><div><br></div><div>&nbsp;<img src="https://dragalialost.akamaized.net/attached/information/images/55f38f48d2459f291c515f486233a2a8.png"></div><div>施設イベント【復刻】「悪魔が誘う偽りの楽園」の詳細は下記のとおりです。<br><br>■イベント概要<br>施設イベント【復刻】「悪魔が誘う偽りの楽園」は、イベント限定施設「浄化の泉」を獲得できるイベントです。<br>イベントに参加して「浄化の泉」を聖城に建設しましょう！<br><br>限定施設「浄化の泉」は、短剣、銃を持つキャラの能力を上昇させます。<br>また、本施設イベントのクエストで敵に与えるダメージがアップする効果を発揮します！<br>イベント限定ストーリーを進めて「浄化の泉」を強化しましょう！<br><br>イベント限定報酬で獲得できる竜輝の護符「満点チームプレイ」は、装備すると限定施設「浄化の泉」のLvアップに必要な素材アイテム「聖力の石材」の獲得量を上昇させる効果があります！<br>また、竜輝の護符交換所で交換できる竜輝の護符「フォーマル・キングス」は、装備するとクエストクリア時に獲得できる「潜入捜査度」の獲得量を上昇させる効果があります！<br>竜輝の護符「満点チームプレイ」や「フォーマル・キングス」を獲得して効率よくイベントを攻略しましょう！<br>※本効果は、イベント期間中にクエストを開始し、イベント期間終了後にクエストをクリアした場合は発揮しません。<br><br>■新規要素<br>・イベント限定施設の上限Lv解放<br>イベント限定施設「浄化の泉」の上限Lvが、Lv35まで解放されます。<br><br>■開催期間<br><span class="local_date" data-local_date="1631685600"></span> ～ <span class="local_date" data-local_date="1635227999"></span><br><br>■報酬受け取り期間<br><span class="local_date" data-local_date="1631685600"></span> ～ <span class="local_date" data-local_date="1635832799"></span><br><br>■イベント限定施設「浄化の泉」<br>短剣、銃を持つキャラの能力が上昇します。<br>また、本施設イベントのクエストで敵に与えるダメージがアップする特効能力があります。<br>特効能力は、イベント開催期間中のみ効果を発揮します。<br>「浄化の泉」をLvアップすることで特効能力の効果が大きくなります。<br>Lvアップするには、本施設イベントのクエストで獲得できる素材アイテム「聖力の石材」が必要です。<br><br>■前回イベント開催時に「浄化の泉」を獲得している場合<br>すでに「浄化の泉」を獲得している場合は、施設ではなく竜輝晶を獲得できます。<br><br>■素材アイテム「聖力の石材」<br>本施設イベントのストーリークエスト、ボスバトル、エクストラボスバトルで獲得できます。<br><br>■ボスバトル<br>本施設イベントのストーリーに登場するボスと直接対決するクエストです。<br>難易度に応じて獲得できる報酬量が変化します。<br>マルチプレイが可能なクエストです。<br><br>■エクストラボスバトル<br>「ボスバトル 上級」より高難易度ですが、スタミナや共闘の翼は消費せず、報酬が豪華になります。<br>「ボスバトル 上級」クリア時に、一定確率で出現します。<br>※リピート機能を使用してボスバトルを複数回クリアした場合でも、出現するエクストラボスバトルは最大で1回分となります。<br>1回クリアするとクエストは消滅します。<br>条件を満たすことで、何回でもクエストは出現します。<br>マルチプレイが可能なクエストです。<br><br>■チャレンジバトル<br>最高難易度のソロプレイ限定クエストです。<br>チャレンジバトルには、「上級」、「超級」、「HELL」の難易度があります。<br>「ボスバトル 上級」初回クリア時に、「チャレンジバトル 上級」が解放されます。<br>「チャレンジバトル 上級」初回クリア時に、「チャレンジバトル 超級」が解放されます。<br>「チャレンジバトル HELL」は、<span class="local_date" data-local_date="1631944800"></span>に解放されます。<br>また、バトルに挑戦するには、「チャレンジバトル 超級」をクリアする必要があります。<br>※解放される前に「チャレンジバトル 超級」をクリアしても、バトルに挑戦することはできません。<br><br>チャレンジバトルは次々に敵が現れるWAVE制のクエストです。<br>「上級」「超級」は、WAVEの途中でクエストに失敗しても、突破したWAVEまでの報酬を獲得できます。<br>「HELL」は、最後のWAVEまで突破しないとクリアにならず、報酬を獲得することができません。<br>また、難易度に応じて報酬のドロップする確率が変化します。<br>※「HELL」の報酬がドロップする確率は、「超級」と同じです。<br><br>「チャレンジバトル HELL」はクリアすると1日1回、チャレンジ報酬を獲得することができます。<br>※チャレンジ報酬は豪華報酬からランダムに選ばれます。<br><br>■潜入捜査度報酬<br>本施設イベントのクエストをクリアすると獲得できる「潜入捜査度」を集めることで、さまざまな報酬を獲得できます。「潜入捜査度」は、施設イベント【復刻】「悪魔が誘う偽りの楽園」のクエストをクリアすることで獲得できます。<br><br>■交換所報酬<br>交換所では、クエストで入手できる交換専用アイテム「聖浄の水袋」や「パラダイス穀物」と、さまざまな報酬を交換できます。<br>また、限定施設「浄化の泉」のLvアップに使用する「聖力の石材」と、交換専用アイテム「聖浄の水袋」や「パラダイス穀物」同士を交換することができます。<br><br>■イベントボーナス<br>本施設イベントでは、下記の竜輝の護符がイベントボーナス効果を発揮します。<br>・満点チームプレイ<br>・フォーマル・キングス<br>竜輝の護符を装備して本施設イベントのクエストをクリアすると、「聖力の石材」や「潜入捜査度」の獲得量が上昇します。<br><br>「満点チームプレイ」は、ミッションの報酬として獲得できます。<br>「フォーマル・キングス」は、竜輝の護符交換所などで獲得できます。<br>※イベントボーナスの効果量は、竜輝の護符や、竜輝の護符の上限解放段階によって異なります。<br><br>■ミッション<br>イベント期間中のみ挑戦可能なミッションです。<br>「デイリーミッション」と「期間限定ミッション」の2種類があります。<br>達成することで、さまざまな報酬を獲得できます。<br>※「デイリーミッション」は<span class="local_date" data-local_date="1632981600"></span>以降は挑戦できません。<br><br>■注意事項<br>1. 本施設イベントの詳細は、ゲーム内イベントトップページの「遊び方」からご確認ください。<br>2. イベントクエスト参加には、メインストーリー2章 2-1（Normal）をクリアする必要があります。<br>3. マルチプレイ参加には、メインストーリー2章 2-1（Normal）をクリアする必要があります。<br>4. クエスト中にイベント期間が終了した場合、勝敗が決まるまでバトルが行われます。バトルの勝敗に応じた報酬も獲得できます。<br><br>今後とも『ドラガリアロスト』をよろしくお願いいたします。</div>,start_time:1631685600,update_time1630573599