article_id:2523,category_name:お知らせ,title_name:ラジオのお庭「ご意見ボックス」返答（9/26放送）,image_path:,message:<div>9月26日に、文化放送にて放送中のラジオ番組「内山夕実 朝井彩加のドラガリアロスト ラジオのお庭」でディレクターの岡田がアプリ内の「ご意見ボックス」に寄せられた皆様からのご意見に返答しました。</div><div>※8/1～8/31の期間にいただいたご意見からピックアップして回答しております。</div><div><br></div><div>本お知らせでは番組内のインタビュー内容と、皆様からのご意見などに対するディレクターの岡田からの返答をお知らせします。</div><div><br></div><div>※「ご意見ボックス」はアプリ内のタイトル画面よりご利用いただけます。</div><div>※番組内の内容を本お知らせ用に編集しておりますので、放送の際の表現と異なる箇所がございます。</div><div>※回答内容は放送時点のものであり、開発中の内容は実際の仕様とは異なる場合がございます。</div><div><br></div><hr><div>■「ご意見ボックス」への回答</div><div><br></div><div>【みんなのクリアパーティに関して】</div><div>──「みんなのクリアパーティをマルチでも実装するとのことですが、現状の機能だとシェアスキルの項目がありません。自動設定されなくてもいいのでシェアスキルの項目も表示して欲しいです。竜輝の護符だけではなくシェアスキルも表示してくれると、マルチ環境の流行が分かりやすくなってプレイしやすくなると思うので、検討をお願いします。」</div><div><br></div><div>岡田：「みんなのクリアパーティ」のマルチ対応については、<span class="local_date" data-local_date="1632452400"></span>ごろに予定しているVer.2.12.0のアップデートで追加いたしました。</div><div>今後のアップデートでシェアスキルもパーティにセットできるように準備しておりますので、お待ちいただければ幸いです。</div><div><br></div><div>【アギト叛逆戦に関して】</div><div>──「アギト叛逆戦の上級・中級をスキップ可能にして欲しいです！ご検討よろしくお願いします。」</div><div><br></div><div>岡田：こちらも検討しておりますので、お待ちいただければと思います。</div><div>「真ドラゴンの試練」「アギト叛逆戦」「ディアボロス封滅戦」の他に、さらにもう1つ高難易度クエストを追加予定しており、コンテンツも増えているので、今後プレイヤーの皆さまがよりプレイしやすいよう1度クエストをクリアしたらスキップできるように考えております。</div><div><br></div><div>【機能要望に関して】</div><div>──「オーラを付与するキャラが増えてきたので、ソートに『オーラ』のチェックボックスを追加して頂けないでしょうか。よろしくお願いします。」</div><div><br></div><div>岡田：「オーラ」という効果がとても重要になってきておりますので、そちらも含めてソートできるように検討していきたいと考えております。</div><div><br></div><div>■朝井さん、内山さんから9月24日に配信された「ナームちゃんねる」に関してのご質問</div><div>──「今後のアップデートで追加予定の新コンテンツ、『カレイドラビリンス』はダンジョンということですが、初心者でもクリア可能ですか？常設の場合は定期的にダンジョンの内容も変わったりするのでしょうか？」</div><div><br></div><div>岡田：「ナームちゃんねる」で発表させていただいた新しいコンテンツ「カレイドラビリンス」ですが、ダンジョンに挑む度にキャラがLv1の状態でスタートします。そのダンジョンの中でキャラのレベルを上げ、武器や竜輝の護符、スキルやドラゴンを獲得していき、それらを使いこなしながらダンジョンの最下層を目指していくというコンテンツです。</div><div>毎回展開が異なるダンジョンなので、その都度戦い方や攻略方法も変わってくると思います。</div><div>最初のプレイでクリアすることは厳しいかもしれませんが、キャラのレベル上げ、武器の作成や強化などの準備をせずに楽しむ事ができますので、気軽に挑戦してみてください。</div><div>「カレイドラビリンス」は常設のコンテンツであり、ダンジョンの内容もどこかのタイミングで更新していく予定ですが、様々なキャラでクリアするメリットがあるダンジョンですので、コンプリートを目指していただければ幸いです。</div><div>ダンジョン内で獲得した武器・竜輝の護符・スキル・ドラゴンは持ち帰れませんが、ダンジョン内で獲得したポイントで別のアイテムに交換したり、「カレイドラビリンス」を有利に進めたりすることができます。</div><div>ダンジョンをクリアすると、使用したキャラの竜輝の護符が獲得できます。</div><div>その竜輝の護符は「キャラ護符」と呼称しますが、どのキャラでも装備することができ、挑んだキャラによって得られるアビリティや性能が少し変わっていきます。</div><div>「キャラ護符」は全キャラ獲得する事が可能です。</div><div>また、途中でリタイアした場合でも「キャラ護符」を獲得できますが、最下層までクリアした方がより様々な種類のアビリティが付きます。</div><div><br></div><div>──「今後のアップデートで追加予定の新高難易度クエストは、これまでの高難易度クエストよりさらに上の難易度になるのでしょうか？またパーティ編成に制限をかける予定はありますか？」</div><div><br></div><div>岡田：こちらも「ナームちゃんねる」で公開させていただきましたが、五竜の原初の姿と戦うクエストです。</div><div>なぜ五竜と戦うかは今後のストーリーで展開していく予定ですので、そちらを楽しみにお待ちいただければ幸いです。</div><div>難易度に関してはいくつか作っていく予定ですが、1番上の難易度は難しく、やりごたえのあるクエストにしていこうと考えております。</div><div>また、現段階ではパーティ編成に制限を設ける予定はございません。</div><div><br></div><hr><div>引き続き「ご意見ボックス」へ寄せられた皆様からのご意見にディレクター岡田より回答する予定です。</div><div>皆様からのご意見をお待ちしております。</div><div>※次回の放送では9/1～9/30の期間にいただいたご意見からピックアップ予定です。</div><div><br></div><div>今後とも『ドラガリアロスト』をよろしくお願いいたします。</div>,start_time:1633068000,update_time1632964465