article_id:2840,category_name:イベント,title_name:イベント【復刻】「防衛戦～天炎照らす幻砂のランウェイ～」開催！,image_path:https://dragalialost.akamaized.net/attached/information/images/809114145390a0029408d8afe99e74a7.png,message:<div><span class="local_date" data-local_date="1650002400"></span> から、イベント【復刻】「防衛戦～天炎照らす幻砂のランウェイ～」を開催中です！</div><div><br></div><div><img src="https://dragalialost.akamaized.net/attached/information/images/809114145390a0029408d8afe99e74a7.png"></div><div><br></div><div>■イベント概要</div><div>【復刻】「防衛戦～天炎照らす幻砂のランウェイ～」は、迫りくる多くの敵を迎え撃ちながら拠点を守り抜く期間限定イベントです！</div><div><br></div><div>難易度が上がるごとに敵の攻撃が激しくなり、各難易度別に用意された最終防衛ラインである「防衛戦」では、様々なルートから進軍してくる敵を撃退しながら拠点を守る、攻防一体の戦闘を楽しめます！</div><div>持てる全ての戦力を投入してディアネル帝国の侵略を阻止し、新アルベリア王国の平和を勝ち取りましょう！！</div><div><br></div><div>■報酬について</div><div>イベント【復刻】「防衛戦～天炎照らす幻砂のランウェイ～」では、「攻略P」の報酬として、火属性キャラのシェアスキルを解放できる「緋の書」と、水属性キャラのシェアスキルを解放できる「青の書」を獲得できます。</div><div><br></div><div>■開催期間</div><div><span class="local_date" data-local_date="1650002400"></span> ～ <span class="local_date" data-local_date="1650607199"></span></div><div><br></div><div>■報酬受け取り期間</div><div><span class="local_date" data-local_date="1650002400"></span> ～ <span class="local_date" data-local_date="1651211999"></span></div><div><br></div><div>■ストーリーについて</div><div>本イベントでは、各地で拠点を守るために奮闘する仲間たちの新たなストーリーが楽しめます。</div><div>期間限定アイテム「戦いの記録書」を使用することで、ストーリーを読むことができます。</div><div>※イベント開催期間を過ぎると、「戦いの記録書」を使用してストーリーを読むことができなくなります。</div><div><br></div><div>■基本的な遊び方</div><div>防衛戦イベントには、「初級」「中級」「上級」「超級」の4段階の難易度のクエストが複数あります。</div><div>イベント開始時は「初級」のクエスト1つのみが解放されています。</div><div><br></div><div>解放されていないクエストは、期間限定アイテムを使用することで解放できます。</div><div>難易度が同じクエストを全てクリアすると、難易度クリア報酬が獲得でき、次の難易度のクエストが解放されます。</div><div><br></div><div>■攻略P（ポイント）</div><div>防衛戦イベントのクエストをクリアすると、「攻略P」を獲得できます。</div><div>「攻略P」を集めることで、防衛戦イベントのクエストやストーリーが解放できる期間限定アイテムなど、さまざまな報酬を獲得できます。</div><div><br></div><div>■期間限定アイテム</div><div>「攻略P」を集めることで獲得できる期間限定のアイテムです。</div><div>使用すると、防衛戦イベントのクエストやストーリーを解放することができます。</div><div>期間限定アイテムはイベントごとにリセットされます。</div><div><br></div><div>「戦域の地図」は、クエストの解放に使用するアイテムです。</div><div>「作戦司令書」は、EXクエストの挑戦に使用するアイテムです。</div><div>「戦いの記録書」は、ストーリーの解放に使用するアイテムです。</div><div><br></div><div>※「戦域の地図」は、本イベントにて「攻略P」を集めることでのみ獲得できます。</div><div>ドロップ報酬や交換所、ミッションの達成報酬からは獲得できません。</div><div><br></div><div>■交換所</div><div>交換所では、防衛戦イベントの報酬で獲得できる期間限定アイテム「プライマルクリスタル」と、さまざまな報酬を交換できます。</div><div><br></div><div>■ミッション</div><div>イベント期間中のみ挑戦可能なミッションです。</div><div>「デイリー」と「期間限定」の2種類があります。</div><div>達成することで、さまざまな報酬を獲得できます。</div><div><br></div><div>■防衛戦イベントのクエストについて<br>防衛戦イベントの各難易度内には、さらに「前哨戦」「局地戦」「防衛戦」の3種類のクエストがあります。<br><br>「前哨戦」「局地戦」はWAVEごとに次々と押し寄せる敵を倒すクエストです。<br>「前哨戦」「局地戦」に拠点は存在しません。<br>最後のWAVEを突破するとクエストクリアとなります。<br><br>「防衛戦」は、迫りくる敵から拠点を守る特殊なクエストです。<br>クエストクリアには、「通常クリア」と「完全クリア」があります。<br>制限時間まで拠点を守り抜いた場合や、ボスエリアでパーティキャラ全員のHPが0になると「通常クリア」です。<br>ボスエリアに出現するボスを倒すと「完全クリア」です。<br>「完全クリア」の場合、「通常クリア」の報酬に加えて、追加報酬を獲得できます。<br>拠点のHPが0になったり、ボスエリアに進む前にパーティキャラ全員のHPが0になったりすると、クエスト失敗です。<br><br>■「防衛戦」の「拠点」について<br>拠点の位置からクエストがスタートし、画面上部に拠点のHPが表示されます。<br>また、拠点に進軍してくる敵が、画面上部にアイコンで簡易的に表示されます。<br>※拠点は、クエスト開始時の位置から移動せず、敵への攻撃も行いません。<br><br>■「防衛戦」の「敵の進軍ルート」について<br>新たな敵の集団が登場すると、ミニマップ内に進軍ルートが矢印で一定時間表示されます。<br>※クエストの難易度によっては表示されない場合があります。<br><br>■クエストスキル<br>クエストスキルは専用のスキルボタンをタップすることで操作キャラの位置に発動します。<br>1回のクエストごとに3回まで使用することができ、一度使用するとクールタイムが発生し、一定時間使用することができません。<br>※クエストによっては、使用できない場合があります。<br><br>■「防衛戦」の「跳ね橋」について<br>マップ内に、跳ね橋が掛けられていることがあります。<br>クエスト開始時に跳ね橋は上がった状態で、敵味方ともに通行できません。<br>跳ね橋の近くにあるスイッチを攻撃すると、跳ね橋を下ろして通行することができます。<br>※下ろした跳ね橋は、上げることができません。<br>※敵がスイッチを攻撃することはありません。<br><br>■「防衛戦」の「民家」と「山賊」について<br>マップ内に、民家が登場することがあります。<br>敵の山賊は拠点より民家を優先的に攻撃します。<br>民家が破壊される前に山賊を倒し、民家に表示されるサークルの中に入ると、味方パーティを強くするバフが付与されたり、敵の詳しい位置情報がミニマップに表示されたりします。<br>※民家の破壊状況は報酬に影響しません。<br><br>■「防衛戦」の「ボス」について<br>制限時間内に最後のWAVEを突破すると、ボスが登場し、ボスエリアへ進むことができます。<br>ボスは、ボスエリアから移動しません。<br>ボスを制限時間内に倒すと「完全クリア」になります。<br><br>■「防衛戦」の再挑戦について<br>拠点のHPが0になった場合や、ボスエリアに進む前にパーティキャラ全員のHPが0になった場合に、「再挑戦」を行うことができます。<br><br>■「防衛戦」のマルチプレイについて<br>難易度「初級」「中級」「上級」の防衛戦では、マルチプレイはできません。<br>難易度「超級」の防衛戦ではマルチプレイが可能です。<br>※クエスト「防衛戦 超級」ではマルチプレイ時、共闘の翼を消費します。<br>※クエスト「防衛戦 EX」ではマルチプレイ時に作戦司令書のみ消費します。共闘の翼は消費しません。<br><br>■注意事項<br>1. 防衛戦イベントについての詳細は、ゲーム内防衛戦イベントトップページの「遊び方」からご確認ください。<br>2. イベントクエスト参加には、メインストーリー2章 2-1（Normal）をクリアする必要があります。<br>3. マルチプレイ参加には、メインストーリー2章 2-1（Normal）をクリアする必要があります。<br>4. クエスト中にイベント期間が終了した場合、勝敗が決するまでバトルが行われます。バトルの勝敗に応じた報酬も獲得できます。<br>5. 本イベントで獲得した期間限定アイテム「プライマルクリスタル」「戦域の地図」「作戦司令書」「戦いの記録書」は、今後開催されるイベントでは使用できません。<br><br>今後とも『ドラガリアロスト』をよろしくお願いいたします。</div>,start_time:1650002400,update_time1644463026