article_id:38,category_name:アップデート,title_name:アップデートのお知らせ【追記】,image_path:,message:<div><span class="local_date" data-local_date="1539675000"></span>にバージョン1.0.6の公開を行いました。</div><div>※強制アップデートを、<span class="local_date" data-local_date="1539745200"></span>ごろに実施する予定です。</div><div><br></div><div>今回アップデートをしていただいたプレイヤーの皆様に、感謝の気持ちとして、10回召喚チケットをプレゼントいたします。</div><div>配布が完了しましたら、本お知らせにて追記いたします。</div><div><br></div><div>バージョン1.0.6では、イベント開催に伴う機能追加や改修のほか、不具合修正を行いました。</div><div>アップデートの詳細は下記をご確認ください。</div><div><br></div><div><strong>《アップデート内容》</strong></div><div><strong>■イベント</strong></div><div>・「お菓子なハロウィンパーティーナイト」開催対応</div><div><br></div><div><strong>■機能追加/改修</strong></div><div>下記の機能の追加および改修を行いました。</div><div>・オプション内の「ゲーム」タブにて、クイックターンのON/OFFが選択できるようにしました。</div><div>・強化画面で最大レベルになったキャラ、武器、ドラゴン、竜輝の護符のアイコンにマスクがかかるようにしました。</div><div>・マルチプレイにて、連戦選択画面で待機した際に連戦がキャンセルされるまでの時間を40秒に短縮しました。</div><div>・マルチプレイにて、コンティニュー時に、カメラボタンにより他プレイヤーの操作を見られるようにしました。</div><div>・クエスト中にスワイプで表示される矢印の長さを短くしました。</div><div>・提供割合の表記レイアウトを調整しました。</div><div><br></div><div><strong>■不具合</strong></div><div>下記の不具合の修正を行いました。</div><div>・2章 2-1「フォレスティアの射手」のチュートリアル中に進行不能になる。</div><div>・マルチプレイのチュートリアル中にルーム作成から進行できなくなる。</div><div>・マルチプレイにて、同一効果の「EXアビリティ」でゲストの効果が最も高い場合に、ホスト側でアビリティ効果が発揮されない。</div><div>・睡眠か気絶状態になったボスを次の一撃で討伐すると、クエストをクリアできなくなる。</div><div>・日付変更されていないにもかかわらず、スタミナ回復回数の表示がリセットされることがある。</div><div>・マルチプレイでイベントクエスト出発後、開催終了時刻をまたいでクリアした場合、進行不能になる。</div><div>・コンティニューでドラゴンダイヤの「購入する」ボタンをタップすると、エラーが表示され購入できない。</div><div>・護符上限解放演出中に特定の手順を行うと、ヘッダーやフッターが表示されなくなる。</div><div>・強化が未解放の状態でも、護符詳細の「上限解放へ」がアンロックされており、特定手順で進行後にエラーが発生する。</div><div>・「スタートダッシュミッション」の吹き出しと残日数表示が、ウェルカムパックの購入状況で消える。</div><div>・「ミドガルズオルムの試練」の超級をリタイアした際、「真ミドガルズオルムの試練」のチュートリアルが再生されることがある。</div><div>・「真ミドガルズオルムの試練」が解放されていなくても、「真ミドガルズオルムの試練」の交換所が解放されることがある。</div><div>・オートプレイで、キャラクターがダッシュ中に手動で方向転換を行うと、ブレーキのモーションを行わず、移動する。</div><div>・サポートキャラに「ミコト」を選択した際、スキル「熾炎剣・魔障覆滅」命中時に「浄炎の構え」および「灼滅の構え」が表示されない。</div><div>・ミコトの「浄炎の構え」が特定のマーカーの攻撃でキャンセルされた場合、敵の攻撃をうけるまで移動ができなくなる。</div><div>・ミコトのスキルを使用して「浄炎の構え」および「灼滅の構え」を発動させた後、次に使う「熾炎剣・魔障覆滅」を敵にヒットさせないようにすると、その時の構えが永続する。</div><div>・ウルガのスキル「ワイルドハント」のレベル2とレベル3に、攻撃力ダウンの効果が付与されていない。</div><div>・下記の斧のスキルがレベル2の時、2ヒット目が発生しない。</div><div>　1. クリムゾンアックス</div><div>　2. ディスペアーアックス</div><div>　3. タイラントアックス</div><div>・操作キャラ以外において、下記のスキルを使用しないことがある。</div><div>　1. ステータスをアップさせるスキル</div><div>　2. 一部の回復スキル（HP継続回復以外の追加効果を持つ回復スキル）</div><div><br></div><div>■注意事項</div><div>アップデート情報がストアに反映されるまで、時間がかかる場合がございます。</div><div>また、端末本体内の一時保存データの蓄積を原因として、アップデートできない場合がございます。</div><div>アップデートできない場合は、端末本体の電源を切り、1～2分お待ちいただいた後にあらためて端末本体の起動と、ストアからのアップデートを行ってください。</div><div><br></div><div><span class="local_date" data-local_date="1539747000"></span>追記<br><span class="local_date" data-local_date="1539745200"></span>までにゲームを開始されたプレイヤーの皆様に、下記のアイテムをお送りいたしました。<br><br>・10回召喚チケット1枚<br><br>お送りした10回召喚チケットは、<span class="local_date" data-local_date="1540349940"></span>までにゲームにログインした際に受け取れます。<br>本件の10回召喚チケットの受け取り期限は、プレゼントに10回召喚チケットが送られてから7日間です。</div><div><br></div><div>今後とも『ドラガリアロスト』をよろしくお願いいたします。</div>,start_time:1539676800,update_time1540888544