b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":1007,"category_name":"Events","pr_category_id":"4","title_name":"The Facility Event Revival, Flames of Reflection, Is Now Live! [Addendum]","message":"<div><span style=\\"color: rgb(44, 130, 201);\\"><strong>[Addendum <span class=\\"local_date\\" data-local_date=\\"1578993000\\"><\/span>]<br><\/strong><\/span>Even if you clear the Arctos&#39;s Trial boss battle several times in a row using the auto-repeat feature, the Arctos&#39;s Final Trial extra boss battle will only become available once at most.<br><br>Thank you for playing Dragalia Lost.<\/div><div><br><\/div><hr><div>A facility event revival, Flames of Reflection, went live <span class=\\"local_date\\" data-local_date=\\"1578981600\\"><\/span>!<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/a846dca1aae981a566e2db2dea09d598.png\\"><\/div><div>Three sisters work together to forge weapons at the Halidom&#39;s smithy. There&#39;s Ramona, who is dependable and responsible, Rena, who is kind and calm, and Renee, who is cheerful and a bit of a dreamer.<\/div><div>Blacksmiths work behind the scenes to support the battles, but even they have a story! This is the heated tale of three women striving to reach greater heights as blacksmiths!<\/div><div><br><\/div><div>\\u25a0Event Overview<\/div><div>In Flames of Reflection, you can acquire an event-exclusive facility: the Arctos monument. If you play the event, you&#39;ll have the chance to build one for your Halidom!<\/div><div><br><\/div><div>The Arctos monument boosts the stats of flame-attuned adventurers, which you&#39;ll want to use in this event. It also boosts the damage that adventurers deal against enemies in event quests. Progress through the event story and level up your Arctos monument.<\/div><div><br><\/div><div>Adventurers can equip the event-specific wyrmprint The Dragon Smiths to receive more motivational logs, which are used to upgrade the Arctos monument, from these quests. Wyrmprints are good for more than just that, though, so try to get ahold of them to get the most out of this event!<\/div><div><br><\/div><div>Please note that special effects conferred by event-specific wyrmprints do not apply if you begin a quest during the event period but complete the quest after the event period has ended.<\/div><div><br><\/div><div>\\u25a0Additions<\/div><div>\\u30fbNew maximum level unlocked for the event facility!<\/div><div>The Arctos monument event facility can now be leveled up to a maximum of level 35.<\/div><div><br><\/div><div>\\u30fbNew difficulty level added!<\/div><div>A new difficulty level, Nightmare, has been added to the challenge battle.<\/div><div>The Nightmare difficulty Challenge Battle will be available starting at <span class=\\"local_date\\" data-local_date=\\"1579240800\\"><\/span>.<\/div><div>Additionally, players must complete the Master difficulty challenge battle to attempt Nightmare difficulty.<\/div><div>Note: Even if you complete the Master difficulty challenge battle, you will not be able to play the Nightmare difficulty battle until it is available.<\/div><div><br><\/div><div>Nightmare difficulty requires the same amount of stamina as the Expert and Master difficulties, and you will receive the same amount of mettle.<\/div><div>Once per day, when you clear Nightmare difficulty, you can get a Grand Bounty.<\/div><div>Note: The Grand Bounty you receive is randomly selected from a set of rewards.<\/div><div><br><\/div><div>\\u30fbAuto-repeat feature added!<br>You will now be able to use the auto-repeat feature in quests other than the Extra Boss Battle and Challenge Battle.<\/div><div><br><\/div><div>\\u25a0Event Duration<\/div><div><span class=\\"local_date\\" data-local_date=\\"1578981600\\"><\/span> to <span class=\\"local_date\\" data-local_date=\\"1579759199\\"><\/span><\/div><div><br><\/div><div>\\u25a0Reward Availability Period<\/div><div><span class=\\"local_date\\" data-local_date=\\"1578981600\\"><\/span> to <span class=\\"local_date\\" data-local_date=\\"1580363999\\"><\/span><\/div><div><br><\/div><div>\\u25a0Event-Exclusive Facility: Arctos Monument<\/div><div>This facility increases the stats of flame-attuned adventurers.<\/div><div>It also confers a special effect that lets you deal more damage to enemies in these event quests.<\/div><div>The strength of this effect increases as you level up the Arctos monument.<\/div><div>This effect only applies for the duration of this event.<\/div><div>You&#39;ll need motivational logs, which you can find in these event quests, to level up your Arctos monument.<\/div><div><br><\/div><div>\\u25a0Upgrade Item: Motivational Logs<\/div><div>You can get these from the story quests, boss battle, and extra boss battle related to the Flames of Reflection facility event revival.<\/div><div><br><\/div><div>\\u25a0If You Already Obtained the Arctos Monument<\/div><div>If you already have the Arctos monument from a past event, you will receive wyrmite instead.<\/div><div><br><\/div><div>\\u25a0Boss Battles<\/div><div>Boss battles are quests where you can face off against boss enemies that appear in the event story. Rewards vary depending on the difficulty cleared. This quest can be played either solo or co-op.<\/div><div><br><\/div><div>\\u25a0Extra Boss Battles<\/div><div>Although the difficulty level of extra boss battles is higher than the event boss battle on Expert difficulty, the rewards are generous and the battles do not cost stamina or getherwings.<\/div><div>Extra boss battles occasionally appear after clearing the event boss battle on Expert difficulty. It will disappear again after being successfully cleared. You can repeatedly unlock the quest if the conditions are met again. This quest can be played either solo or co-op.<\/div><div><br><\/div><div>\\u25a0Challenge Battles<\/div><div>Challenge Battles are high-difficulty quests limited to solo play, and are available in Expert, Master, and Nightmare difficulties. The Expert difficulty Challenge Battle is unlocked after completing the event boss battle on Expert difficulty, and the Master difficulty Challenge Battle will unlock when you complete the Expert difficulty Challenge Battle. The Nightmare difficulty Challenge Battle will become available at <span class=\\"local_date\\" data-local_date=\\"1579240800\\"><\/span>, and you must complete the Master difficulty Challenge Battle to play it.<\/div><div>Note: Even if you complete the Master difficulty Challenge Battle, you will not be able to play the Nightmare battle until it is available.<\/div><div><br><\/div><div>These quests will have you testing your strength against waves of enemies. If you fail to reach the last wave in Expert or Master difficulty, you will still receive rewards for the ones you did clear, but in Nightmare difficulty you must complete the final wave to earn rewards.<\/div><div>Finally, the drop rate for rewards differs based on the difficulty.<\/div><div>Note: The drop rate for rewards in Nightmare difficulty is the same as Master difficulty.<\/div><div><br><\/div><div>Once per day, when you clear Nightmare difficulty, you can get a Grand Bounty.<\/div><div>Note: The Grand Bounty you receive is randomly selected from a set of rewards.<\/div><div><br><\/div><div>\\u25a0Mettle Rewards<\/div><div>Mettle points are event-exclusive points that can be earned by clearing event quests. Collect them to earn all kinds of rewards!<\/div><div><br><\/div><div>\\u25a0Treasure Trade Rewards<\/div><div>You can earn turbo-twist jump ropes and megaton dumbbells by playing event quests and trade them for various rewards on the Treasure Trade menu.<\/div><div>What&#39;s more, in this event you&#39;ll be able to trade motivational logs, which are required to level up your Arctos monument event facility, for turbo-twist jump ropes and megaton dumbbells, which are only used in the Treasure Trade, and vice versa.<\/div><div><br><\/div><div>\\u25a0Event Bonus<\/div><div>The following wyrmprints will have bonus effects during the Flames of Reflection event.<\/div><div>\\u30fbThe Dragon Smiths<\/div><div>\\u30fbSisters&#39; Day Out<\/div><div>\\u30fbTo the Extreme!<\/div><div>If you equip these wyrmprints and clear event quests, you&#39;ll get even more motivational logs and mettle.<\/div><div><br><\/div><div>You can get The Dragon Smiths from the event&#39;s Treasure Trade or as a mettle reward. Sisters&#39; Day Out and To the Extreme! are available in the Treasure Trade for wyrmprints.<\/div><div>Note: The amount of event bonus effect differs based on the wyrmprint and how much the wyrmprint has been unbound.<\/div><div><br><\/div><div>\\u25a0Endeavors<\/div><div>These endeavors can only be attempted for the duration of the event. They are separated into Daily and Limited variations. By accomplishing these endeavors, you can receive various rewards.<\/div><div><br><\/div><div>\\u25a0Castle Stories<\/div><div>A new story has been added to Castle Stories. You can read it by using Looking Glasses, which can be obtained as mettle rewards.<\/div><div><br><\/div><div>Notes:<\/div><div>1. You can see more details about this event by tapping Help on the event page.<\/div><div>2. Players must have completed up to Chapter 2 \/ 2-1 (Normal) of the main campaign to participate.<\/div><div>3. Players must have completed up to Chapter 2 \/ 2-1 (Normal) of the main campaign in order to play co-op.<\/div><div>4. If the event ends while you are playing an event quest, the quest will continue until results have been determined and you will be able to gain the rewards shown.<\/div><div><br><\/div><div>Thank you for playing Dragalia Lost.<\/div><div><br><\/div>","start_time":1578981600,"prev_article_id":"1006","next_article_id":"1000","image_path":"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/a846dca1aae981a566e2db2dea09d598.png","update_time":1579052232}}}'