b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":1048,"category_name":"News","pr_category_id":"1","title_name":"Issues Regarding Skill Gauge After Reviving[Addendum]","message":"<div>We have confirmed the following issues with the Revive feature added in version 1.16.1.<\/div><div><br><\/div><div>\\u25a0After reviving, the skill gauges of the following skills don&#39;t increase automatically:<br>\\u30fbAlbert&#39;s Thunderous Impulse<br>\\u30fbDelphi&#39;s Ruination Cage and Corrosive Cage<br>\\u30fbGala Prince&#39;s Exalted Glory<br>Note: These skills&#39; gauges do increase automatically before reviving.<\/div><div><br><\/div><div>\\u25a0After reviving, the skill gauge of Gala Elisanne&#39;s Celestial Ascent skill doesn&#39;t automatically decrease even when the skill gauge isn&#39;t completely filled and Gala Elisanne isn&#39;t under the effects of Divine Revelation.<br>Note: This skill&#39;s gauge does decrease automatically before reviving if the gauge isn&#39;t completely filled and Gala Elisanne isn&#39;t under the effects of Divine Revelation. When under the effects of Divine Revelation, the skill gauge will automatically increase as expected.<\/div><div><br><\/div><div>\\u25a0After reviving, the skill gauge for Summer Verica&#39;s Moment of Passion will not increase automatically until after using the Everlasting Summer skill.<br>Note: The skill gauge does increase automatically before reviving.<\/div><div><br><\/div><div>We are currently fixing these issues. Any further updates will be added to this notice.<\/div><div><br><\/div><div>Thank you for playing Dragalia Lost.<\/div><div><br><\/div><div><span style=\\"color: rgb(41, 105, 176);\\"><strong>[Addendum <span class=\\"local_date\\" data-local_date=\\"1581051600\\"><\/span>]<\/strong><\/span><\/div><div>These issues have been fixed in the 1.16.2 update.<\/div><div><br><\/div><div>Thank you for playing Dragalia Lost.<\/div>","start_time":1580206500,"prev_article_id":"1041","next_article_id":"1037","image_path":"","update_time":1581054785}}}'