b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":1346,"category_name":"Events","pr_category_id":"4","title_name":"A New Raid Event, Timeworn Torment, Is Now Live!","message":"<div>Up to four players with four adventurers each (up to 16 adventurers in total!) can battle together in the Timeworn Torment raid event, which began <span class=\\"local_date\\" data-local_date=\\"1590559200\\"><\/span>. Take on event-specific quests to defeat the shadow-attuned raid boss and earn rewards!<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/13d17ab68fec1dce084e9b77ca345541.png\\"><\/div><div>One day, some time after the prince and friends sealed Qitian Dasheng away along with the Qilin relic Jin Gu Er, Xuan Zang&#39;s apprentice Wu Kong arrived at the Halidom. As it turns out, the seal was broken, but when the prince and friends went to survey the situation, they met the kind fiend Mei Hou Wang. Now the convictions of those who seek to defeat Mei Hou Wang and those who seek to protect him will clash!<\/div><div>Note: &nbsp;Certain part of the text has been corrected.<br><br>Event theme song: &quot;Force Your Way&quot; by Takayoshi Tanimoto<br><br>An adventurer, Wu Kong, will join you during this event. Increase your friendship with him to add him to your roster permanently. You can also use collected blazons and emblems to get Wu Kong&#39;s convictions and use them to upgrade Wu Kong&#39;s mana circles.<br><br>\\u25a0Additions<br>\\u30fbThe temporary adventurer is 5\\u2605<br>Wu Kong, the temporary adventurer who will join during this event, is a 5\\u2605 adventurer.<br><br>\\u30fbEvent adventurer upgrade item<br>In this event you can get Wu Kong&#39;s convictions, an item used to upgrade the adventurer Wu Kong, from emblem rewards, blazon summoning, and limited-time endeavors. You can obtain up to a maximum of 54 Wu Kong&#39;s convictions.<br><br>You can use Wu Kong&#39;s convictions on Wu Kong&#39;s mana circles to unlock nodes or unbind new mana circles. You can use Wu Kong&#39;s convictions in this way on Wu Kong&#39;s mana circles until the epilogue availability period for this event ends at <span class=\\"local_date\\" data-local_date=\\"1592546399\\"><\/span>.<br><br>From <span class=\\"local_date\\" data-local_date=\\"1592546400\\"><\/span> onward, if you do not have any Wu Kong&#39;s convictions, you can use materials and mana instead to unlock mana nodes or unbind new mana circles.<br><br>\\u30fbEvent perk<br>While this event is active, the adventurer Wu Kong will have special abilities that activate in quests for this event. See Event Perks on the main event screen in-game for more information.<br><br>\\u30fbStarting with this raid event, you will no longer be able to use continues during raid battles.<br><br>Note: This event does not feature an event-exclusive 5\\u2605 dragon.<br><br>\\u25a0Event Duration<br><span class=\\"local_date\\" data-local_date=\\"1590559200\\"><\/span> to <span class=\\"local_date\\" data-local_date=\\"1591941599\\"><\/span><br>\\u30fbIf the event ends while you are in a quest, the quest will continue until the results have been determined. You will be able to earn rewards according to the results of the quest.<br><br>\\u25a0Reward Availability Period<br><span class=\\"local_date\\" data-local_date=\\"1590559200\\"><\/span> to <span class=\\"local_date\\" data-local_date=\\"1592546399\\"><\/span><br>\\u30fbYou will be able to perform blazon summons and obtain emblem rewards during this period.<br><br>\\u25a0Temporary Adventurers<br>When you complete quests, you will increase the friendship with any temporary adventurers in your team. If you maximize your friendship with a temporary adventurer, they will permanently remain in your collection, allowing you to include them in your team after the event ends. Their level, stats, equipment, and position in your team and collection will be maintained.<br>\\u30fbEven if an event adventurer isn&#39;t permanently added to your collection, any items used to upgrade their level or unlock their mana circles will not be returned.<br><br>\\u25a0Raid Battles<br>Raid battles are co-op battles where up to four teams (16 adventurers) can cooperate against a raid boss together! To participate in a raid battle, you must either create a room as the host or join a room as a guest.<br><br>\\u30fbAs a Host:<br>Creating a room requires otherworld fragments and getherwings.<br>You can obtain otherworld fragments from boss battles.<br><br>\\u30fbAs a Guest:<br>Joining a room requires otherworld fragments and getherwings.<br>You must have unlocked the respective difficulty to participate in a raid battle.<br><br>\\u25a0Extra Raid Battles<br>To challenge the Extra Raid Battle, you must clear the raid battle on Expert.<br><br>\\u30fbAs a Host:<br>Creating a room requires an otherworld gem.<br>You can obtain otherworld gems from the Expert, Nightmare, and Omega difficulty raid battles.<br><br>\\u30fbAs a Guest:<br>Joining a room requires an otherworld gem.<br>You must have cleared the Expert difficulty to participate in a raid battle.<br><br>\\u25a0Omega Difficulty<br>To challenge Omega difficulty, you must clear the raid battle on Nightmare difficulty. Additionally, to unlock Omega difficulty, you must collect three omega keys. You can obtain one omega key from each type of emblem rewards: bronze emblems, silver emblems, and gold emblems.<br><br>\\u30fbOmega (Solo)<br>This quest is for solo play only.<br>It will unlock when you clear the raid battle on Nightmare difficulty.<br><br>\\u30fbOmega Level 1 (Raid)<br>This quest is for co-op play only.<br>It will unlock when you clear the Omega battle in solo play.<br><br>\\u30fbOmega Level 2 (Raid)<br>This co-op only quest is even more challenging.<br>It will unlock when you clear the Omega Level 1 (Raid).<br><br>The Omega Level 1 (Raid) and Omega Level 2 (Raid) battles are only unlocked at certain times and will not be available at other times, even if you have met the conditions to unlock them.<br><br>Omega Level 1 (Raid) and Omega Level 2 (Raid) availability:<br>\\u30fb<span class=\\"local_date\\" data-local_date=\\"1591336800\\"><\/span> to <span class=\\"local_date\\" data-local_date=\\"1591509599\\"><\/span><br>\\u30fb<span class=\\"local_date\\" data-local_date=\\"1591768800\\"><\/span> to <span class=\\"local_date\\" data-local_date=\\"1591941599\\"><\/span><br><br>\\u25a0Raid Boosts<br>When you clear raid battles, you&#39;ll be able to get raid boosts, which power up adventurers for this event only.<br><br>Raid boosts you obtain will stack, and only apply to your team. The maximum effects you can achieve with raid boosts are described below.<br>\\u30fbDamage +100%<br>\\u30fbHP +50%<br>\\u30fbShapeshift Prep +25%<br>\\u30fbDragon Time +50%<br><br>The number of raid boosts you can obtain by clearing a single quest varies depending on the difficulty.<br>There are also special rare raid boosts.<br>\\u30fbIn this event, you will not be able to obtain rare raid boosts from boss battles.<br><br>Raid battle co-op rooms will display each team&#39;s boosted might, which factors in the increased power from raid boosts.<br>\\u30fbBoosted might does not affect the might required to start a quest.<br><br>\\u25a0Blazon Summons<br>Complete boss battles and raid battles to obtain peregrine blazons. Blazons collected can be used for blazon summoning to get Wu Kong&#39;s convictions, event-specific 4\\u2605 wyrmprints, and other rewards.<br><br>After obtaining Wu Kong&#39;s convictions through summoning, you can reset the contents available. From the 5th reset onward, you must accept all rewards before you can reset the contents available.<br><br>\\u25a0Emblems<br>You can obtain rewards, such as Wu Kong&#39;s convictions and event-specific wyrmprints, based on the total number of emblems you gather during the event.<br><br>\\u25a0Event Endeavors<br>Two types of event endeavors will be available during the event: Daily and Limited.<\/div><div><br>\\u25a0Epilogue<br>The epilogue for the Timeworn Torment will unlock at <span class=\\"local_date\\" data-local_date=\\"1591941600\\"><\/span>.<br>\\u30fbTo view the epilogue, you must complete chapter 6 of the event story.<br><br>\\u25a0Epilogue Availability<br><span class=\\"local_date\\" data-local_date=\\"1591941600\\"><\/span> to <span class=\\"local_date\\" data-local_date=\\"1592546399\\"><\/span><br><br>Notes:<br>1. During raid battles, you will only recover 1\/4 of the amount of HP from certain skills and abilities.<br>2. Players must have completed up to Chapter 2 \/ 2-1 (Normal) of the main campaign to participate in event quests.<br>3. Players must have completed up to Chapter 2 \/ 2-1 (Normal) of the main campaign in order to play co-op.<br>4. If you do not maximize your friendship with temporary adventurers during the event, they will not join you after the event ends, regardless of their level or stats.<br>5. If a temporary adventurer permanently joins your roster, you will be able to read their Adventurer Story.<br>6. You will not be able to use blazons, emblems, otherworld gems, or otherworld fragments obtained in this event in future events.<br>7. For details concerning this raid event, check the Help section on the raid event&#39;s top page in the game.<br><br>Thank you for playing Dragalia Lost.<br><br><span style=\\"color: rgb(226, 80, 65);\\"><strong>[Addendum <span class=\\"local_date\\" data-local_date=\\"1590630000\\"><\/span>]<\/strong><\/span><\/div><div>We have confirmed text issues occurring in the Timeworn Torment event.<br>Please note that text related to this event will be further amended in a data update scheduled to be applied around 11 PM PT, May 28, 2020.<\/div><div><br>Thank you for playing Dragalia Lost.<\/div>","start_time":1590559200,"prev_article_id":"1337","next_article_id":"1371","image_path":"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/13d17ab68fec1dce084e9b77ca345541.png","update_time":1590653969}}}'