b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":1457,"category_name":"Events","pr_category_id":"4","title_name":"Luminous Chimera Will Debut in Void Battles!","message":"<div>Luminous Chimera will appear in Void Battles starting <span class=\\"local_date\\" data-local_date=\\"1595397600\\"><\/span>.<\/div><div>Weapons you can craft using materials obtained from the Luminous Chimera will also be added.<\/div><div><br><\/div><div>With a booming peal of thunder, a chimera wreathed in light plunges from the heavens. Its white light radiates like the sun, descending to trample the land. Just as a bolt of lightning tears the sky apart, the beast stained by black mana raises its sharpened claws to vanquish all.<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/51f4be71d61760fe9530315edf2556ae.png\\"><\/div><div>Luminous Chimera (Light), Required Might: 13,000<\/div><div><br><\/div><div>\\u25a0New Weapons You Can Craft Using Materials Obtained from the Luminous Chimera<\/div><div>Powerful new weapons will be added to the Void weapon series lineup under Crafting starting <span class=\\"local_date\\" data-local_date=\\"1595397600\\"><\/span>.<\/div><div>You must have first obtained specific weapons before you can craft weapons using materials obtained from Luminous Chimera.<\/div><div>The required weapons are the light-attuned 5\\u2605 weapons that can be crafted using materials obtained from the Proud Manticore.<\/div><div><br><\/div><div>The weapon that is required differs based on the weapon type for the weapon you wish to craft. You can check the requirements by selecting Materials for the Luminous Chimera weapons on the Craft tab under Crafting.<\/div><div>Note: Weapons crafted using materials obtained from the Luminous Chimera cannot be dismantled.<\/div><div><br><\/div><div>Note:<\/div><div>Players must have completed up to Chapter 7 \/ 5-6 (Normal) of the main campaign to participate in Void Battles.<\/div><div><br><\/div><div>Thank you for playing Dragalia Lost!<\/div><div><br><\/div>","start_time":1594879200,"prev_article_id":"1437","next_article_id":"1463","image_path":"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/1b72098ea77741a5a33471e2d425867b.png","update_time":1594785016}}}'