b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":1756,"category_name":"Events","pr_category_id":"4","title_name":"Master Difficulty Is Coming to Tartarus\'s Wrath!","message":"<div>A new Master difficulty will be added to Tartarus&#39;s Wrath in The Agito Uprising (high-difficulty quests where you&#39;ll face powerful foes from a new organization) at <span class=\\"local_date\\" data-local_date=\\"1605074400\\"><\/span>. Clear it to earn materials required to refine light-attuned 6\\u2605 weapons!<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/74f8a402f2e82aed52063215e0cef277.png\\"><\/div><div>&quot;I will destroy this world of many sins,&quot; the Agito said.<\/div><div>&quot;In order avenge my fallen king,&quot; the Agito said.<\/div><div>&quot;Everything I do is for my king, for His Majesty, King Alberius.&quot;<\/div><div><br><\/div><div>The vengeful determination in the Agito&#39;s gloomy eyes tells of his uprising against all who took his master from him and lived. The dragon who descended half-clad in steel has a name, and that name is Tartarus.<\/div><div><br><\/div><div>\\u25a0Changes to Weekly Bonuses<\/div><div>Starting at <span class=\\"local_date\\" data-local_date=\\"1605074400\\"><\/span>, you will be able to obtain the material added in Tartarus&#39;s Wrath: Master in the weekly bonus for Tartarus&#39;s Wrath: Expert.<\/div><div><br><\/div><div>\\u25a0Changes to Survival Bonuses and the Number of Revives<\/div><div>Survival bonuses and the number of revives will change at <span class=\\"local_date\\" data-local_date=\\"1605074400\\"><\/span>. The number of revives in Tartarus&#39;s Wrath: Expert will be changed to one, and survival bonuses will be added. The number of revives in Tartarus&#39;s Wrath: Standard will be increased to two, and the survival bonus content will be changed.<\/div><div><br><\/div><div>Notes:<\/div><div>1. Players must have completed Chapter 10 \/ 6-3 (Normal) of the main campaign and any of the Standard difficulty Advanced Dragon Trials in solo or co-op play to play The Agito Uprising.<\/div><div>2. Players must have completed Tartarus&#39;s Wrath: Expert in solo or co-op play to play Tartarus&#39;s Wrath: Master in solo play.<\/div><div>3. Players must have completed Tartarus&#39;s Wrath: Expert in solo or co-op play to play Tartarus&#39;s Wrath: Master in co-op play.<\/div><div><br><\/div><div>Thank you for playing Dragalia Lost.<\/div><div><br><\/div>","start_time":1604642400,"prev_article_id":"1752","next_article_id":"1711","image_path":"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/74f8a402f2e82aed52063215e0cef277.png","update_time":1604045945}}}'