b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":1837,"category_name":"Updates","pr_category_id":"2","title_name":"Version Update [Update]","message":"<div><span style=\\"color: rgb(41, 105, 176);\\"><strong>[Addendum <span class=\\"local_date\\" data-local_date=\\"1608692400\\"><\/span>]<\/strong><\/span><\/div><div>As a token of our appreciation, the following item has been sent to players who started playing before <span class=\\"local_date\\" data-local_date=\\"1608692400\\"><\/span>.<\/div><div><br>\\u30fbTenfold Summon Voucher &times; 1<\/div><div><br>This gift can be claimed from your goodie box for up to seven days after reception. If the gift isn&#39;t retrieved within seven days, it will be lost.<\/div><div><br>Thank you for playing Dragalia Lost.<\/div><div><br><\/div><hr><div>Version 2.3.0 will be available for download around <span class=\\"local_date\\" data-local_date=\\"1608606000\\"><\/span>. You may install it when it becomes available; otherwise, an automatic update will occur at approximately <span class=\\"local_date\\" data-local_date=\\"1608692400\\"><\/span>.<\/div><div><br><\/div><div>When you update to version 2.3.0 and play co-op, you will no longer be matched with players using earlier versions of the game. Rooms created by players playing earlier versions will not display in the Room List, and you will not be able to join them using Find a Room, Join Nearby Players, Enter an ID, or alliance chat.<\/div><div><br><\/div><div>To celebrate the update, we&#39;ll be sending all players a Tenfold Summon Voucher after the automatic update. This notice will be modified after it has been distributed.<\/div><div>Note: The Tenfold Summon Voucher will not be distributed until after the automatic update, even if you complete the update to version 2.3.0 early.<\/div><div><br><\/div><div>\\u25a0Update Details<\/div><div>\\u25bcThe Alberian Battle Royale<\/div><div>A volcano-themed section of the map and new skill tokens will be added to the Alberian Battle Royale.<\/div><div><br><\/div><div>Players will be able to use the skins of adventurers in their roster and weapons in their inventory in The Alberian Battle Royale. Skins for adventurers already in your roster can be obtained with special tickets or traded for in the Treasure Trade. Please note that not all adventurer skins may be available. For further details, please see the separate notification <a href=\\"https:\/\/dragalialost.com\/en\/news\/detail\/1844\\">regarding adjustments to the Alberian Battle Royale with Version 2.3.0<\/a> is released.<\/div><div><br><\/div><div>\\u25bcRaid Events In the Event Compendium<\/div><div>Raid events will be added to the Event Compendium, a feature that allows players to experience a selection of past events at their leisure. We encourage newer players to dive into these events and catch up on the major story beats while recruiting various temporary adventurers into their roster permanently.<\/div><div><br><\/div><div>The Fractured Futures and Forgotten Truths raid events will be added at <span class=\\"local_date\\" data-local_date=\\"1608703200\\"><\/span>.<\/div><div><br><\/div><div>The difficulty of these events and quests will be adjusted to be comparable to others in the Event Compendium. Players may not participate in a facility event at the same time as a raid event in the Event Compendium. Raid events added to the Event Compendium may return in the future.<\/div><div><br><\/div><div>Players must complete Chapter 6 \/ 4-4 of the main campaign on Normal difficulty to play the Fractured Futures raid event and Chapter 14 \/ 4-9 of the main campaign on Normal difficulty to play the Forgotten Truths raid event in the Event Compendium.<\/div><div><br><\/div><div>Raid events in the Event Compendium differ from standard raid events in the following ways:<\/div><div><br><\/div><div>\\u30fbOnly solo play is available for quests.<\/div><div>\\u30fbItems exclusive to raid events such as blazons, emblems, and otherworld fragments may not be collected.<\/div><div>\\u30fbBlazon summons, emblem rewards, and raid boosts are not available.<\/div><div>\\u30fbInstead of joining you temporarily during the event, event-exclusive adventurers will join your roster permanently after you clear a certain quest.<\/div><div>\\u30fbConviction items (used to upgrade event-exclusive adventurers) may not be collected.<\/div><div>\\u30fbEvent-exclusive adventurers will not provide event-related advantages during quests.<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/b909722a187299ac1ad11356c3c4fc87.png\\"><\/div><div><br><\/div><div>A new high-difficulty quest involving Morsayati will be added to the Forgotten Truths raid event at <span class=\\"local_date\\" data-local_date=\\"1610604000\\"><\/span>. Players who have viewed the epilogue for the Forgotten Truths event in the Event Compendium may undertake this new challenge on their own or with the help of other players in a raid battle. Further details will be provided in the corresponding in-game notification.<\/div><div><br><\/div><div>\\u25a0Other Changes<\/div><div>\\u30fbThe Home screen will feature a New Year&#39;s-themed design starting at <span class=\\"local_date\\" data-local_date=\\"1609394400\\"><\/span>.<\/div><div>\\u30fbThe behavior that occurs when an overdamage buff is granted on top of an existing buff will be adjusted as follows:<br>Before: If a new overdamage buff is granted while an existing one is already active, the existing buff will be replaced with the newly-granted buff regardless of its potency or duration.<br>After: If a new overdamage buff is granted while an existing one is already active, the existing buff will be replaced if the newly-granted buff has a higher potency. If the existing buff has the same potency as the newly-granted buff, it will be replaced if the newly-granted buff has a longer duration. If the existing buff has the same potency and duration as the newly-granted buff, it will be replaced with the newly-granted buff.<\/div><div>\\u30fbThe user interface will be adjusted in various places.<\/div><div><br><\/div><div>\\u25a0Issues To Be Addressed<\/div><div>\\u30fbSince the release of version 2.2.0, there are instances where notifications aren&#39;t received on Android devices, regardless of the notification settings.<\/div><div>\\u30fbIf the adventurer Pinon is equipped with the Free-Spirited Opera wymrprint, the debuff inflicted by the wyrmprint&#39;s Strength -10% &amp; Strength Debilitator effect that reduces the enemy strength&#39;s by X% for 10 seconds may be inflicted on Pinon when she performs a normal attack combo while under the effects of the Locked Sigil debuff.<\/div><div>\\u30fbWhile playing Morsayati Clash on Omega Level 1 (Raid), Omega Level 2 (Raid), or Omega Level 3 (Raid) difficulties, if the host player&#39;s connection is interrupted under certain conditions, obelisks may not appear on the devices of guest players.<\/div><div>\\u30fbWhile playing Morsayati Clash on Omega Level 1 (Raid), Omega Level 2 (Raid), or Omega Level 3 (Raid) difficulties, when Morsayati attempts to use the Otherworldly Refulgence skill, certain action markers may disappear before the attack is completed.<\/div><div>\\u30fbIn Ayaha &amp; Otoha&#39;s Wrath on Standard and Expert difficulties, when Ayaha &amp; Otoha (human form) use their Hakkeyoi skill, adventurers who perform certain actions on guest devices sometimes are restrained outside of the restraint effect and will not be hit by Otoha&#39;s attack after that.<\/div><div>\\u30fbIn Ayaha &amp; Otoha&#39;s Wrath on Expert difficulty, the circular action marker does not always display when Ayaha &amp; Otoha (beast form) use their Hana Ichi Monme skill.<\/div><div><br><\/div><div>Notes:<\/div><div>1. It may take time for the store to reflect the updated information. Players may not be able to perform updates due to their device&#39;s data cache being full. If you are unable to perform the update, restart your device, and then try downloading it from the store.<\/div><div>2. Any adventurers and game screenshots shown are still in development.<\/div><div><br><\/div><div>Thank you for playing Dragalia Lost.<\/div>","start_time":1608012000,"prev_article_id":"1787","next_article_id":"1931","image_path":"","update_time":1608692476}}}'