b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":2212,"category_name":"Events","pr_category_id":"4","title_name":"A New Event, The Children of Yggdrasil, Is Coming!","message":"<div>The Children of Yggdrasil event starts on <span class=\\"local_date\\" data-local_date=\\"1622181600\\"><\/span>.<\/div><div><br><\/div><div>During this limited-time invasion event, defeat as many enemies as possible before time runs out to earn points. You&#39;ll be rewarded for your effort with wyrmprints, weapon skins, and more, so be sure to check it out!<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/356d675f0feb478f2197bc4b9c445a1b.png\\"><\/div><div>This event&#39;s theme song is &quot;Unique&quot; by WON.<\/div><div><br><\/div><div>\\u25a0Event Overview<\/div><div>By clearing various event quests, you can earn rewards like wyrmprints and materials. You must face a huge number of enemies during invasion quests that only increases as time goes on. Defeat as many as you can to put a stop to these menacing fiends!<\/div><div><br><\/div><div>\\u25a0Co-op (Quick Play)<\/div><div>Invasion quests on Standard and Expert difficulty feature a special co-op system that does not require players to create rooms to play together. Simply choose your desired difficulty and team and you will be automatically matched with other players.<\/div><div><br><\/div><div>\\u25a0Invasion Quests<\/div><div>These quests can be played in either solo play or co-op play and the focus is on defeating as many enemies as possible within the allotted time. You&#39;ll have to use skills and shapeshifting to stand fast against the ever-increasing tide of enemies, but also note that some enemies have special characteristics. This time, they&#39;ll be weak to long-range attacks.<\/div><div><br><\/div><div>These quests don&#39;t have any defeat conditions and the amount of rewards you receive depends on the number of enemies you defeat, so focus on taking down as many enemies as you can as quickly as you can!<\/div><div><br><\/div><div>\\u25a0Reward Quests<\/div><div>Obtain enigmatic vouchers from daily endeavors and use them to take on solo play-exclusive quests that feature only enemies who reward a large number of points when defeated.<\/div><div><br><\/div><div>\\u25a0Notes<\/div><div>1. Players must have completed up to Chapter 2 \/ 2-1 (Normal) of the main campaign to participate in event quests.<\/div><div>2. Players must have completed up to Chapter 2 \/ 2-1 (Normal) of the main campaign to play co-op.<\/div><div><br><\/div><div>Thank you for playing Dragalia Lost.<\/div>","start_time":1621836000,"prev_article_id":"2214","next_article_id":"2224","image_path":"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/356d675f0feb478f2197bc4b9c445a1b.png","update_time":1623740931}}}'