b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":2396,"category_name":"Events","pr_category_id":"4","title_name":"A New Event, Drifting Sorrows, Is Now Live!","message":"<div>A new event, Drifting Sorrows, started on <span class=\\"local_date\\" data-local_date=\\"1628748000\\"><\/span>.<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/0df263368e0c10e87daa76f2751bb24e.png\\"><\/div><div><br><\/div><div>\\u25a0Event Overview<\/div><div>Drifting Sorrows is an onslaught event in which you must take on hordes of attacking enemies. Enemy attacks will get fiercer with each increase in difficulty level. What&#39;s more, dragon challenge battles and boss battles that pit you against massive fiends await in the All-Out Assault quests, which are the final quests for each difficulty level.<\/div><div><br><\/div><div>If you succeed in defeating enemies and defending an area, you can obtain a special Victory Reward. Use your full might to repel the walking dead and win peace for New Alberia!<\/div><div><br><\/div><div>Additionally, in the Drifting Sorrows event, Astral Volk Assault appears as an EX quest on Master difficulty. Be sure to challenge this single-adventurer dragon battle that pits you against a powerful foe&mdash;it&#39;s said to be the equal of an Agito!<\/div><div><br><\/div><div>\\u25a0Rewards<\/div><div>In the Drifting Sorrows event, you can get flame tomes and wind tomes, which can unlock shared skills for flame- and wind-attuned adventurers, as well as items that restore stamina, as glory rewards.<\/div><div><br><\/div><div>\\u25a0Event Duration<\/div><div><span class=\\"local_date\\" data-local_date=\\"1628748000\\"><\/span> to <span class=\\"local_date\\" data-local_date=\\"1629439199\\"><\/span><\/div><div><br><\/div><div>\\u25a0Reward Availability Period<\/div><div><span class=\\"local_date\\" data-local_date=\\"1628748000\\"><\/span> to <span class=\\"local_date\\" data-local_date=\\"1630043999\\"><\/span><\/div><div><br><\/div><div>\\u25a0Story<\/div><div>In Drifting Sorrows, you can enjoy a new story about allies fighting with all of their might to protect various areas. You can use the limited-time item, war chronicles, to read the story.<\/div><div><br><\/div><div>Note: The story for Drifting Sorrows will be partially voiced instead of fully voiced in Japanese.<\/div><div><br><\/div><div>\\u25a0Playing the Event<\/div><div>Drifting Sorrows has multiple quests for each difficulty (Beginner, Standard, Expert, and Master).<\/div><div><br><\/div><div>At the start of an onslaught event, only one beginner quest will be unlocked. More quests can be unlocked using battle charts, items that are unique to the event. After clearing all of the quests for a difficulty, you will receive a Victory Reward and the next difficulty will be unlocked.<\/div><div><br><\/div><div>To challenge the EX quest, you must collect battle charts to unlock the quest, then use a stratagem. Stratagems can be obtained from certain quests in the Drifting Sorrows event, or as glory rewards, which are described below.<\/div><div><br><\/div><div>\\u25a0Glory Rewards<\/div><div>Glory points are event-exclusive points that can be earned by clearing event quests. Collect them to earn all kinds of rewards! These rewards include limited-time items such as battle charts, stratagems, and war chronicles, which can be used to unlock quests and new stories in Drifting Sorrows.<\/div><div><br><\/div><div>You can get battle charts by clearing quests in the Drifting Sorrows event and collecting glory. You cannot obtain battle charts as drop rewards.<\/div><div><br><\/div><div>\\u25a0Castle Stories<\/div><div>You can read castle stories by using looking glasses, which can be obtained as glory rewards.<\/div><div><br><\/div><div>Note: No new castle stories will be added during this event.<\/div><div><br><\/div><div>\\u25a0Dragon Battles<br>Dragon battles are solo quests unique to onslaught events in which you remain shapeshifted for the entire duration of the quest.<br><br>Some dragon battles involve defeating a single boss, while others require you to defeat multiple waves of enemies. For dragon battles that involve defeating a single boss, you must defeat the boss for the quest to count as cleared. For dragon battles that involve defeating waves of enemies, you must clear the final wave for the quest to count as cleared.<br><br>Adventurers must equip a dragon to participate. Adventurers that have a dragondrive are unable to participate in dragon battles even if they have a dragon equipped. Tiki may participate in dragon battles, even though she shapeshifts into a special Divine Dragon form instead of regular shapeshifting.<br><br>The adventurer that you are controlling will automatically shapeshift at the start of the quest and their shapeshift will have an unlimited duration. Unlike standard shapeshifting, you will take damage from enemy attacks. You will fail the quest if the HP of all of the adventurers in your team reaches zero.<br><br>Additionally, you will start the quest with your skill gauge filled, so you can use your skill as soon as the quest starts. Unlike standard shapeshifting, attacking enemies will charge your skill gauge and you will be able to use skills as many times as your skill gauge fills.<br><br>Some dragon battles are limited to a single adventurer, while others require four adventurers to participate. The rules vary slightly in both cases. In single-adventurer dragon battles, you can only select one adventurer to participate.<br><br>The team creation for dragon battles limited to a single adventurer is separate from your normal teams and is unique to these quests. The team creation for dragon battles that require four adventurers uses your normal teams, and all eligible adventurers can participate. If the team includes adventurers who use dragondrive instead of shapeshifting, a message that says &quot;Adventurers that have a dragondrive are unable to participate in dragon battles&quot; will display.<br><br>During dragon battles that require four adventurers, the adventurer you are controlling will automatically switch at the beginning of each wave. Only on the final wave of these quests will you be able to freely switch the adventurer that you are controlling. You cannot switch the shapeshifted adventurer you are controlling in the first or middle waves.<br><br>\\u25a0Treasure Trade Rewards<br>You can earn primal crystals by playing event quests and trade them for various rewards on the Treasure Trade menu.<br><br>\\u25a0Endeavors<br>These endeavors can only be attempted for the duration of the event. They are separated into Daily and Limited variations. By accomplishing these endeavors, you can receive various rewards.<br><br>Notes:<br>1. You can see more details about the Drifting Sorrows event by tapping Help on the event page.<br>2. Players must have completed up to Chapter 2 \/ 2-1 (Normal) of the main campaign to participate in event quests.<br>3. If the event ends while you are playing an event quest, the quest will continue until results have been determined, and you will be able to gain the rewards shown.<br>4. You will not be able to use primal crystals, battle charts, stratagems, or war chronicles obtained in this event in future events.<br><br>Thank you for playing Dragalia Lost.<\/div>","start_time":1628748000,"prev_article_id":"2388","next_article_id":"2398","image_path":"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/0df263368e0c10e87daa76f2751bb24e.png","update_time":1627978058}}}'