b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":2751,"category_name":"News","pr_category_id":"1","title_name":"Regarding an Issue Making Certain Quests Playable Even If Their Unlock Conditions Aren\'t Met","message":"<div>[Addendum <span class=\\"local_date\\" data-local_date=\\"1643090400\\"><\/span>]<br>The following issue was addressed around <span class=\\"local_date\\" data-local_date=\\"1643090400\\"><\/span>:<br><br>\\u30fbSome Primal Dragon Trials quest banners appear unlocked even though the unlock conditions haven&#39;t been met. When starting a quest in this case, a &quot;This quest has not yet been unlocked.&quot; error message is displayed.<br><br>Thank you for playing Dragalia Lost.<\/div><hr><div>We have confirmed an issue where the following quests were becoming playable after skipping the main campaign even if their unlock conditions weren&#39;t cleared yet:<\/div><div>\\u30fbRise of the Sinister Dominion<\/div><div>\\u30fbPrimal Dragon Trials<\/div><div><br><\/div><div>This issue has now been resolved.<\/div><div><br><\/div><div>If you have cleared any of the quests above without first clearing their unlock conditions while the issue was occurring, the corresponding missions will be marked as cleared. However, attempting to play these quests again before clearing their unlock conditions will display a &quot;This quest has not yet been unlocked&quot; message, and you will not be able to play them.<\/div><div>You will be able to play them once again after clearing the unlock conditions.<\/div><div>Note: You will not be able to obtain the first clear mission reward for these quests.<\/div><div><br><\/div><div>We have also confirmed a separate issue in the Primal Dragon Trials, where the quest banner will be unlocked even if you haven&#39;t cleared the unlock conditions yet, and attempting to play these quests will display a &quot;This quest has not yet been unlocked&quot; error message.<\/div><div>We plan to address this issue in a future update.<\/div><div><br><\/div><div>Thank you for playing Dragalia Lost.<\/div><div><br><\/div>","start_time":1641448800,"prev_article_id":"2739","next_article_id":"2730","image_path":"","update_time":1643096361}}}'