b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":3037,"category_name":"Updates","pr_category_id":"2","title_name":"Version Update [Update]","message":"<div><span style=\\"color: rgb(41, 105, 176);\\"><strong>[Addendum <span class=\\"local_date\\" data-local_date=\\"1648177200\\"><\/span>]<\/strong><\/span><\/div><div>As a token of our appreciation, the following item has been sent to players who started playing before <span class=\\"local_date\\" data-local_date=\\"1648177200\\"><\/span>.<\/div><div><br>\\u30fbTenfold Summon Voucher &times; 1<\/div><div><br>This gift can be claimed from your goodie box for up to seven days after reception. If the gift isn&#39;t retrieved within seven days, it will be lost.<\/div><div><br><\/div><hr><div><span style=\\"color: rgb(41, 105, 176);\\"><strong>[Addendum <span class=\\"local_date\\" data-local_date=\\"1648090800\\"><\/span>]<\/strong><\/span><br>The name of the version update releasing on <span class=\\"local_date\\" data-local_date=\\"1648090800\\"><\/span> will be changed as follows:<br><br>\\u25a0Before<br>Ver. 2.18.0<br><br>\\u25a0After<br>Ver. 2.18.1<br><br>This change does not affect the content of the update.<\/div><div><br><\/div><hr><div>Version 2.18.0 will be available for download around <span class=\\"local_date\\" data-local_date=\\"1648090800\\"><\/span>. You may install it when it becomes available; otherwise, an automatic update will occur around <span class=\\"local_date\\" data-local_date=\\"1648177200\\"><\/span>.<\/div><div><br><\/div><div>When you update to version 2.18.0 and play co-op, you will no longer be matched with players using earlier versions of the game. Rooms created by players using earlier versions will not display in the Room List, and you will not be able to join them using Find a Room, Join Nearby Players, Enter an ID, or alliance chat.<\/div><div><br><\/div><div>To celebrate the update, we&#39;ll be sending all players a Tenfold Summon Voucher after the automatic update. This notice will be updated after it has been distributed.<\/div><div><br><\/div><div>Note: The Tenfold Summon Voucher will not be distributed until after the automatic update, even if you complete the update to version 2.18.0 early.<\/div><div><br><\/div><div>\\u25a0Update Details<\/div><div>\\u30fbThe number of players necessary to start a match in the Alberian Battle Royale will be reduced on <span class=\\"local_date\\" data-local_date=\\"1648360800\\"><\/span>. This change will not affect the maximum number of participants, which remains at 16 (including AI-controlled adventurers).<\/div><div><br><\/div><div>\\u30fbThe dragon Mini Jupi will be added to the fafnir medals section of the Trade Treasure on <span class=\\"local_date\\" data-local_date=\\"1648360800\\"><\/span>.<\/div><div><br><\/div><div>\\u30fbThe number of times that players can obtain the social reward, which can be obtained by playing co-op with another player for the first time, will be reset on <span class=\\"local_date\\" data-local_date=\\"1648360800\\"><\/span>. After clearing a quest, you can get 50 wyrmite per player (up to 50 times).<\/div><div><br><\/div><div>\\u30fbFloors 51 through 60 will be added to the Kaleidoscape and additional balance adjustments will be made on <span class=\\"local_date\\" data-local_date=\\"1650866400\\"><\/span>. For further details, please see the corresponding in-game notification upon its release.<\/div><div><br><\/div><div>\\u30fbTrials of the Mighty quests will be changed to follow a rotating two-week schedule on <span class=\\"local_date\\" data-local_date=\\"1651039200\\"><\/span>. With this change, each Trials of the Mighty quest will become available at some point during a repeating four-week window.<\/div><div><br><\/div><div>\\u30fbSupport for upcoming adventurers and quests scheduled to appear in late March and beyond will be added and certain unresolved issues will be addressed.<\/div><div><br><\/div><div><span style=\\"color: rgb(41, 105, 176);\\"><strong>[Addendum <span class=\\"local_date\\" data-local_date=\\"1648101600\\"><\/span>]<\/strong><\/span><br>\\u30fbCo-op play for the main campaign quest Chapter 1 \/ 3-3 &quot;A True Pact&quot; will no longer be available on Normal difficulty starting <span class=\\"local_date\\" data-local_date=\\"1648360800\\"><\/span>.<\/div><div><br><\/div><div>\\u25a0Other Changes<\/div><div>\\u30fbCertain parts of the hair on the adventurer Gala Zethia&#39;s 3D model will be adjusted on <span class=\\"local_date\\" data-local_date=\\"1648360800\\"><\/span>.<\/div><div><br><\/div><div>Notes:<\/div><div>1. It may take time for the store to reflect the updated information. Players may not be able to perform updates due to their device&#39;s data cache being full. If you are unable to perform the update, restart your device, and then try downloading it from the store.<\/div><div>2. Any adventurers and game screenshots shown are still in development.<\/div><div><br><\/div><div>Thank you for playing Dragalia Lost.<\/div>","start_time":1647486000,"prev_article_id":"2914","next_article_id":"3277","image_path":"","update_time":1648177205}}}'