b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":569,"category_name":"News","pr_category_id":"1","title_name":"What\'s Ahead for Dragalia Lost, Part 5","message":"<div>Hello, everyone! My name is Okada, and I&#39;ve recently taken on the role of director for Dragalia Lost. Thank you for playing the game!<\/div><div>I&#39;ll continue the tradition of sharing information and updates about future events via What&#39;s Ahead for Dragalia Lost, so let&#39;s jump right in!<\/div><div><br><\/div><div><strong>\\u25a0Event Information<\/strong><\/div><div><br><\/div><div>\\u30fbAs a promotion during the month of July, everyone will get one free summon each Saturday and Sunday.<\/div><div><br><\/div><div>\\u30fbThe Flames of Reflection event, where you can get a facility that boosts flame-attuned adventurers, will start <span class=\\"local_date\\" data-local_date=\\"1562824800\\"><\/span>.<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/a846dca1aae981a566e2db2dea09d598.png\\"><\/div><div>This event&#39;s story focuses on the blacksmith Ramona, who appears when you build the smithy, and her sisters. I hope you&#39;re looking forward to learning about them!<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/3c6d04156282eee3c7854bfc7e53db41.png\\"><\/div><div>What&#39;s more, Ramona and her sisters will all appear as adventurers during a summon showcase that will be available along with this event. Ramona offers a new kind of action, so keep an eye out for that too.<\/div><div><br><\/div><div>\\u30fbChapter 9 of the main campaign will be added <span class=\\"local_date\\" data-local_date=\\"1563170400\\"><\/span>. It will feature Chelle, the third heir.<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/481164ec4514d08069d90c11a9587a4e.png\\"><\/div><div><br><\/div><div>\\u30fbWe are planning to add a new Advanced Dragon Trial in late July.<\/div><div>We&#39;ll have more information to share on this soon.<\/div><div><br><\/div><div><br><\/div><div><strong>\\u25a0Regarding the New Augments Feature and Astral Raids<\/strong><\/div><div><br><\/div><div>\\u30fbThe upgrade feature &quot;augments&quot; will become available when you clear chapter 9 of the main campaign.<\/div><div>You&#39;ll be able to upgrade adventurers, weapons, dragons, and wyrmprints even further by using items specific to each. Each one can have its HP and strength raised up to +50 on the Upgrade screen.<\/div><div><br><\/div><div>\\u30fbA new game mode, Astral Raids, will start <span class=\\"local_date\\" data-local_date=\\"1563602400\\"><\/span>.<\/div><div>Tackle quests Monday through Friday to earn astral pieces, which can be used to fight bosses in Astral Raids on Saturday and Sunday.<\/div><div>You can start getting astral pieces at <span class=\\"local_date\\" data-local_date=\\"1562824800\\"><\/span>. You&#39;ll also be able to get them from the Flames of Reflection facility event!<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/011f0d1be28deb9ad8be621a29e7529a.png\\"><\/div><div>The boss for Astral Raids will change every week, and sometimes even include bosses you fought in past raid battles. However, Astral Raids will not be available during other raid events.<\/div><div>The number of times you can attempt Astral Raids is limited; however, you&#39;ll be able to earn a variety of rewards you can use for upgrading. Our hope is that this will encourage players to complete quests on the weekdays, then spend the weekends playing co-op with each other to upgrade their adventurers.<\/div><div><br><\/div><div>\\u30fbIn the Expert and Master difficulties for Astral Raids, you&#39;ll be able to get items for upgrading via augments.<\/div><div>At first, you&#39;ll only get items for upgrading via adventurer and wyrmprint augments, but we&#39;ll add items for dragons and weapons in a future update.<\/div><div><br><\/div><div>\\u30fbWe&#39;re also planning to add additional levels to The Mercurial Gauntlet along with augments.<\/div><div><br><\/div><div><br><\/div><div><strong>\\u25a0Regarding Future Features<\/strong><\/div><div><br><\/div><div>\\u30fbWe&#39;re currently developing an alliances feature, which will allow you to create co-op rooms and chat with members of your alliance.<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/597f826871c50a068c1dd22eb49faaa6.png\\"><\/div><div><br><\/div><div>\\u30fbWith the increasing complexity of Dragalia Lost, there are many conditions that factor into creating a co-op room. We hope to address the need for more detailed co-op room creation by allowing players to use the alliance feature to discuss strategy via chat and recruit for co-op within their alliances. This will make it easier to help new players prepare for battle, and to go into battle with a group strategy.<\/div><div><br><\/div><div>\\u30fbWe&#39;ll provide more details on when you can expect this in the future.<\/div><div><br><\/div><div><br><\/div><div><strong>\\u25a0In Conclusion<\/strong><\/div><div><br><\/div><div>\\u30fbDragalia Lost is a game of deep action and a wide variety of adventurers, but we&#39;re also aiming to make it an even smoother experience.<\/div><div><br><\/div><div>\\u30fbTo that end, we hope that the addition of The Mercurial Gauntlet (which can be tackled at any time), Astral Raids (where players can go all-out in co-op on the weekends), and alliances (where players can create co-op rooms and talk strategy) will make the game easier to play.<\/div><div><br><\/div><div>\\u30fbWe are planning even more new elements and content, so keep an eye out for future updates!<\/div><div><br><\/div><div>Also, to express our gratitude, we&rsquo;ll be sending a gift to all players.<\/div><div>I hope you put it to good use in your future adventures in Dragalia Lost.<\/div><div><br><\/div><div>\\u25a0Gift Content<\/div><div>Wyrmite x500<\/div><div>Gold crystal x100<\/div><div>Gold whetstone x100<\/div><div>Consecrated water x200<\/div><div>Succulent dragonfruit x100<\/div><div><br><\/div><div>And, as always, thank you for playing Dragalia Lost.<\/div><div><br><\/div><div>Yuji Okada<\/div><div>Director, Dragalia Lost<\/div><div><br><\/div><div><br><\/div><div>Notes:<\/div><div>\\u30fbThe gift can be claimed from your goodie box for up to seven days after logging in. If the gift isn&rsquo;t retrieved within seven days, it will be lost.<\/div><div>\\u30fbSummon showcase, event, and update content may change without notice.<\/div><div>\\u30fbAny adventurers and game screenshots shown are still in development.<\/div>","start_time":1562306400,"prev_article_id":"565","next_article_id":"542","image_path":"","update_time":1569489890}}}'