b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":677,"category_name":"Events","pr_category_id":"4","title_name":"New Void Enemies and Void Battle Limited-Time Endeavors![Update]","message":"<div><span style=\\"color: rgb(44, 130, 201);\\"><strong>[Addendum <span class=\\"local_date\\" data-local_date=\\"1566873000\\"><\/span>]<\/strong><\/span><\/div><div>\\u30fbWeighty Arms (axe) was added as a potential drop reward for golems such as the Steel Golem.<\/div><div><br><\/div><hr><div><span style=\\"color: rgb(44, 130, 201);\\"><strong>[Addendum <span class=\\"local_date\\" data-local_date=\\"1566461400\\"><\/span>]<\/strong><\/span><\/div><div>The original announcement stated that &quot;[The double drops event] does not apply to weapons, wyrmprints, or astral pieces.&quot; It should have read &quot;[The double drops event] does not apply to ravishing roses, weapons, wyrmprints, or astral pieces.&quot;This has now been corrected.<\/div><div><br><\/div><div>Thank you for playing Dragalia Lost.<\/div><div><br><\/div><hr><div>New Void enemies will be added to Void Battles (event quests where you can battle powerful boss enemies) at <span class=\\"local_date\\" data-local_date=\\"1566453600\\"><\/span>!<\/div><div><br><\/div><div>You can craft new weapons using the materials obtained by defeating the newly added Void enemies. Additionally, crafting material items will be added to the Treasure Trade for Void Battles for a limited time.<\/div><div><br><\/div><div>Furthermore, Limited Void Battle Endeavors will be available between <span class=\\"local_date\\" data-local_date=\\"1566453600\\"><\/span> and <span class=\\"local_date\\" data-local_date=\\"1567231199\\"><\/span>!<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/0ae5f572d2ddb581c5928f818922e144.png\\"><\/div><div>One day, the Prince and his companions received a call for help from a neighboring city in peril. Black-mana-transformed dragons, among other terrors, are wreaking havoc!<\/div><div><br><\/div><div>\\u25a0New Void Enemies<\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/73c27db8eaa94c95e56f34a1415bac3a.png\\"><\/div><div>Scalding Shroom (Flame), Required Might: 9,000<\/div><div>Watch out for the Burn affliction and its Disperse ability, which it uses to make lots of enemies appear!<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/2911ffb75031c2855097be0e51735d6b.png\\"><\/div><div>Twilight Hermit (Shadow), Required Might: 10,000<\/div><div>This powerful foe uses its Propagation ability to duplicate itself! You&#39;ll also need to watch out for the Poison affliction, which it inflicts via area of effect attacks!<\/div><div><br><\/div><div>\\u25a0Crafting<\/div><div>Craftable weapons will be added.<\/div><div>\\u30fbAxes have been added to the weapon types that can be crafted using materials obtained from golems such as the Steel Golem.<\/div><div>\\u30fbThe Scent and other weapons crafted using materials obtained from the Scalding Shroom can be enhanced into shadow-attuned weapons with the Fury Penetrator ability.<\/div><div>\\u30fbFiendcutter and other weapons crafted using materials obtained from the Twilight Hermit can be enhanced into flame-attuned weapons with the Petrify Res ability.<\/div><div>Note: The Petrify Res ability will be useful against enemies scheduled to appear in a future update.<\/div><div>\\u30fbGracebringer and other weapons crafted using materials obtained from the Void Jeanne d&#39;Arc can be enhanced into light-attuned weapons with the HP 50% = Strength +7% ability.<\/div><div><br><\/div><div>\\u25a0Limited-Time Items Added to the Void Battles Treasure Trade<\/div><div>The Void Battles Treasure Trade will feature crafting-material items for a limited time!<\/div><div>You can combine materials from the Scalding Shroom and Twilight Hermit with materials from other Void enemies to trade for materials required to craft various Void weapons.<\/div><div>Use this opportunity to defeat lots of Void enemies and power up your Void weapons!<\/div><div>Note: Materials added to the Treasure Trade for a limited time also have restrictions on the number of trades possible.<\/div><div><br><\/div><div>\\u25a0Availability for Limited-Time Items in the Void Battles Treasure Trade<\/div><div><span class=\\"local_date\\" data-local_date=\\"1566453600\\"><\/span> to <span class=\\"local_date\\" data-local_date=\\"1567402199\\"><\/span><\/div><div>Note: After the duration has ended, you will no longer be able to trade for the limited-time materials.<\/div><div><br><\/div><div>\\u25a0Void Battles Schedule<\/div><div>You can play Void Battles anytime, regardless of the day of the week. However, the Void enemies that appear will differ based on the day. Check out the Void Battles Schedule notification for information about when each Void enemy is scheduled to appear.<\/div><div><a href=\\"https:\/\/dragalialost.com\/en\/news\/detail\/19999\\">\\u3010Void Battles Schedule\\u3011<\/a><\/div><hr><div><br><\/div><div>Limited-Time Endeavors:<\/div><div>To celebrate the addition of the new Void enemies, we&#39;re adding Limited Void Battle Endeavors! These are separated into Daily and Limited variations. You can complete the endeavors to obtain various rewards.<\/div><div><br><\/div><div>While the Limited Void Battle Endeavors are active, a wide variety of Void enemies will appear each day!<\/div><div><br><\/div><div>\\u25a0Limited Void Battle Endeavors Duration<\/div><div><span class=\\"local_date\\" data-local_date=\\"1566453600\\"><\/span> to <span class=\\"local_date\\" data-local_date=\\"1567231199\\"><\/span><\/div><hr><div><br><\/div><div>Void Battles Double Drops Event:<\/div><div>The drop rewards obtained from the following quests will be doubled for the duration of the event.<\/div><div>Note: This does not apply to ravishing roses, weapons, wyrmprints, or astral pieces.<\/div><div><br><\/div><div>\\u30fbScalding Shroom Strike<\/div><div>\\u30fbTwilight Hermit Strike<\/div><div>\\u30fbGreedy Manticore Strike<\/div><div>\\u30fbVoid Jeanne d&#39;Arc Strike<\/div><div><br><\/div><div>\\u25a0Void Battles Double Drops Event Duration<\/div><div><span class=\\"local_date\\" data-local_date=\\"1566453600\\"><\/span> to <span class=\\"local_date\\" data-local_date=\\"1567231199\\"><\/span><\/div><hr><div><br><\/div><div>Quest Adjustments:<\/div><div>We will adjust the parameters of Void enemies and add Dragon Obelisks to the following quests to make them easier to complete.<\/div><div>Note: These changes will be applied at <span class=\\"local_date\\" data-local_date=\\"1566451800\\"><\/span>.<\/div><div>\\u30fbGust Shroom Strike<\/div><div>\\u30fbWandering Shroom Strike<\/div><div>\\u30fbBlazing Ghost Strike<\/div><div>\\u30fbViolet Ghost Strike<\/div><div><br><\/div><div>Notes:<\/div><div>1. For more information about Void Battles, tap Events on the main page, then go to the Void Battles page and select Help.<\/div><div>2. For more information about Void enemies, tap Events on the main page, then go to the Void Battles page and check Details on the various quest pages.<\/div><div>3. You can check the Endeavors added for a limited time by tapping Endeavors on the main page, then selecting the Daily or Limited tabs.<\/div><div>4. Players must have completed up to Chapter 7 \/ 5-6 (Normal) of the main campaign in order to participate in Void Battles.<\/div><div><br><\/div><div>Thank you for playing Dragalia Lost.<\/div>","start_time":1566453600,"prev_article_id":"665","next_article_id":"673","image_path":"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/d85f904589f05c57802a98be59a27c7e.png","update_time":1569480781}}}'