b'{"data_headers":{"result_code":1},"data":{"information":{"article_id":782,"category_name":"News","pr_category_id":"1","title_name":"This Month in Dragalia Lost","message":"<div>Hello, everyone! Yuji Okada here, director of Dragalia Lost.<\/div><div><br><\/div><div>I hope you enjoyed the recent Dragalia Digest! I do have some experience with live broadcasts, but this sort of edited video was a first for me... So I was pretty nervous!<\/div><div><br><\/div><div>In that Dragalia Digest, I talked about some of the plans for the future of Dragalia Lost. Now it&#39;s time to dive a bit deeper.<\/div><div><br><\/div><hr><div><br><\/div><div>First, I&#39;d like to give an overview of the Mega Man event teased at the end of the Dragalia Digest.<\/div><div><br><\/div><div>\\u25a0About the Mega Man Event<\/div><div>The Mega Man event is scheduled to occur at the the end of November.<\/div><div><br><\/div><div>In it, you&#39;ll be able to add Mega Man to your team as a temporary adventurer. You can increase your friendship with him by clearing quests with him on your team. If your friendship with him reaches a certain level, he&#39;ll remain your ally even after the event ends.<\/div><div><br><\/div><div>The way Mega Man moves and attacks is based on his own games. Even the animations for when he takes damage or when his HP reaches 0 are call backs to his series!<\/div><div><br><\/div><div>We&#39;ll have more to share about his skills and shapeshifting capabilities in future notices, but trust me when I say, they will be...distinctly &quot;Mega Man&quot;...<\/div><div><br><\/div><div>You&#39;ll join Mega Man in fighting against the Greatwyrms, who will have special behavior for this event. But why the Greatwyrms? Well, a certain someone has come to the world of the Dragalia Lost...<\/div><div><br><\/div><div>But we&#39;re not spilling those beans yet! You&#39;ll just have to look forward to the event to find out exactly who this is.<\/div><div><br><\/div><div>You&#39;ll also be able to get event-specific items, wyrmprints, and weapons. There&#39;ll also be event-specific music!<\/div><div><br><\/div><div>November&#39;s This Month in Dragalia Lost will have more information on this, so keep an eye out for it.<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/f00874136fb0ee010dd090c00f7b96cc.png\\"><\/div><div><br><\/div><hr><div><br><\/div><div>Now let&#39;s go over some of the features we plan to implement by the end of the year.<\/div><div><br><\/div><div>\\u25a0New Difficulty Levels for Advanced Dragon Trials<\/div><div>We&#39;ll be adding difficulty levels to Advanced Dragon Trials at <span class=\\"local_date\\" data-local_date=\\"1570773600\\"><\/span>.<\/div><div><br><\/div><div>The current difficulty will be considered Standard, and we&#39;ll add Expert and Master difficulties. In Expert, the only difference will be that the high dragons have increased HP and strength; however, the increased HP means that you may not be able to circumvent some of the bosses&#39; moves by utilizing the break timing!<\/div><div><br><\/div><div>The element available for Master difficulty will change each week. The first Master difficulty available will be High Brunhilda. The dragons will behave differently in Master, so you&#39;ll have to cook up some new strategies to deal with them.<\/div><div><br><\/div><div>You can also craft new weapons using the new materials that will drop in Expert and Master.<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/37d96ee23f586df5c3ce4e537d9fbf4b.png\\"><\/div><div><br><\/div><div>To craft these weapons, you must first craft certain other weapons.<\/div><div><br><\/div><div>First, you&#39;ll need to use insignias and other materials to craft an elementally-attuned 5\\u2605 core weapon. Second, you&#39;ll need to craft a 5\\u2605 weapon with the High Dragon&#39;s Bane ability using the materials gained from Void Battles.<\/div><div><br><\/div><div>There&#39;s no need to fully unbind these weapons, but crafting each weapon type and element will allow you to craft new high dragon weapons.<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/fe9e2b6e2135f25195bc59f9ab53b8e9.png\\"><\/div><div><br><\/div><div>\\u25a0Time Attack Ranking for Advanced Dragon Trials<\/div><div>For a limited time starting <span class=\\"local_date\\" data-local_date=\\"1570773600\\"><\/span>, we&#39;ll be holding time-attack rankings for each element in the new Expert difficulty Advanced Dragon Trials.<\/div><div><br><\/div><div>Those who complete the time attack during the event will receive items based on their ranking! The top players will also get a special epithet, so we hope to see a lot of you battling it out.<\/div><div><br><\/div><div>The clear times and team composition for the top 25 teams will be made public, so those who are unable to participate will be able to use that information for reference when building teams in the future.<\/div><div><br><\/div><div>We&#39;re restricting it to the harder difficulty because this is the first ranking event. However, we&#39;d like to consider a wider scope for future ranking events based on how things go this time.<\/div><div><br><\/div><div>\\u25a0Sixth Tier for Mana Circles<\/div><div>We&#39;re expanding the opportunities for upgrading after unbinding the fifth mana circle tier. And right now, I can share the following information about the sixth mana circle tier:<\/div><div><br><\/div><div>\\u30fbThe sixth tier will not be available for all adventurers right off the bat. Instead, we will be adding it to adventurers over time.<\/div><div>\\u30fbYou&#39;ll be able to use it to upgrade various parameters, skills, and abilities.<\/div><div>\\u30fbWe&#39;re planning to implement it within the year.<\/div><div><br><\/div><div>We&#39;ll have some more information about this in future notifications.<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/096578ba9d44f907f6ac8a601f854ce1.png\\"><\/div><div><br><\/div><div>\\u25a0Updates to the Main Campaign<\/div><div>I hope everyone is looking forward to chapter 11 of the main campaign. We&#39;re currently planning on releasing it around December. And from that point on, we&#39;ll be adding one new chapter every other month.<\/div><div><br><\/div><div>As for the months that don&#39;t see a new chapter added, we&#39;ll add some other story segments to show a different perspective of the main campaign.<\/div><div><br><\/div><div>\\u25a0New Bosses<\/div><div>We&#39;re developing a new series of bosses for after the high dragons, the first of which we plan to have appear before the end of the year. As with the Advanced Dragon Trials, these bosses each have different tricks up their sleeves.<\/div><div><br><\/div><div>I can&#39;t share too many details just yet, but you can focus on crafting the new high dragon weapons as you await their release.<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/521344288f9c0b661d04c1a7474791bf.png\\"><\/div><div><br><\/div><hr><div>In the most recent Dragalia Digest, we listed a few features we&#39;re planning to add in the future. Now I&#39;d like to provide some more information on a few of them. We&#39;re developing these features with the aim of releasing them by the one-and-a-half-year anniversary in March of next year.<\/div><div><br><\/div><div>\\u25a0Facility Effects Apply Even in Your Storehouse<\/div><div>We&#39;re currently developing a feature that will allow the effects of facilities, such as those that strengthen your adventurers and dragons, to take effect even while they&#39;re stashed in your storehouse. I think this will make arranging the facilities in your castle grounds a little bit easier!<\/div><div><br><\/div><div>We&#39;re planning to add some more decorative facilities in the future, so hopefully you can better tailor the castle grounds to your personal tastes with this addition.<\/div><div><br><\/div><div>\\u25a0Change the Appearance of Weapons<\/div><div>We&#39;re currently developing a feature that will let you change the appearance of weapons without changing their traits. If there&#39;s a weapon design that you really like but it doesn&#39;t have the right abilities or elemental attunement, you&#39;ll be able to change just its appearance.<\/div><div><br><\/div><div>The fact that a weapon&#39;s appearance has been altered will be indicated in co-op rooms.<\/div><div><br><\/div><div>\\u25a0Automatically Replay a Selected Quest<\/div><div>We&#39;ll add a feature that will allow you to automatically challenge a selected quest until you run out of stamina. I think this feature will be particularly useful for collecting materials in The Imperial Onslaught and Dragon Trials.<\/div><div><br><\/div><div>\\u25a0Encyclopedia (Temporary Name)<\/div><div>We&#39;re developing an encyclopedia feature which will collect information about adventurers, weapons, dragons, wyrmprints, and even enemies. We&#39;re also hoping to provide rewards based on how complete your encyclopedia is.<\/div><div><br><\/div><div>\\u25a0Play Past Events Any Time<\/div><div>We plan to develop a feature that allows new players and those who were unable to participate in events to play certain past events at any time.<\/div><div><br><\/div><hr><div><br><\/div><div>Now here&#39;s a little information about the events planned for October.<\/div><div><br><\/div><div>\\u25a0October Events<\/div><div>A summon showcase featuring Cassandra and Delphi, who appear in the Fractured Futures, starts <span class=\\"local_date\\" data-local_date=\\"1570168800\\"><\/span>. Cassandra is the first wand adventurer with a counter skill. She can increase her HP with her first skill, and with her second skill she fires off powerful counterattacks as she takes damage.<\/div><div><br><\/div><div>Delphi is a unique adventurer compared to others we&#39;ve seen up until now. Like Cassandra, his second skill is a counter skill, but his can apply the poisoned affliction to enemies. Furthermore, the skill gauge for this skill charges over time. His quick daggers allow for a sort of hit-and-run fighting style.<\/div><div><br><\/div><div><img src=\\"https:\/\/dragalialost.akamaized.net\/attached\/information\/images\/2ab01e0744686c6b241a8e771e616741.png\\"><\/div><div><br><\/div><div>The Fractured Futures raid event is live until <span class=\\"local_date\\" data-local_date=\\"1570773599\\"><\/span>. You can collect raid boosts, which are a new feature, and use them to challenge the Omega raid battle, which is available for a limited time.<\/div><div><br><\/div><div>Then, at <span class=\\"local_date\\" data-local_date=\\"1570773600\\"><\/span>, new difficulty levels will be added to Advanced Dragon Trials. Additionally, Master difficulty will start <span class=\\"local_date\\" data-local_date=\\"1571032800\\"><\/span>, with Flame being the first one available for you to challenge. In conjunction with that, we&#39;ll be having an increased drops event for the water quest for The Imperial Onslaught.<\/div><div><br><\/div><div>We&#39;ll also add new Void enemies and hold a Catch-Up Campaign, which will provide useful items just for playing different parts of the game.<\/div><div><br><\/div><div>Next, we&#39;ll be reviving the Halloween event starting <span class=\\"local_date\\" data-local_date=\\"1571378400\\"><\/span>.<\/div><div>It&#39;s a revival event, but the rewards will be adjusted, Nightmare difficulty will be added, and we&#39;ll also bump up the facility levels.<\/div><div><br><\/div><div>Additionally, the summon showcase will feature new adventurers. We&#39;ll share more information about these new costume-clad adventurers in the showcase preview notification.<\/div><div><br><\/div><div>\\u25a0In Conclusion<\/div><div>We had a lot to talk about this time thanks to the Dragalia Digest, so thanks to everyone for reading through all these notes! To thank you all for your continued support, we&#39;ll be giving the following items to all players:<\/div><div><br><\/div><div>Gold Crystals x300<\/div><div>Succulent Dragonfruit x300<\/div><div>Gold Whetstone x300<\/div><div>Consecrated Water x300<\/div><div>Shadow Orbs x210<\/div><div>Nightfall Orbs x70<\/div><div>Nether Orbs x30<\/div><div>Rainbow Orb x3<\/div><div>Shadowwyrm&#39;s Scales x150<\/div><div>Shadowwyrm&#39;s Darkscales x50<\/div><div>Eldwater x30,000<\/div><div><br><\/div><div>This gift contains items for upgrading shadow-attuned adventurers, which will help you out in the first-anniversary raid event. Use these items to level up your shadow-attuned adventurers, unbind their mana circles, and challenge the raid boss!<\/div><div><br><\/div><div>Going forward, we&#39;ll post This Month in Dragalia Lost early each month and will be including content that we&#39;ve shared in What&#39;s Ahead for Dragalia Lost up until now. So now you can look forward to getting event information and information about future updates on a monthly basis!<\/div><div><br><\/div><div>As always, thank you for playing Dragalia Lost!<\/div>","start_time":1569909600,"prev_article_id":"753","next_article_id":"785","image_path":"","update_time":1569912211}}}'